stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/**
  ******************************************************************************
  * @file    stm32wl3xx.h
  * @author  MCD Application Team
  * @brief   CMSIS Cortex Device Peripheral Access Layer Header File.
  *          This file contains all the peripheral register's definitions, bits
  *          definitions and memory mapping for stm32wl33 devices.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef STM32WL3XX_H
#define STM32WL3XX_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup ST
  * @{
  */


/** @addtogroup STM32WL3x
  * @{
  */




/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ========================================  STM32WL3x Specific Interrupt Numbers  =========================================== */
  FLASH_IRQn                =   0,              /*!< 0  NVM interrupt                                                          */
  RCC_IRQn                  =   1,              /*!< 1  RCC interrupt                                                          */
  PVD_IRQn                  =   2,              /*!< 2  PVD interrupt                                                          */
  I2C1_IRQn                 =   3,              /*!< 3  I2C1 interrupt                                                         */
  I2C2_IRQn                 =   4,              /*!< 4  I2C2 interrupt                                                         */
  SPI1_IRQn                 =   5,              /*!< 5  SPI1 interrupt                                                         */
  SPI3_IRQn                 =   7,              /*!< 7  SPI3 interrupt                                                         */
  USART1_IRQn               =   8,              /*!< 8  USART interrupt                                                        */
  LPUART1_IRQn              =   9,              /*!< 9  Low Power UART interrupt                                               */
  TIM2_IRQn                 =  10,              /*!< 10 Timer 2 interrupt                                                      */
  RTC_IRQn                  =  11,              /*!< 11 RTC interrupt                                                          */
  ADC_IRQn                  =  12,              /*!< 12 ADC interrupt                                                          */
  AES_IRQn                  =  13,              /*!< 13 AES interrupt                                                         */
  GPIOA_IRQn                =  15,              /*!< 15 GPIOA interrupt                                                        */
  GPIOB_IRQn                =  16,              /*!< 16 GPIOB interrupt                                                        */
  DMA_IRQn                  =  17,              /*!< 17 DMA interrupt                                                          */
  LPAWUR_IRQn               =  18,              /*!< 18 LPAWUR interrupt                                                       */
  COMP1_IRQn                =  19,              /*!< 19 Comp interrupt through SYSCFGBLE                                       */
  MRSUBG_BUSY_IRQn          =  20,              /*!< 20 MR_SUBG Busy interrupt                                                 */
  MRSUBG_IRQn               =  21,              /*!< 21 MR_SUBG interrupt                                                      */
  MRSUBG_TX_RX_SEQUENCE_IRQn = 22,              /*!< 22 MR_SUBG TX/RX Sequence interrupt                                       */
  MRSUBG_TIMER_CPU_WKUP_IRQn = 23,              /*!< 23 CPU Wakeup interrupt                                                   */
  MRSUBG_WKUP_IRQn          =  24,              /*!< 24 SUBG Wakeup interrupt                                                  */
  DAC_IRQn                  =  25,              /*!< 25 DAC interrupt                                                          */
  TIM16_IRQn                =  26,              /*!< 26 TIM16 interrupt                                                        */
  LCD_IRQn                  =  27,              /*!< 27 LCD interrupt                                                          */
  LCSC_IRQn                 =  28,              /*!< 28 LCSC interrupt                                                         */
  LCSC_LC_ACTIVITY_IRQn     =  29               /*!< 28 LCSC LC activity interrupt                                             */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

