stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* ============================================================================================================================*/
/*=====================                                        RTC                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    TR    =====================================================*/
#define RTC_TR_PM_Pos                                                      (22UL)		/*!<RTC TR: PM (Bit 22) */
#define RTC_TR_PM_Msk                                                      (0x400000UL)		/*!< RTC TR: PM (Bitfield-Mask: 0x01) */
#define RTC_TR_PM                                                          RTC_TR_PM_Msk
#define RTC_TR_HT_Pos                                                      (20UL)		/*!<RTC TR: HT (Bit 20) */
#define RTC_TR_HT_Msk                                                      (0x300000UL)		/*!< RTC TR: HT (Bitfield-Mask: 0x03) */
#define RTC_TR_HT                                                          RTC_TR_HT_Msk
#define RTC_TR_HT_0                                                        (0x1U << RTC_TR_HT_Pos)
#define RTC_TR_HT_1                                                        (0x2U << RTC_TR_HT_Pos)
#define RTC_TR_HU_Pos                                                      (16UL)		/*!<RTC TR: HU (Bit 16) */
#define RTC_TR_HU_Msk                                                      (0xf0000UL)		/*!< RTC TR: HU (Bitfield-Mask: 0x0f) */
#define RTC_TR_HU                                                          RTC_TR_HU_Msk
#define RTC_TR_HU_0                                                        (0x1U << RTC_TR_HU_Pos)
#define RTC_TR_HU_1                                                        (0x2U << RTC_TR_HU_Pos)
#define RTC_TR_HU_2                                                        (0x4U << RTC_TR_HU_Pos)
#define RTC_TR_HU_3                                                        (0x8U << RTC_TR_HU_Pos)
#define RTC_TR_MNT_Pos                                                     (12UL)		/*!<RTC TR: MNT (Bit 12) */
#define RTC_TR_MNT_Msk                                                     (0x7000UL)		/*!< RTC TR: MNT (Bitfield-Mask: 0x07) */
#define RTC_TR_MNT                                                         RTC_TR_MNT_Msk
#define RTC_TR_MNT_0                                                       (0x1U << RTC_TR_MNT_Pos)
#define RTC_TR_MNT_1                                                       (0x2U << RTC_TR_MNT_Pos)
#define RTC_TR_MNT_2                                                       (0x4U << RTC_TR_MNT_Pos)
#define RTC_TR_MNU_Pos                                                     (8UL)		/*!<RTC TR: MNU (Bit 8) */
#define RTC_TR_MNU_Msk                                                     (0xf00UL)		/*!< RTC TR: MNU (Bitfield-Mask: 0x0f) */
#define RTC_TR_MNU                                                         RTC_TR_MNU_Msk
#define RTC_TR_MNU_0                                                       (0x1U << RTC_TR_MNU_Pos)
#define RTC_TR_MNU_1                                                       (0x2U << RTC_TR_MNU_Pos)
#define RTC_TR_MNU_2                                                       (0x4U << RTC_TR_MNU_Pos)
#define RTC_TR_MNU_3                                                       (0x8U << RTC_TR_MNU_Pos)
#define RTC_TR_ST_Pos                                                      (4UL)		/*!<RTC TR: ST (Bit 4) */
#define RTC_TR_ST_Msk                                                      (0x70UL)		/*!< RTC TR: ST (Bitfield-Mask: 0x07) */
#define RTC_TR_ST                                                          RTC_TR_ST_Msk
#define RTC_TR_ST_0                                                        (0x1U << RTC_TR_ST_Pos)
#define RTC_TR_ST_1                                                        (0x2U << RTC_TR_ST_Pos)
#define RTC_TR_ST_2                                                        (0x4U << RTC_TR_ST_Pos)
#define RTC_TR_SU_Pos                                                      (0UL)		/*!<RTC TR: SU (Bit 0) */
#define RTC_TR_SU_Msk                                                      (0xfUL)		/*!< RTC TR: SU (Bitfield-Mask: 0x0f) */
#define RTC_TR_SU                                                          RTC_TR_SU_Msk
#define RTC_TR_SU_0                                                        (0x1U << RTC_TR_SU_Pos)
#define RTC_TR_SU_1                                                        (0x2U << RTC_TR_SU_Pos)
#define RTC_TR_SU_2                                                        (0x4U << RTC_TR_SU_Pos)
#define RTC_TR_SU_3                                                        (0x8U << RTC_TR_SU_Pos)

/* =====================================================    DR    =====================================================*/
#define RTC_DR_YT_Pos                                                      (20UL)		/*!<RTC DR: YT (Bit 20) */
#define RTC_DR_YT_Msk                                                      (0xf00000UL)		/*!< RTC DR: YT (Bitfield-Mask: 0x0f) */
#define RTC_DR_YT                                                          RTC_DR_YT_Msk
#define RTC_DR_YT_0                                                        (0x1U << RTC_DR_YT_Pos)
#define RTC_DR_YT_1                                                        (0x2U << RTC_DR_YT_Pos)
#define RTC_DR_YT_2                                                        (0x4U << RTC_DR_YT_Pos)
#define RTC_DR_YT_3                                                        (0x8U << RTC_DR_YT_Pos)
#define RTC_DR_YU_Pos                                                      (16UL)		/*!<RTC DR: YU (Bit 16) */
#define RTC_DR_YU_Msk                                                      (0xf0000UL)		/*!< RTC DR: YU (Bitfield-Mask: 0x0f) */
#define RTC_DR_YU                                                          RTC_DR_YU_Msk
#define RTC_DR_YU_0                                                        (0x1U << RTC_DR_YU_Pos)
#define RTC_DR_YU_1                                                        (0x2U << RTC_DR_YU_Pos)
#define RTC_DR_YU_2                                                        (0x4U << RTC_DR_YU_Pos)
#define RTC_DR_YU_3                                                        (0x8U << RTC_DR_YU_Pos)
#define RTC_DR_WDU_Pos                                                     (13UL)		/*!<RTC DR: WDU (Bit 13) */
#define RTC_DR_WDU_Msk                                                     (0xe000UL)		/*!< RTC DR: WDU (Bitfield-Mask: 0x07) */
#define RTC_DR_WDU                                                         RTC_DR_WDU_Msk
#define RTC_DR_WDU_0                                                       (0x1U << RTC_DR_WDU_Pos)
#define RTC_DR_WDU_1                                                       (0x2U << RTC_DR_WDU_Pos)
#define RTC_DR_WDU_2                                                       (0x4U << RTC_DR_WDU_Pos)
#define RTC_DR_MT_Pos                                                      (12UL)		/*!<RTC DR: MT (Bit 12) */
#define RTC_DR_MT_Msk                                                      (0x1000UL)		/*!< RTC DR: MT (Bitfield-Mask: 0x01) */
#define RTC_DR_MT                                                          RTC_DR_MT_Msk
#define RTC_DR_MU_Pos                                                      (8UL)		/*!<RTC DR: MU (Bit 8) */
#define RTC_DR_MU_Msk                                                      (0xf00UL)		/*!< RTC DR: MU (Bitfield-Mask: 0x0f) */
#define RTC_DR_MU                                                          RTC_DR_MU_Msk
#define RTC_DR_MU_0                                                        (0x1U << RTC_DR_MU_Pos)
#define RTC_DR_MU_1                                                        (0x2U << RTC_DR_MU_Pos)
#define RTC_DR_MU_2                                                        (0x4U << RTC_DR_MU_Pos)
#define RTC_DR_MU_3                                                        (0x8U << RTC_DR_MU_Pos)
#define RTC_DR_DT_Pos                                                      (4UL)		/*!<RTC DR: DT (Bit 4) */
#define RTC_DR_DT_Msk                                                      (0x30UL)		/*!< RTC DR: DT (Bitfield-Mask: 0x03) */
#define RTC_DR_DT                                                          RTC_DR_DT_Msk
#define RTC_DR_DT_0                                                        (0x1U << RTC_DR_DT_Pos)
#define RTC_DR_DT_1                                                        (0x2U << RTC_DR_DT_Pos)
#define RTC_DR_DU_Pos                                                      (0UL)		/*!<RTC DR: DU (Bit 0) */
#define RTC_DR_DU_Msk                                                      (0xfUL)		/*!< RTC DR: DU (Bitfield-Mask: 0x0f) */
#define RTC_DR_DU                                                          RTC_DR_DU_Msk
#define RTC_DR_DU_0                                                        (0x1U << RTC_DR_DU_Pos)
#define RTC_DR_DU_1                                                        (0x2U << RTC_DR_DU_Pos)
#define RTC_DR_DU_2                                                        (0x4U << RTC_DR_DU_Pos)
#define RTC_DR_DU_3                                                        (0x8U << RTC_DR_DU_Pos)

/* =====================================================    CR    =====================================================*/
#define RTC_CR_ITSE_Pos                                                    (24UL)		/*!<RTC CR: ITSE (Bit 24) */
#define RTC_CR_ITSE_Msk                                                    (0x1000000UL)		/*!< RTC CR: ITSE (Bitfield-Mask: 0x01) */
#define RTC_CR_ITSE                                                        RTC_CR_ITSE_Msk
#define RTC_CR_COE_Pos                                                     (23UL)		/*!<RTC CR: COE (Bit 23) */
#define RTC_CR_COE_Msk                                                     (0x800000UL)		/*!< RTC CR: COE (Bitfield-Mask: 0x01) */
#define RTC_CR_COE                                                         RTC_CR_COE_Msk
#define RTC_CR_OSEL_Pos                                                    (21UL)		/*!<RTC CR: OSEL (Bit 21) */
#define RTC_CR_OSEL_Msk                                                    (0x600000UL)		/*!< RTC CR: OSEL (Bitfield-Mask: 0x03) */
#define RTC_CR_OSEL                                                        RTC_CR_OSEL_Msk
#define RTC_CR_OSEL_0                                                      (0x1U << RTC_CR_OSEL_Pos)
#define RTC_CR_OSEL_1                                                      (0x2U << RTC_CR_OSEL_Pos)
#define RTC_CR_POL_Pos                                                     (20UL)		/*!<RTC CR: POL (Bit 20) */
#define RTC_CR_POL_Msk                                                     (0x100000UL)		/*!< RTC CR: POL (Bitfield-Mask: 0x01) */
#define RTC_CR_POL                                                         RTC_CR_POL_Msk
#define RTC_CR_COSEL_Pos                                                   (19UL)		/*!<RTC CR: COSEL (Bit 19) */
#define RTC_CR_COSEL_Msk                                                   (0x80000UL)		/*!< RTC CR: COSEL (Bitfield-Mask: 0x01) */
#define RTC_CR_COSEL                                                       RTC_CR_COSEL_Msk
#define RTC_CR_BKP_Pos                                                     (18UL)		/*!<RTC CR: BKP (Bit 18) */
#define RTC_CR_BKP_Msk                                                     (0x40000UL)		/*!< RTC CR: BKP (Bitfield-Mask: 0x01) */
#define RTC_CR_BKP                                                         RTC_CR_BKP_Msk
#define RTC_CR_SUB1H_Pos                                                   (17UL)		/*!<RTC CR: SUB1H (Bit 17) */
#define RTC_CR_SUB1H_Msk                                                   (0x20000UL)		/*!< RTC CR: SUB1H (Bitfield-Mask: 0x01) */
#define RTC_CR_SUB1H                                                       RTC_CR_SUB1H_Msk
#define RTC_CR_ADD1H_Pos                                                   (16UL)		/*!<RTC CR: ADD1H (Bit 16) */
#define RTC_CR_ADD1H_Msk                                                   (0x10000UL)		/*!< RTC CR: ADD1H (Bitfield-Mask: 0x01) */
#define RTC_CR_ADD1H                                                       RTC_CR_ADD1H_Msk
#define RTC_CR_TSIE_Pos                                                    (15UL)		/*!<RTC CR: TSIE (Bit 15) */
#define RTC_CR_TSIE_Msk                                                    (0x8000UL)		/*!< RTC CR: TSIE (Bitfield-Mask: 0x01) */
#define RTC_CR_TSIE                                                        RTC_CR_TSIE_Msk
#define RTC_CR_WUTIE_Pos                                                   (14UL)		/*!<RTC CR: WUTIE (Bit 14) */
#define RTC_CR_WUTIE_Msk                                                   (0x4000UL)		/*!< RTC CR: WUTIE (Bitfield-Mask: 0x01) */
#define RTC_CR_WUTIE                                                       RTC_CR_WUTIE_Msk
#define RTC_CR_ALRAIE_Pos                                                  (12UL)		/*!<RTC CR: ALRAIE (Bit 12) */
#define RTC_CR_ALRAIE_Msk                                                  (0x1000UL)		/*!< RTC CR: ALRAIE (Bitfield-Mask: 0x01) */
#define RTC_CR_ALRAIE                                                      RTC_CR_ALRAIE_Msk
#define RTC_CR_TSE_Pos                                                     (11UL)		/*!<RTC CR: TSE (Bit 11) */
#define RTC_CR_TSE_Msk                                                     (0x800UL)		/*!< RTC CR: TSE (Bitfield-Mask: 0x01) */
#define RTC_CR_TSE                                                         RTC_CR_TSE_Msk
#define RTC_CR_WUTE_Pos                                                    (10UL)		/*!<RTC CR: WUTE (Bit 10) */
#define RTC_CR_WUTE_Msk                                                    (0x400UL)		/*!< RTC CR: WUTE (Bitfield-Mask: 0x01) */
#define RTC_CR_WUTE                                                        RTC_CR_WUTE_Msk
#define RTC_CR_ALRAE_Pos                                                   (8UL)		/*!<RTC CR: ALRAE (Bit 8) */
#define RTC_CR_ALRAE_Msk                                                   (0x100UL)		/*!< RTC CR: ALRAE (Bitfield-Mask: 0x01) */
#define RTC_CR_ALRAE                                                       RTC_CR_ALRAE_Msk
#define RTC_CR_FMT_Pos                                                     (6UL)		/*!<RTC CR: FMT (Bit 6) */
#define RTC_CR_FMT_Msk                                                     (0x40UL)		/*!< RTC CR: FMT (Bitfield-Mask: 0x01) */
#define RTC_CR_FMT                                                         RTC_CR_FMT_Msk
#define RTC_CR_BYPSHAD_Pos                                                 (5UL)		/*!<RTC CR: BYPSHAD (Bit 5) */
#define RTC_CR_BYPSHAD_Msk                                                 (0x20UL)		/*!< RTC CR: BYPSHAD (Bitfield-Mask: 0x01) */
#define RTC_CR_BYPSHAD                                                     RTC_CR_BYPSHAD_Msk
#define RTC_CR_TSEDGE_Pos                                                  (3UL)		/*!<RTC CR: TSEDGE (Bit 3) */
#define RTC_CR_TSEDGE_Msk                                                  (0x8UL)		/*!< RTC CR: TSEDGE (Bitfield-Mask: 0x01) */
#define RTC_CR_TSEDGE                                                      RTC_CR_TSEDGE_Msk
#define RTC_CR_WUCKSEL_Pos                                                 (0UL)		/*!<RTC CR: WUCKSEL (Bit 0) */
#define RTC_CR_WUCKSEL_Msk                                                 (0x7UL)		/*!< RTC CR: WUCKSEL (Bitfield-Mask: 0x07) */
#define RTC_CR_WUCKSEL                                                     RTC_CR_WUCKSEL_Msk
#define RTC_CR_WUCKSEL_0                                                   (0x1U << RTC_CR_WUCKSEL_Pos)
#define RTC_CR_WUCKSEL_1                                                   (0x2U << RTC_CR_WUCKSEL_Pos)
#define RTC_CR_WUCKSEL_2                                                   (0x4U << RTC_CR_WUCKSEL_Pos)

