stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    TSTR    =====================================================*/
#define RTC_TSTR_PM_Pos                                                    (22UL)		/*!<RTC TSTR: PM (Bit 22) */
#define RTC_TSTR_PM_Msk                                                    (0x400000UL)		/*!< RTC TSTR: PM (Bitfield-Mask: 0x01) */
#define RTC_TSTR_PM                                                        RTC_TSTR_PM_Msk
#define RTC_TSTR_HT_Pos                                                    (20UL)		/*!<RTC TSTR: HT (Bit 20) */
#define RTC_TSTR_HT_Msk                                                    (0x300000UL)		/*!< RTC TSTR: HT (Bitfield-Mask: 0x03) */
#define RTC_TSTR_HT                                                        RTC_TSTR_HT_Msk
#define RTC_TSTR_HT_0                                                      (0x1U << RTC_TSTR_HT_Pos)
#define RTC_TSTR_HT_1                                                      (0x2U << RTC_TSTR_HT_Pos)
#define RTC_TSTR_HU_Pos                                                    (16UL)		/*!<RTC TSTR: HU (Bit 16) */
#define RTC_TSTR_HU_Msk                                                    (0xf0000UL)		/*!< RTC TSTR: HU (Bitfield-Mask: 0x0f) */
#define RTC_TSTR_HU                                                        RTC_TSTR_HU_Msk
#define RTC_TSTR_HU_0                                                      (0x1U << RTC_TSTR_HU_Pos)
#define RTC_TSTR_HU_1                                                      (0x2U << RTC_TSTR_HU_Pos)
#define RTC_TSTR_HU_2                                                      (0x4U << RTC_TSTR_HU_Pos)
#define RTC_TSTR_HU_3                                                      (0x8U << RTC_TSTR_HU_Pos)
#define RTC_TSTR_MNT_Pos                                                   (12UL)		/*!<RTC TSTR: MNT (Bit 12) */
#define RTC_TSTR_MNT_Msk                                                   (0x7000UL)		/*!< RTC TSTR: MNT (Bitfield-Mask: 0x07) */
#define RTC_TSTR_MNT                                                       RTC_TSTR_MNT_Msk
#define RTC_TSTR_MNT_0                                                     (0x1U << RTC_TSTR_MNT_Pos)
#define RTC_TSTR_MNT_1                                                     (0x2U << RTC_TSTR_MNT_Pos)
#define RTC_TSTR_MNT_2                                                     (0x4U << RTC_TSTR_MNT_Pos)
#define RTC_TSTR_MNU_Pos                                                   (8UL)		/*!<RTC TSTR: MNU (Bit 8) */
#define RTC_TSTR_MNU_Msk                                                   (0xf00UL)		/*!< RTC TSTR: MNU (Bitfield-Mask: 0x0f) */
#define RTC_TSTR_MNU                                                       RTC_TSTR_MNU_Msk
#define RTC_TSTR_MNU_0                                                     (0x1U << RTC_TSTR_MNU_Pos)
#define RTC_TSTR_MNU_1                                                     (0x2U << RTC_TSTR_MNU_Pos)
#define RTC_TSTR_MNU_2                                                     (0x4U << RTC_TSTR_MNU_Pos)
#define RTC_TSTR_MNU_3                                                     (0x8U << RTC_TSTR_MNU_Pos)
#define RTC_TSTR_ST_Pos                                                    (4UL)		/*!<RTC TSTR: ST (Bit 4) */
#define RTC_TSTR_ST_Msk                                                    (0x70UL)		/*!< RTC TSTR: ST (Bitfield-Mask: 0x07) */
#define RTC_TSTR_ST                                                        RTC_TSTR_ST_Msk
#define RTC_TSTR_ST_0                                                      (0x1U << RTC_TSTR_ST_Pos)
#define RTC_TSTR_ST_1                                                      (0x2U << RTC_TSTR_ST_Pos)
#define RTC_TSTR_ST_2                                                      (0x4U << RTC_TSTR_ST_Pos)
#define RTC_TSTR_SU_Pos                                                    (0UL)		/*!<RTC TSTR: SU (Bit 0) */
#define RTC_TSTR_SU_Msk                                                    (0xfUL)		/*!< RTC TSTR: SU (Bitfield-Mask: 0x0f) */
#define RTC_TSTR_SU                                                        RTC_TSTR_SU_Msk
#define RTC_TSTR_SU_0                                                      (0x1U << RTC_TSTR_SU_Pos)
#define RTC_TSTR_SU_1                                                      (0x2U << RTC_TSTR_SU_Pos)
#define RTC_TSTR_SU_2                                                      (0x4U << RTC_TSTR_SU_Pos)
#define RTC_TSTR_SU_3                                                      (0x8U << RTC_TSTR_SU_Pos)

/* =====================================================    TSDR    =====================================================*/
#define RTC_TSDR_WDU_Pos                                                   (13UL)		/*!<RTC TSDR: WDU (Bit 13) */
#define RTC_TSDR_WDU_Msk                                                   (0xe000UL)		/*!< RTC TSDR: WDU (Bitfield-Mask: 0x07) */
#define RTC_TSDR_WDU                                                       RTC_TSDR_WDU_Msk
#define RTC_TSDR_WDU_0                                                     (0x1U << RTC_TSDR_WDU_Pos)
#define RTC_TSDR_WDU_1                                                     (0x2U << RTC_TSDR_WDU_Pos)
#define RTC_TSDR_WDU_2                                                     (0x4U << RTC_TSDR_WDU_Pos)
#define RTC_TSDR_MT_Pos                                                    (12UL)		/*!<RTC TSDR: MT (Bit 12) */
#define RTC_TSDR_MT_Msk                                                    (0x1000UL)		/*!< RTC TSDR: MT (Bitfield-Mask: 0x01) */
#define RTC_TSDR_MT                                                        RTC_TSDR_MT_Msk
#define RTC_TSDR_MU_Pos                                                    (8UL)		/*!<RTC TSDR: MU (Bit 8) */
#define RTC_TSDR_MU_Msk                                                    (0xf00UL)		/*!< RTC TSDR: MU (Bitfield-Mask: 0x0f) */
#define RTC_TSDR_MU                                                        RTC_TSDR_MU_Msk
#define RTC_TSDR_MU_0                                                      (0x1U << RTC_TSDR_MU_Pos)
#define RTC_TSDR_MU_1                                                      (0x2U << RTC_TSDR_MU_Pos)
#define RTC_TSDR_MU_2                                                      (0x4U << RTC_TSDR_MU_Pos)
#define RTC_TSDR_MU_3                                                      (0x8U << RTC_TSDR_MU_Pos)
#define RTC_TSDR_DT_Pos                                                    (4UL)		/*!<RTC TSDR: DT (Bit 4) */
#define RTC_TSDR_DT_Msk                                                    (0x30UL)		/*!< RTC TSDR: DT (Bitfield-Mask: 0x03) */
#define RTC_TSDR_DT                                                        RTC_TSDR_DT_Msk
#define RTC_TSDR_DT_0                                                      (0x1U << RTC_TSDR_DT_Pos)
#define RTC_TSDR_DT_1                                                      (0x2U << RTC_TSDR_DT_Pos)
#define RTC_TSDR_DU_Pos                                                    (0UL)		/*!<RTC TSDR: DU (Bit 0) */
#define RTC_TSDR_DU_Msk                                                    (0xfUL)		/*!< RTC TSDR: DU (Bitfield-Mask: 0x0f) */
#define RTC_TSDR_DU                                                        RTC_TSDR_DU_Msk
#define RTC_TSDR_DU_0                                                      (0x1U << RTC_TSDR_DU_Pos)
#define RTC_TSDR_DU_1                                                      (0x2U << RTC_TSDR_DU_Pos)
#define RTC_TSDR_DU_2                                                      (0x4U << RTC_TSDR_DU_Pos)
#define RTC_TSDR_DU_3                                                      (0x8U << RTC_TSDR_DU_Pos)

/* =====================================================    TSSSR    =====================================================*/
#define RTC_TSSSR_SS_Pos                                                   (0UL)		/*!<RTC TSSSR: SS (Bit 0) */
#define RTC_TSSSR_SS_Msk                                                   (0xffffUL)		/*!< RTC TSSSR: SS (Bitfield-Mask: 0xffff) */
#define RTC_TSSSR_SS                                                       RTC_TSSSR_SS_Msk
#define RTC_TSSSR_SS_0                                                     (0x1U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_1                                                     (0x2U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_2                                                     (0x4U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_3                                                     (0x8U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_4                                                     (0x10U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_5                                                     (0x20U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_6                                                     (0x40U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_7                                                     (0x80U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_8                                                     (0x100U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_9                                                     (0x200U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_10                                                    (0x400U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_11                                                    (0x800U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_12                                                    (0x1000U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_13                                                    (0x2000U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_14                                                    (0x4000U << RTC_TSSSR_SS_Pos)
#define RTC_TSSSR_SS_15                                                    (0x8000U << RTC_TSSSR_SS_Pos)

/* =====================================================    CALR    =====================================================*/
#define RTC_CALR_CALP_Pos                                                  (15UL)		/*!<RTC CALR: CALP (Bit 15) */
#define RTC_CALR_CALP_Msk                                                  (0x8000UL)		/*!< RTC CALR: CALP (Bitfield-Mask: 0x01) */
#define RTC_CALR_CALP                                                      RTC_CALR_CALP_Msk
#define RTC_CALR_CALW8_Pos                                                 (14UL)		/*!<RTC CALR: CALW8 (Bit 14) */
#define RTC_CALR_CALW8_Msk                                                 (0x4000UL)		/*!< RTC CALR: CALW8 (Bitfield-Mask: 0x01) */
#define RTC_CALR_CALW8                                                     RTC_CALR_CALW8_Msk
#define RTC_CALR_CALW16_Pos                                                (13UL)		/*!<RTC CALR: CALW16 (Bit 13) */
#define RTC_CALR_CALW16_Msk                                                (0x2000UL)		/*!< RTC CALR: CALW16 (Bitfield-Mask: 0x01) */
#define RTC_CALR_CALW16                                                    RTC_CALR_CALW16_Msk
#define RTC_CALR_CALM_Pos                                                  (0UL)		/*!<RTC CALR: CALM (Bit 0) */
#define RTC_CALR_CALM_Msk                                                  (0x1ffUL)		/*!< RTC CALR: CALM (Bitfield-Mask: 0x1ff) */
#define RTC_CALR_CALM                                                      RTC_CALR_CALM_Msk
#define RTC_CALR_CALM_0                                                    (0x1U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_1                                                    (0x2U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_2                                                    (0x4U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_3                                                    (0x8U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_4                                                    (0x10U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_5                                                    (0x20U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_6                                                    (0x40U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_7                                                    (0x80U << RTC_CALR_CALM_Pos)
#define RTC_CALR_CALM_8                                                    (0x100U << RTC_CALR_CALM_Pos)

