stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    TAMPCR    =====================================================*/
#define RTC_TAMPCR_TAMP1MF_Pos                                             (18UL)		/*!<RTC TAMPCR: TAMP1MF (Bit 18) */
#define RTC_TAMPCR_TAMP1MF_Msk                                             (0x40000UL)		/*!< RTC TAMPCR: TAMP1MF (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMP1MF                                                 RTC_TAMPCR_TAMP1MF_Msk
#define RTC_TAMPCR_TAMP1NOERASE_Pos                                        (17UL)		/*!<RTC TAMPCR: TAMP1NOERASE (Bit 17) */
#define RTC_TAMPCR_TAMP1NOERASE_Msk                                        (0x20000UL)		/*!< RTC TAMPCR: TAMP1NOERASE (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMP1NOERASE                                            RTC_TAMPCR_TAMP1NOERASE_Msk
#define RTC_TAMPCR_TAMP1IE_Pos                                             (16UL)		/*!<RTC TAMPCR: TAMP1IE (Bit 16) */
#define RTC_TAMPCR_TAMP1IE_Msk                                             (0x10000UL)		/*!< RTC TAMPCR: TAMP1IE (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMP1IE                                                 RTC_TAMPCR_TAMP1IE_Msk
#define RTC_TAMPCR_TAMPPUDIS_Pos                                           (15UL)		/*!<RTC TAMPCR: TAMPPUDIS (Bit 15) */
#define RTC_TAMPCR_TAMPPUDIS_Msk                                           (0x8000UL)		/*!< RTC TAMPCR: TAMPPUDIS (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMPPUDIS                                               RTC_TAMPCR_TAMPPUDIS_Msk
#define RTC_TAMPCR_TAMPPRCH_Pos                                            (13UL)		/*!<RTC TAMPCR: TAMPPRCH (Bit 13) */
#define RTC_TAMPCR_TAMPPRCH_Msk                                            (0x6000UL)		/*!< RTC TAMPCR: TAMPPRCH (Bitfield-Mask: 0x03) */
#define RTC_TAMPCR_TAMPPRCH                                                RTC_TAMPCR_TAMPPRCH_Msk
#define RTC_TAMPCR_TAMPPRCH_0                                              (0x1U << RTC_TAMPCR_TAMPPRCH_Pos)
#define RTC_TAMPCR_TAMPPRCH_1                                              (0x2U << RTC_TAMPCR_TAMPPRCH_Pos)
#define RTC_TAMPCR_TAMPFLT_Pos                                             (11UL)		/*!<RTC TAMPCR: TAMPFLT (Bit 11) */
#define RTC_TAMPCR_TAMPFLT_Msk                                             (0x1800UL)		/*!< RTC TAMPCR: TAMPFLT (Bitfield-Mask: 0x03) */
#define RTC_TAMPCR_TAMPFLT                                                 RTC_TAMPCR_TAMPFLT_Msk
#define RTC_TAMPCR_TAMPFLT_0                                               (0x1U << RTC_TAMPCR_TAMPFLT_Pos)
#define RTC_TAMPCR_TAMPFLT_1                                               (0x2U << RTC_TAMPCR_TAMPFLT_Pos)
#define RTC_TAMPCR_TAMPFREQ_Pos                                            (8UL)		/*!<RTC TAMPCR: TAMPFREQ (Bit 8) */
#define RTC_TAMPCR_TAMPFREQ_Msk                                            (0x700UL)		/*!< RTC TAMPCR: TAMPFREQ (Bitfield-Mask: 0x07) */
#define RTC_TAMPCR_TAMPFREQ                                                RTC_TAMPCR_TAMPFREQ_Msk
#define RTC_TAMPCR_TAMPFREQ_0                                              (0x1U << RTC_TAMPCR_TAMPFREQ_Pos)
#define RTC_TAMPCR_TAMPFREQ_1                                              (0x2U << RTC_TAMPCR_TAMPFREQ_Pos)
#define RTC_TAMPCR_TAMPFREQ_2                                              (0x4U << RTC_TAMPCR_TAMPFREQ_Pos)
#define RTC_TAMPCR_TAMPTS_Pos                                              (7UL)		/*!<RTC TAMPCR: TAMPTS (Bit 7) */
#define RTC_TAMPCR_TAMPTS_Msk                                              (0x80UL)		/*!< RTC TAMPCR: TAMPTS (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMPTS                                                  RTC_TAMPCR_TAMPTS_Msk
#define RTC_TAMPCR_TAMPIE_Pos                                              (2UL)		/*!<RTC TAMPCR: TAMPIE (Bit 2) */
#define RTC_TAMPCR_TAMPIE_Msk                                              (0x4UL)		/*!< RTC TAMPCR: TAMPIE (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMPIE                                                  RTC_TAMPCR_TAMPIE_Msk
#define RTC_TAMPCR_TAMP1TRG_Pos                                            (1UL)		/*!<RTC TAMPCR: TAMP1TRG (Bit 1) */
#define RTC_TAMPCR_TAMP1TRG_Msk                                            (0x2UL)		/*!< RTC TAMPCR: TAMP1TRG (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMP1TRG                                                RTC_TAMPCR_TAMP1TRG_Msk
#define RTC_TAMPCR_TAMP1E_Pos                                              (0UL)		/*!<RTC TAMPCR: TAMP1E (Bit 0) */
#define RTC_TAMPCR_TAMP1E_Msk                                              (0x1UL)		/*!< RTC TAMPCR: TAMP1E (Bitfield-Mask: 0x01) */
#define RTC_TAMPCR_TAMP1E                                                  RTC_TAMPCR_TAMP1E_Msk

/* =====================================================    ALRMASSR    =====================================================*/
#define RTC_ALRMASSR_MASKSS_Pos                                            (24UL)		/*!<RTC ALRMASSR: MASKSS (Bit 24) */
#define RTC_ALRMASSR_MASKSS_Msk                                            (0xf000000UL)		/*!< RTC ALRMASSR: MASKSS (Bitfield-Mask: 0x0f) */
#define RTC_ALRMASSR_MASKSS                                                RTC_ALRMASSR_MASKSS_Msk
#define RTC_ALRMASSR_MASKSS_0                                              (0x1U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_MASKSS_1                                              (0x2U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_MASKSS_2                                              (0x4U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_MASKSS_3                                              (0x8U << RTC_ALRMASSR_MASKSS_Pos)
#define RTC_ALRMASSR_SS_Pos                                                (0UL)		/*!<RTC ALRMASSR: SS (Bit 0) */
#define RTC_ALRMASSR_SS_Msk                                                (0x7fffUL)		/*!< RTC ALRMASSR: SS (Bitfield-Mask: 0x7fff) */
#define RTC_ALRMASSR_SS                                                    RTC_ALRMASSR_SS_Msk
#define RTC_ALRMASSR_SS_0                                                  (0x1U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_1                                                  (0x2U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_2                                                  (0x4U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_3                                                  (0x8U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_4                                                  (0x10U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_5                                                  (0x20U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_6                                                  (0x40U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_7                                                  (0x80U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_8                                                  (0x100U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_9                                                  (0x200U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_10                                                 (0x400U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_11                                                 (0x800U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_12                                                 (0x1000U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_13                                                 (0x2000U << RTC_ALRMASSR_SS_Pos)
#define RTC_ALRMASSR_SS_14                                                 (0x4000U << RTC_ALRMASSR_SS_Pos)

/* =====================================================    OR    =====================================================*/
#define RTC_OR_OUT_RMP_Pos                                                 (1UL)		/*!<RTC OR: RTC_OUT_RMP (Bit 1) */
#define RTC_OR_OUT_RMP_Msk                                                 (0x2UL)		/*!< RTC OR: RTC_OUT_RMP (Bitfield-Mask: 0x01) */
#define RTC_OR_OUT_RMP                                                     RTC_OR_OUT_RMP_Msk
#define RTC_OR_ALARMOUTTYPE_Pos                                            (0UL)		/*!<RTC OR: ALARMOUTTYPE (Bit 0) */
#define RTC_OR_ALARMOUTTYPE_Msk                                            (0x1UL)		/*!< RTC OR: ALARMOUTTYPE (Bitfield-Mask: 0x01) */
#define RTC_OR_ALARMOUTTYPE                                                RTC_OR_ALARMOUTTYPE_Msk

/* =====================================================    BKP0R    =====================================================*/
#define RTC_BKP0R_BKP_Pos                                                  (0UL)		/*!<RTC BKP0R: BKP (Bit 0) */
#define RTC_BKP0R_BKP_Msk                                                  (0xffffffffUL)		/*!< RTC BKP0R: BKP (Bitfield-Mask: 0xffffffff) */
#define RTC_BKP0R_BKP                                                      RTC_BKP0R_BKP_Msk
#define RTC_BKP0R_BKP_0                                                    (0x1U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_1                                                    (0x2U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_2                                                    (0x4U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_3                                                    (0x8U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_4                                                    (0x10U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_5                                                    (0x20U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_6                                                    (0x40U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_7                                                    (0x80U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_8                                                    (0x100U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_9                                                    (0x200U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_10                                                   (0x400U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_11                                                   (0x800U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_12                                                   (0x1000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_13                                                   (0x2000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_14                                                   (0x4000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_15                                                   (0x8000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_16                                                   (0x10000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_17                                                   (0x20000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_18                                                   (0x40000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_19                                                   (0x80000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_20                                                   (0x100000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_21                                                   (0x200000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_22                                                   (0x400000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_23                                                   (0x800000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_24                                                   (0x1000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_25                                                   (0x2000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_26                                                   (0x4000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_27                                                   (0x8000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_28                                                   (0x10000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_29                                                   (0x20000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_30                                                   (0x40000000U << RTC_BKP0R_BKP_Pos)
#define RTC_BKP0R_BKP_31                                                   (0x80000000UL << RTC_BKP0R_BKP_Pos)

/* =====================================================    BKP1R    =====================================================*/
#define RTC_BKP1R_BKP_Pos                                                  (0UL)		/*!<RTC BKP1R: BKP (Bit 0) */
#define RTC_BKP1R_BKP_Msk                                                  (0xffffffffUL)		/*!< RTC BKP1R: BKP (Bitfield-Mask: 0xffffffff) */
#define RTC_BKP1R_BKP                                                      RTC_BKP1R_BKP_Msk
#define RTC_BKP1R_BKP_0                                                    (0x1U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_1                                                    (0x2U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_2                                                    (0x4U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_3                                                    (0x8U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_4                                                    (0x10U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_5                                                    (0x20U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_6                                                    (0x40U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_7                                                    (0x80U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_8                                                    (0x100U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_9                                                    (0x200U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_10                                                   (0x400U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_11                                                   (0x800U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_12                                                   (0x1000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_13                                                   (0x2000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_14                                                   (0x4000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_15                                                   (0x8000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_16                                                   (0x10000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_17                                                   (0x20000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_18                                                   (0x40000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_19                                                   (0x80000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_20                                                   (0x100000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_21                                                   (0x200000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_22                                                   (0x400000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_23                                                   (0x800000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_24                                                   (0x1000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_25                                                   (0x2000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_26                                                   (0x4000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_27                                                   (0x8000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_28                                                   (0x10000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_29                                                   (0x20000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_30                                                   (0x40000000U << RTC_BKP1R_BKP_Pos)
#define RTC_BKP1R_BKP_31                                                   (0x80000000UL << RTC_BKP1R_BKP_Pos)

