stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/******************** Number of backup registers ******************************/
#define RTC_BKP_NUMBER                 (2U)

/* ============================================================================================================================*/
/*=====================                                        LCD                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define LCD_CR_BUFEN_Pos                                                   (8UL)		/*!<LCD CR: BUFEN (Bit 8) */
#define LCD_CR_BUFEN_Msk                                                   (0x100UL)		/*!< LCD CR: BUFEN (Bitfield-Mask: 0x01) */
#define LCD_CR_BUFEN                                                       LCD_CR_BUFEN_Msk
#define LCD_CR_BIAS_Pos                                                    (5UL)		/*!<LCD CR: BIAS (Bit 5) */
#define LCD_CR_BIAS_Msk                                                    (0x60UL)		/*!< LCD CR: BIAS (Bitfield-Mask: 0x03) */
#define LCD_CR_BIAS                                                        LCD_CR_BIAS_Msk
#define LCD_CR_BIAS_0                                                      (0x1U << LCD_CR_BIAS_Pos)
#define LCD_CR_BIAS_1                                                      (0x2U << LCD_CR_BIAS_Pos)
#define LCD_CR_DUTY_Pos                                                    (2UL)		/*!<LCD CR: DUTY (Bit 2) */
#define LCD_CR_DUTY_Msk                                                    (0x1cUL)		/*!< LCD CR: DUTY (Bitfield-Mask: 0x07) */
#define LCD_CR_DUTY                                                        LCD_CR_DUTY_Msk
#define LCD_CR_DUTY_0                                                      (0x1U << LCD_CR_DUTY_Pos)
#define LCD_CR_DUTY_1                                                      (0x2U << LCD_CR_DUTY_Pos)
#define LCD_CR_DUTY_2                                                      (0x4U << LCD_CR_DUTY_Pos)
#define LCD_CR_VSEL_Pos                                                    (1UL)		/*!<LCD CR: VSEL (Bit 1) */
#define LCD_CR_VSEL_Msk                                                    (0x2UL)		/*!< LCD CR: VSEL (Bitfield-Mask: 0x01) */
#define LCD_CR_VSEL                                                        LCD_CR_VSEL_Msk
#define LCD_CR_LCDEN_Pos                                                   (0UL)		/*!<LCD CR: LCDEN (Bit 0) */
#define LCD_CR_LCDEN_Msk                                                   (0x1UL)		/*!< LCD CR: LCDEN (Bitfield-Mask: 0x01) */
#define LCD_CR_LCDEN                                                       LCD_CR_LCDEN_Msk

/* =====================================================    FCR    =====================================================*/
#define LCD_FCR_PS_Pos                                                     (22UL)		/*!<LCD FCR: PS (Bit 22) */
#define LCD_FCR_PS_Msk                                                     (0x3c00000UL)		/*!< LCD FCR: PS (Bitfield-Mask: 0x0f) */
#define LCD_FCR_PS                                                         LCD_FCR_PS_Msk
#define LCD_FCR_PS_0                                                       (0x1U << LCD_FCR_PS_Pos)
#define LCD_FCR_PS_1                                                       (0x2U << LCD_FCR_PS_Pos)
#define LCD_FCR_PS_2                                                       (0x4U << LCD_FCR_PS_Pos)
#define LCD_FCR_PS_3                                                       (0x8U << LCD_FCR_PS_Pos)
#define LCD_FCR_DIV_Pos                                                    (18UL)		/*!<LCD FCR: DIV (Bit 18) */
#define LCD_FCR_DIV_Msk                                                    (0x3c0000UL)		/*!< LCD FCR: DIV (Bitfield-Mask: 0x0f) */
#define LCD_FCR_DIV                                                        LCD_FCR_DIV_Msk
#define LCD_FCR_DIV_0                                                      (0x1U << LCD_FCR_DIV_Pos)
#define LCD_FCR_DIV_1                                                      (0x2U << LCD_FCR_DIV_Pos)
#define LCD_FCR_DIV_2                                                      (0x4U << LCD_FCR_DIV_Pos)
#define LCD_FCR_DIV_3                                                      (0x8U << LCD_FCR_DIV_Pos)
#define LCD_FCR_BLINK_Pos                                                  (16UL)		/*!<LCD FCR: BLINK (Bit 16) */
#define LCD_FCR_BLINK_Msk                                                  (0x30000UL)		/*!< LCD FCR: BLINK (Bitfield-Mask: 0x03) */
#define LCD_FCR_BLINK                                                      LCD_FCR_BLINK_Msk
#define LCD_FCR_BLINK_0                                                    (0x1U << LCD_FCR_BLINK_Pos)
#define LCD_FCR_BLINK_1                                                    (0x2U << LCD_FCR_BLINK_Pos)
#define LCD_FCR_BLINKF_Pos                                                 (13UL)		/*!<LCD FCR: BLINKF (Bit 13) */
#define LCD_FCR_BLINKF_Msk                                                 (0xe000UL)		/*!< LCD FCR: BLINKF (Bitfield-Mask: 0x07) */
#define LCD_FCR_BLINKF                                                     LCD_FCR_BLINKF_Msk
#define LCD_FCR_BLINKF_0                                                   (0x1U << LCD_FCR_BLINKF_Pos)
#define LCD_FCR_BLINKF_1                                                   (0x2U << LCD_FCR_BLINKF_Pos)
#define LCD_FCR_BLINKF_2                                                   (0x4U << LCD_FCR_BLINKF_Pos)
#define LCD_FCR_CC_Pos                                                     (10UL)		/*!<LCD FCR: CC (Bit 10) */
#define LCD_FCR_CC_Msk                                                     (0x1c00UL)		/*!< LCD FCR: CC (Bitfield-Mask: 0x07) */
#define LCD_FCR_CC                                                         LCD_FCR_CC_Msk
#define LCD_FCR_CC_0                                                       (0x1U << LCD_FCR_CC_Pos)
#define LCD_FCR_CC_1                                                       (0x2U << LCD_FCR_CC_Pos)
#define LCD_FCR_CC_2                                                       (0x4U << LCD_FCR_CC_Pos)
#define LCD_FCR_DEAD_Pos                                                   (7UL)		/*!<LCD FCR: DEAD (Bit 7) */
#define LCD_FCR_DEAD_Msk                                                   (0x380UL)		/*!< LCD FCR: DEAD (Bitfield-Mask: 0x07) */
#define LCD_FCR_DEAD                                                       LCD_FCR_DEAD_Msk
#define LCD_FCR_DEAD_0                                                     (0x1U << LCD_FCR_DEAD_Pos)
#define LCD_FCR_DEAD_1                                                     (0x2U << LCD_FCR_DEAD_Pos)
#define LCD_FCR_DEAD_2                                                     (0x4U << LCD_FCR_DEAD_Pos)
#define LCD_FCR_PON_Pos                                                    (4UL)		/*!<LCD FCR: PON (Bit 4) */
#define LCD_FCR_PON_Msk                                                    (0x70UL)		/*!< LCD FCR: PON (Bitfield-Mask: 0x07) */
#define LCD_FCR_PON                                                        LCD_FCR_PON_Msk
#define LCD_FCR_PON_0                                                      (0x1U << LCD_FCR_PON_Pos)
#define LCD_FCR_PON_1                                                      (0x2U << LCD_FCR_PON_Pos)
#define LCD_FCR_PON_2                                                      (0x4U << LCD_FCR_PON_Pos)
#define LCD_FCR_UDDIE_Pos                                                  (3UL)		/*!<LCD FCR: UDDIE (Bit 3) */
#define LCD_FCR_UDDIE_Msk                                                  (0x8UL)		/*!< LCD FCR: UDDIE (Bitfield-Mask: 0x01) */
#define LCD_FCR_UDDIE                                                      LCD_FCR_UDDIE_Msk
#define LCD_FCR_SOFIE_Pos                                                  (1UL)		/*!<LCD FCR: SOFIE (Bit 1) */
#define LCD_FCR_SOFIE_Msk                                                  (0x2UL)		/*!< LCD FCR: SOFIE (Bitfield-Mask: 0x01) */
#define LCD_FCR_SOFIE                                                      LCD_FCR_SOFIE_Msk
#define LCD_FCR_HD_Pos                                                     (0UL)		/*!<LCD FCR: HD (Bit 0) */
#define LCD_FCR_HD_Msk                                                     (0x1UL)		/*!< LCD FCR: HD (Bitfield-Mask: 0x01) */
#define LCD_FCR_HD                                                         LCD_FCR_HD_Msk

/* =====================================================    SR    =====================================================*/
#define LCD_SR_FCRSF_Pos                                                   (5UL)		/*!<LCD SR: FCRSF (Bit 5) */
#define LCD_SR_FCRSF_Msk                                                   (0x20UL)		/*!< LCD SR: FCRSF (Bitfield-Mask: 0x01) */
#define LCD_SR_FCRSF                                                       LCD_SR_FCRSF_Msk
#define LCD_SR_RDY_Pos                                                     (4UL)		/*!<LCD SR: RDY (Bit 4) */
#define LCD_SR_RDY_Msk                                                     (0x10UL)		/*!< LCD SR: RDY (Bitfield-Mask: 0x01) */
#define LCD_SR_RDY                                                         LCD_SR_RDY_Msk
#define LCD_SR_UDD_Pos                                                     (3UL)		/*!<LCD SR: UDD (Bit 3) */
#define LCD_SR_UDD_Msk                                                     (0x8UL)		/*!< LCD SR: UDD (Bitfield-Mask: 0x01) */
#define LCD_SR_UDD                                                         LCD_SR_UDD_Msk
#define LCD_SR_UDR_Pos                                                     (2UL)		/*!<LCD SR: UDR (Bit 2) */
#define LCD_SR_UDR_Msk                                                     (0x4UL)		/*!< LCD SR: UDR (Bitfield-Mask: 0x01) */
#define LCD_SR_UDR                                                         LCD_SR_UDR_Msk
#define LCD_SR_SOF_Pos                                                     (1UL)		/*!<LCD SR: SOF (Bit 1) */
#define LCD_SR_SOF_Msk                                                     (0x2UL)		/*!< LCD SR: SOF (Bitfield-Mask: 0x01) */
#define LCD_SR_SOF                                                         LCD_SR_SOF_Msk
#define LCD_SR_ENS_Pos                                                     (0UL)		/*!<LCD SR: ENS (Bit 0) */
#define LCD_SR_ENS_Msk                                                     (0x1UL)		/*!< LCD SR: ENS (Bitfield-Mask: 0x01) */
#define LCD_SR_ENS                                                         LCD_SR_ENS_Msk

