stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* ============================================================================================================================*/
/*=====================                                      DBGMCU                                      =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define DBGMCU_CR_DBG_STOP_Pos                                             (1UL)		/*!<DBGMCU CR: DBG_STOP (Bit 1) */
#define DBGMCU_CR_DBG_STOP_Msk                                             (0x2UL)		/*!< DBGMCU CR: DBG_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_CR_DBG_STOP                                                 DBGMCU_CR_DBG_STOP_Msk
#define DBGMCU_CR_DBG_SLEEP_Pos                                            (0UL)		/*!<DBGMCU CR: DBG_SLEEP (Bit 0) */
#define DBGMCU_CR_DBG_SLEEP_Msk                                            (0x1UL)		/*!< DBGMCU CR: DBG_SLEEP (Bitfield-Mask: 0x01) */
#define DBGMCU_CR_DBG_SLEEP                                                DBGMCU_CR_DBG_SLEEP_Msk

/* =====================================================    DBG_APB0_FZ    =====================================================*/
#define DBGMCU_DBG_APB0_FZ_DBG_IWDG_STOP_Pos                               (14UL)		/*!<DBGMCU DBG_APB0_FZ: DBG_IWDG_STOP (Bit 14) */
#define DBGMCU_DBG_APB0_FZ_DBG_IWDG_STOP_Msk                               (0x4000UL)		/*!< DBGMCU DBG_APB0_FZ: DBG_IWDG_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_DBG_APB0_FZ_DBG_IWDG_STOP                                   DBGMCU_DBG_APB0_FZ_DBG_IWDG_STOP_Msk
#define DBGMCU_DBG_APB0_FZ_DBG_RTC_STOP_Pos                                (12UL)		/*!<DBGMCU DBG_APB0_FZ: DBG_RTC_STOP (Bit 12) */
#define DBGMCU_DBG_APB0_FZ_DBG_RTC_STOP_Msk                                (0x1000UL)		/*!< DBGMCU DBG_APB0_FZ: DBG_RTC_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_DBG_APB0_FZ_DBG_RTC_STOP                                    DBGMCU_DBG_APB0_FZ_DBG_RTC_STOP_Msk
#define DBGMCU_DBG_APB0_FZ_DBG_TIM16_STOP_Pos                              (1UL)		/*!<DBGMCU DBG_APB0_FZ: DBG_TIM16_STOP (Bit 1) */
#define DBGMCU_DBG_APB0_FZ_DBG_TIM16_STOP_Msk                              (0x2UL)		/*!< DBGMCU DBG_APB0_FZ: DBG_TIM16_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_DBG_APB0_FZ_DBG_TIM16_STOP                                  DBGMCU_DBG_APB0_FZ_DBG_TIM16_STOP_Msk
#define DBGMCU_DBG_APB0_FZ_DBG_TIM2_STOP_Pos                               (0UL)		/*!<DBGMCU DBG_APB0_FZ: DBG_TIM2_STOP (Bit 0) */
#define DBGMCU_DBG_APB0_FZ_DBG_TIM2_STOP_Msk                               (0x1UL)		/*!< DBGMCU DBG_APB0_FZ: DBG_TIM2_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_DBG_APB0_FZ_DBG_TIM2_STOP                                   DBGMCU_DBG_APB0_FZ_DBG_TIM2_STOP_Msk

/* =====================================================    DBG_APB1_FZ    =====================================================*/
#define DBGMCU_DBG_APB1_FZ_DBG_I2C2_STOP_Pos                               (23UL)		/*!<DBGMCU DBG_APB1_FZ: DBG_I2C2_STOP (Bit 23) */
#define DBGMCU_DBG_APB1_FZ_DBG_I2C2_STOP_Msk                               (0x800000UL)		/*!< DBGMCU DBG_APB1_FZ: DBG_I2C2_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_DBG_APB1_FZ_DBG_I2C2_STOP                                   DBGMCU_DBG_APB1_FZ_DBG_I2C2_STOP_Msk
#define DBGMCU_DBG_APB1_FZ_DBG_I2C1_STOP_Pos                               (21UL)		/*!<DBGMCU DBG_APB1_FZ: DBG_I2C1_STOP (Bit 21) */
#define DBGMCU_DBG_APB1_FZ_DBG_I2C1_STOP_Msk                               (0x200000UL)		/*!< DBGMCU DBG_APB1_FZ: DBG_I2C1_STOP (Bitfield-Mask: 0x01) */
#define DBGMCU_DBG_APB1_FZ_DBG_I2C1_STOP                                   DBGMCU_DBG_APB1_FZ_DBG_I2C1_STOP_Msk


/* ============================================================================================================================*/
/*=====================                                       COMP                                       =====================*/
/* ============================================================================================================================*/

/* =====================================================    CSR    =====================================================*/
#define COMP_CSR_LOCK_Pos                                                  (31UL)		/*!<COMP CSR: LOCK (Bit 31) */
#define COMP_CSR_LOCK_Msk                                                  (0x80000000UL)		/*!< COMP CSR: LOCK (Bitfield-Mask: 0x01) */
#define COMP_CSR_LOCK                                                      COMP_CSR_LOCK_Msk
#define COMP_CSR_VALUE_Pos                                                 (30UL)		/*!<COMP CSR: VALUE (Bit 30) */
#define COMP_CSR_VALUE_Msk                                                 (0x40000000UL)		/*!< COMP CSR: VALUE (Bitfield-Mask: 0x01) */
#define COMP_CSR_VALUE                                                     COMP_CSR_VALUE_Msk
#define COMP_CSR_SCALEN_Pos                                                (23UL)		/*!<COMP CSR: SCALEN (Bit 23) */
#define COMP_CSR_SCALEN_Msk                                                (0x800000UL)		/*!< COMP CSR: SCALEN (Bitfield-Mask: 0x01) */
#define COMP_CSR_SCALEN                                                    COMP_CSR_SCALEN_Msk
#define COMP_CSR_BRGEN_Pos                                                 (22UL)		/*!<COMP CSR: BRGEN (Bit 22) */
#define COMP_CSR_BRGEN_Msk                                                 (0x400000UL)		/*!< COMP CSR: BRGEN (Bitfield-Mask: 0x01) */
#define COMP_CSR_BRGEN                                                     COMP_CSR_BRGEN_Msk
#define COMP_CSR_BLANKING_Pos                                              (18UL)		/*!<COMP CSR: BLANKING (Bit 18) */
#define COMP_CSR_BLANKING_Msk                                              (0x1c0000UL)		/*!< COMP CSR: BLANKING (Bitfield-Mask: 0x07) */
#define COMP_CSR_BLANKING                                                  COMP_CSR_BLANKING_Msk
#define COMP_CSR_BLANKING_0                                                (0x1U << COMP_CSR_BLANKING_Pos)
#define COMP_CSR_BLANKING_1                                                (0x2U << COMP_CSR_BLANKING_Pos)
#define COMP_CSR_BLANKING_2                                                (0x4U << COMP_CSR_BLANKING_Pos)
#define COMP_CSR_HYST_Pos                                                  (16UL)		/*!<COMP CSR: HYST (Bit 16) */
#define COMP_CSR_HYST_Msk                                                  (0x30000UL)		/*!< COMP CSR: HYST (Bitfield-Mask: 0x03) */
#define COMP_CSR_HYST                                                      COMP_CSR_HYST_Msk
#define COMP_CSR_HYST_0                                                    (0x1U << COMP_CSR_HYST_Pos)
#define COMP_CSR_HYST_1                                                    (0x2U << COMP_CSR_HYST_Pos)
#define COMP_CSR_POLARITY_Pos                                              (15UL)		/*!<COMP CSR: POLARITY (Bit 15) */
#define COMP_CSR_POLARITY_Msk                                              (0x8000UL)		/*!< COMP CSR: POLARITY (Bitfield-Mask: 0x01) */
#define COMP_CSR_POLARITY                                                  COMP_CSR_POLARITY_Msk
#define COMP_CSR_INPSEL_Pos                                                (7UL)		/*!<COMP CSR: INPSEL (Bit 7) */
#define COMP_CSR_INPSEL_Msk                                                (0x180UL)		/*!< COMP CSR: INPSEL (Bitfield-Mask: 0x03) */
#define COMP_CSR_INPSEL                                                    COMP_CSR_INPSEL_Msk
#define COMP_CSR_INPSEL_0                                                  (0x1U << COMP_CSR_INPSEL_Pos)
#define COMP_CSR_INPSEL_1                                                  (0x2U << COMP_CSR_INPSEL_Pos)
#define COMP_CSR_INMSEL_Pos                                                (4UL)		/*!<COMP CSR: INMSEL (Bit 4) */
#define COMP_CSR_INMSEL_Msk                                                (0x70UL)		/*!< COMP CSR: INMSEL (Bitfield-Mask: 0x07) */
#define COMP_CSR_INMSEL                                                    COMP_CSR_INMSEL_Msk
#define COMP_CSR_INMSEL_0                                                  (0x1U << COMP_CSR_INMSEL_Pos)
#define COMP_CSR_INMSEL_1                                                  (0x2U << COMP_CSR_INMSEL_Pos)
#define COMP_CSR_INMSEL_2                                                  (0x4U << COMP_CSR_INMSEL_Pos)
#define COMP_CSR_PWRMODE_Pos                                               (2UL)		/*!<COMP CSR: PWRMODE (Bit 2) */
#define COMP_CSR_PWRMODE_Msk                                               (0xcUL)		/*!< COMP CSR: PWRMODE (Bitfield-Mask: 0x03) */
#define COMP_CSR_PWRMODE                                                   COMP_CSR_PWRMODE_Msk
#define COMP_CSR_PWRMODE_0                                                 (0x1U << COMP_CSR_PWRMODE_Pos)
#define COMP_CSR_PWRMODE_1                                                 (0x2U << COMP_CSR_PWRMODE_Pos)
#define COMP_CSR_EN_Pos                                                    (0UL)		/*!<COMP CSR: EN (Bit 0) */
#define COMP_CSR_EN_Msk                                                    (0x1UL)		/*!< COMP CSR: EN (Bitfield-Mask: 0x01) */
#define COMP_CSR_EN                                                        COMP_CSR_EN_Msk


