stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* ============================================================================================================================*/
/*=====================                                       LCSC                                       =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR0    =====================================================*/
#define LCSC_CR0_TICAP_Pos                                                 (24UL)		/*!<LCSC CR0: TICAP (Bit 24) */
#define LCSC_CR0_TICAP_Msk                                                 (0x7000000UL)		/*!< LCSC CR0: TICAP (Bitfield-Mask: 0x07) */
#define LCSC_CR0_TICAP                                                     LCSC_CR0_TICAP_Msk
#define LCSC_CR0_TICAP_0                                                   (0x1U << LCSC_CR0_TICAP_Pos)
#define LCSC_CR0_TICAP_1                                                   (0x2U << LCSC_CR0_TICAP_Pos)
#define LCSC_CR0_TICAP_2                                                   (0x4U << LCSC_CR0_TICAP_Pos)
#define LCSC_CR0_TCAP_Pos                                                  (16UL)		/*!<LCSC CR0: TCAP (Bit 16) */
#define LCSC_CR0_TCAP_Msk                                                  (0x3f0000UL)		/*!< LCSC CR0: TCAP (Bitfield-Mask: 0x3f) */
#define LCSC_CR0_TCAP                                                      LCSC_CR0_TCAP_Msk
#define LCSC_CR0_TCAP_0                                                    (0x1U << LCSC_CR0_TCAP_Pos)
#define LCSC_CR0_TCAP_1                                                    (0x2U << LCSC_CR0_TCAP_Pos)
#define LCSC_CR0_TCAP_2                                                    (0x4U << LCSC_CR0_TCAP_Pos)
#define LCSC_CR0_TCAP_3                                                    (0x8U << LCSC_CR0_TCAP_Pos)
#define LCSC_CR0_TCAP_4                                                    (0x10U << LCSC_CR0_TCAP_Pos)
#define LCSC_CR0_TCAP_5                                                    (0x20U << LCSC_CR0_TCAP_Pos)
#define LCSC_CR0_TMEAS_Pos                                                 (0UL)		/*!<LCSC CR0: TMEAS (Bit 0) */
#define LCSC_CR0_TMEAS_Msk                                                 (0x3fffUL)		/*!< LCSC CR0: TMEAS (Bitfield-Mask: 0x3fff) */
#define LCSC_CR0_TMEAS                                                     LCSC_CR0_TMEAS_Msk
#define LCSC_CR0_TMEAS_0                                                   (0x1U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_1                                                   (0x2U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_2                                                   (0x4U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_3                                                   (0x8U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_4                                                   (0x10U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_5                                                   (0x20U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_6                                                   (0x40U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_7                                                   (0x80U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_8                                                   (0x100U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_9                                                   (0x200U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_10                                                  (0x400U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_11                                                  (0x800U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_12                                                  (0x1000U << LCSC_CR0_TMEAS_Pos)
#define LCSC_CR0_TMEAS_13                                                  (0x2000U << LCSC_CR0_TMEAS_Pos)

/* =====================================================    CR1    =====================================================*/
#define LCSC_CR1_TSTART_VCM_Pos                                            (20UL)
#define LCSC_CR1_TSTART_VCM_Msk                                            (0x7ff00000UL)
#define LCSC_CR1_TSTART_VCM                                                LCSC_CR1_TSTART_VCM_Msk
#define LCSC_CR1_TREC_VCM_Pos                                              (10UL)		/*!<LCSC CR1: TREC_VCM (Bit 10) */
#define LCSC_CR1_TREC_VCM_Msk                                              (0x7fc00UL)		/*!< LCSC CR1: TREC_VCM (Bitfield-Mask: 0x1ff) */
#define LCSC_CR1_TREC_VCM                                                  LCSC_CR1_TREC_VCM_Msk
#define LCSC_CR1_TREC_VCM_0                                                (0x1U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_1                                                (0x2U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_2                                                (0x4U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_3                                                (0x8U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_4                                                (0x10U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_5                                                (0x20U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_6                                                (0x40U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_7                                                (0x80U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_TREC_VCM_8                                                (0x100U << LCSC_CR1_TREC_VCM_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_Pos                                       (0UL)		/*!<LCSC CR1: LCAB_DAMP_THRES (Bit 0) */
#define LCSC_CR1_LCAB_DAMP_THRES_Msk                                       (0xffUL)		/*!< LCSC CR1: LCAB_DAMP_THRES (Bitfield-Mask: 0xff) */
#define LCSC_CR1_LCAB_DAMP_THRES                                           LCSC_CR1_LCAB_DAMP_THRES_Msk
#define LCSC_CR1_LCAB_DAMP_THRES_0                                         (0x1U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_1                                         (0x2U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_2                                         (0x4U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_3                                         (0x8U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_4                                         (0x10U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_5                                         (0x20U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_6                                         (0x40U << LCSC_CR1_LCAB_DAMP_THRES_Pos)
#define LCSC_CR1_LCAB_DAMP_THRES_7                                         (0x80U << LCSC_CR1_LCAB_DAMP_THRES_Pos)

/* =====================================================    CR2    =====================================================*/
#define LCSC_CR2_LCT_DAMP_THRES_Pos                                        (8UL)		/*!<LCSC CR2: LCT_DAMP_THRES (Bit 8) */
#define LCSC_CR2_LCT_DAMP_THRES_Msk                                        (0xff00UL)		/*!< LCSC CR2: LCT_DAMP_THRES (Bitfield-Mask: 0xff) */
#define LCSC_CR2_LCT_DAMP_THRES                                            LCSC_CR2_LCT_DAMP_THRES_Msk
#define LCSC_CR2_LCT_DAMP_THRES_0                                          (0x1U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_1                                          (0x2U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_2                                          (0x4U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_3                                          (0x8U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_4                                          (0x10U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_5                                          (0x20U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_6                                          (0x40U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_LCT_DAMP_THRES_7                                          (0x80U << LCSC_CR2_LCT_DAMP_THRES_Pos)
#define LCSC_CR2_TAMP_PSC_Pos                                              (0UL)		/*!<LCSC CR2: TAMP_PSC (Bit 0) */
#define LCSC_CR2_TAMP_PSC_Msk                                              (0xffUL)		/*!< LCSC CR2: TAMP_PSC (Bitfield-Mask: 0xff) */
#define LCSC_CR2_TAMP_PSC                                                  LCSC_CR2_TAMP_PSC_Msk
#define LCSC_CR2_TAMP_PSC_0                                                (0x1U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_1                                                (0x2U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_2                                                (0x4U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_3                                                (0x8U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_4                                                (0x10U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_5                                                (0x20U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_6                                                (0x40U << LCSC_CR2_TAMP_PSC_Pos)
#define LCSC_CR2_TAMP_PSC_7                                                (0x80U << LCSC_CR2_TAMP_PSC_Pos)

/* =====================================================    PULSE_CR    =====================================================*/
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH_Pos                                  (8UL)/*!<LCSC PULSE_CR: LCT_PULSE_WIDTH (Bit 8) */
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH_Msk                                  (0xf00UL)/*!< LCSC PULSE_CR: LCT_PULSE_WIDTH (Bitfield-Mask: 0x0f) */
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH                                      LCSC_PULSE_CR_LCT_PULSE_WIDTH_Msk
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH_0                                    (0x1U << LCSC_PULSE_CR_LCT_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH_1                                    (0x2U << LCSC_PULSE_CR_LCT_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH_2                                    (0x4U << LCSC_PULSE_CR_LCT_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_LCT_PULSE_WIDTH_3                                    (0x8U << LCSC_PULSE_CR_LCT_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_PULSETRIM_Pos                                        (4UL)/*!<LCSC PULSE_CR: PULSETRIM (Bit 4) */
#define LCSC_PULSE_CR_PULSETRIM_Msk                                        (0xf0UL)/*!< LCSC PULSE_CR: PULSETRIM (Bitfield-Mask: 0xf0) */
#define LCSC_PULSE_CR_PULSETRIM                                            LCSC_PULSE_CR_PULSETRIM_Msk
#define LCSC_PULSE_CR_PULSETRIM_0                                          (0x1U << LCSC_PULSE_CR_PULSETRIM_Pos)
#define LCSC_PULSE_CR_PULSETRIM_1                                          (0x2U << LCSC_PULSE_CR_PULSETRIM_Pos)
#define LCSC_PULSE_CR_PULSETRIM_2                                          (0x4U << LCSC_PULSE_CR_PULSETRIM_Pos)
#define LCSC_PULSE_CR_PULSETRIM_3                                          (0x8U << LCSC_PULSE_CR_PULSETRIM_Pos)
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Pos                                 (0UL)/*!<LCSC PULSE_CR: LCAB_PULSE_WIDTH (Bit 0) */
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Msk                                 (0xfUL)/*!< LCSC PULSE_CR: LCAB_PULSE_WIDTH (Bitfield-Mask: 0xf) */
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH                                     LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Msk
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH_0                                   (0x1U << LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH_1                                   (0x2U << LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH_2                                   (0x4U << LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Pos)
#define LCSC_PULSE_CR_LCAB_PULSE_WIDTH_3                                   (0x8U << LCSC_PULSE_CR_LCAB_PULSE_WIDTH_Pos)

