stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    ISR    =====================================================*/
#define LCSC_ISR_CNT_OFB_F_Pos                                             (3UL)		/*!<LCSC ISR: CNT_OFB_F (Bit 3) */
#define LCSC_ISR_CNT_OFB_F_Msk                                             (0x8UL)		/*!< LCSC ISR: CNT_OFB_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_CNT_OFB_F                                                 LCSC_ISR_CNT_OFB_F_Msk
#define LCSC_ISR_TAMP_F_Pos                                                (2UL)		/*!<LCSC ISR: TAMP_F (Bit 2) */
#define LCSC_ISR_TAMP_F_Msk                                                (0x4UL)		/*!< LCSC ISR: TAMP_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_TAMP_F                                                    LCSC_ISR_TAMP_F_Msk
#define LCSC_ISR_ACLKWISE_F_Pos                                            (1UL)		/*!<LCSC ISR: ACLKWISE_F (Bit 1) */
#define LCSC_ISR_ACLKWISE_F_Msk                                            (0x2UL)		/*!< LCSC ISR: ACLKWISE_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_ACLKWISE_F                                                LCSC_ISR_ACLKWISE_F_Msk
#define LCSC_ISR_CLKWISE_F_Pos                                             (0UL)		/*!<LCSC ISR: CLKWISE_F (Bit 0) */
#define LCSC_ISR_CLKWISE_F_Msk                                             (0x1UL)		/*!< LCSC ISR: CLKWISE_F (Bitfield-Mask: 0x01) */
#define LCSC_ISR_CLKWISE_F                                                 LCSC_ISR_CLKWISE_F_Msk


/* ============================================================================================================================*/
/*=====================                                        I2C                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR1    =====================================================*/
#define I2C_CR1_PECEN_Pos                                                  (23UL)		/*!<I2C CR1: PECEN (Bit 23) */
#define I2C_CR1_PECEN_Msk                                                  (0x800000UL)		/*!< I2C CR1: PECEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_PECEN                                                      I2C_CR1_PECEN_Msk
#define I2C_CR1_ALERTEN_Pos                                                (22UL)		/*!<I2C CR1: ALERTEN (Bit 22) */
#define I2C_CR1_ALERTEN_Msk                                                (0x400000UL)		/*!< I2C CR1: ALERTEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_ALERTEN                                                    I2C_CR1_ALERTEN_Msk
#define I2C_CR1_SMBDEN_Pos                                                 (21UL)		/*!<I2C CR1: SMBDEN (Bit 21) */
#define I2C_CR1_SMBDEN_Msk                                                 (0x200000UL)		/*!< I2C CR1: SMBDEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_SMBDEN                                                     I2C_CR1_SMBDEN_Msk
#define I2C_CR1_SMBHEN_Pos                                                 (20UL)		/*!<I2C CR1: SMBHEN (Bit 20) */
#define I2C_CR1_SMBHEN_Msk                                                 (0x100000UL)		/*!< I2C CR1: SMBHEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_SMBHEN                                                     I2C_CR1_SMBHEN_Msk
#define I2C_CR1_GCEN_Pos                                                   (19UL)		/*!<I2C CR1: GCEN (Bit 19) */
#define I2C_CR1_GCEN_Msk                                                   (0x80000UL)		/*!< I2C CR1: GCEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_GCEN                                                       I2C_CR1_GCEN_Msk
#define I2C_CR1_NOSTRETCH_Pos                                              (17UL)		/*!<I2C CR1: NOSTRETCH (Bit 17) */
#define I2C_CR1_NOSTRETCH_Msk                                              (0x20000UL)		/*!< I2C CR1: NOSTRETCH (Bitfield-Mask: 0x01) */
#define I2C_CR1_NOSTRETCH                                                  I2C_CR1_NOSTRETCH_Msk
#define I2C_CR1_SBC_Pos                                                    (16UL)		/*!<I2C CR1: SBC (Bit 16) */
#define I2C_CR1_SBC_Msk                                                    (0x10000UL)		/*!< I2C CR1: SBC (Bitfield-Mask: 0x01) */
#define I2C_CR1_SBC                                                        I2C_CR1_SBC_Msk
#define I2C_CR1_RXDMAEN_Pos                                                (15UL)		/*!<I2C CR1: RXDMAEN (Bit 15) */
#define I2C_CR1_RXDMAEN_Msk                                                (0x8000UL)		/*!< I2C CR1: RXDMAEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_RXDMAEN                                                    I2C_CR1_RXDMAEN_Msk
#define I2C_CR1_TXDMAEN_Pos                                                (14UL)		/*!<I2C CR1: TXDMAEN (Bit 14) */
#define I2C_CR1_TXDMAEN_Msk                                                (0x4000UL)		/*!< I2C CR1: TXDMAEN (Bitfield-Mask: 0x01) */
#define I2C_CR1_TXDMAEN                                                    I2C_CR1_TXDMAEN_Msk
#define I2C_CR1_ANFOFF_Pos                                                 (12UL)		/*!<I2C CR1: ANFOFF (Bit 12) */
#define I2C_CR1_ANFOFF_Msk                                                 (0x1000UL)		/*!< I2C CR1: ANFOFF (Bitfield-Mask: 0x01) */
#define I2C_CR1_ANFOFF                                                     I2C_CR1_ANFOFF_Msk
#define I2C_CR1_DNF_Pos                                                    (8UL)		/*!<I2C CR1: DNF (Bit 8) */
#define I2C_CR1_DNF_Msk                                                    (0xf00UL)		/*!< I2C CR1: DNF (Bitfield-Mask: 0x0f) */
#define I2C_CR1_DNF                                                        I2C_CR1_DNF_Msk
#define I2C_CR1_DNF_0                                                      (0x1U << I2C_CR1_DNF_Pos)
#define I2C_CR1_DNF_1                                                      (0x2U << I2C_CR1_DNF_Pos)
#define I2C_CR1_DNF_2                                                      (0x4U << I2C_CR1_DNF_Pos)
#define I2C_CR1_DNF_3                                                      (0x8U << I2C_CR1_DNF_Pos)
#define I2C_CR1_ERRIE_Pos                                                  (7UL)		/*!<I2C CR1: ERRIE (Bit 7) */
#define I2C_CR1_ERRIE_Msk                                                  (0x80UL)		/*!< I2C CR1: ERRIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_ERRIE                                                      I2C_CR1_ERRIE_Msk
#define I2C_CR1_TCIE_Pos                                                   (6UL)		/*!<I2C CR1: TCIE (Bit 6) */
#define I2C_CR1_TCIE_Msk                                                   (0x40UL)		/*!< I2C CR1: TCIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_TCIE                                                       I2C_CR1_TCIE_Msk
#define I2C_CR1_STOPIE_Pos                                                 (5UL)		/*!<I2C CR1: STOPIE (Bit 5) */
#define I2C_CR1_STOPIE_Msk                                                 (0x20UL)		/*!< I2C CR1: STOPIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_STOPIE                                                     I2C_CR1_STOPIE_Msk
#define I2C_CR1_NACKIE_Pos                                                 (4UL)		/*!<I2C CR1: NACKIE (Bit 4) */
#define I2C_CR1_NACKIE_Msk                                                 (0x10UL)		/*!< I2C CR1: NACKIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_NACKIE                                                     I2C_CR1_NACKIE_Msk
#define I2C_CR1_ADDRIE_Pos                                                 (3UL)		/*!<I2C CR1: ADDRIE (Bit 3) */
#define I2C_CR1_ADDRIE_Msk                                                 (0x8UL)		/*!< I2C CR1: ADDRIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_ADDRIE                                                     I2C_CR1_ADDRIE_Msk
#define I2C_CR1_RXIE_Pos                                                   (2UL)		/*!<I2C CR1: RXIE (Bit 2) */
#define I2C_CR1_RXIE_Msk                                                   (0x4UL)		/*!< I2C CR1: RXIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_RXIE                                                       I2C_CR1_RXIE_Msk
#define I2C_CR1_TXIE_Pos                                                   (1UL)		/*!<I2C CR1: TXIE (Bit 1) */
#define I2C_CR1_TXIE_Msk                                                   (0x2UL)		/*!< I2C CR1: TXIE (Bitfield-Mask: 0x01) */
#define I2C_CR1_TXIE                                                       I2C_CR1_TXIE_Msk
#define I2C_CR1_PE_Pos                                                     (0UL)		/*!<I2C CR1: PE (Bit 0) */
#define I2C_CR1_PE_Msk                                                     (0x1UL)		/*!< I2C CR1: PE (Bitfield-Mask: 0x01) */
#define I2C_CR1_PE                                                         I2C_CR1_PE_Msk

/* =====================================================    CR2    =====================================================*/
#define I2C_CR2_PECBYTE_Pos                                                (26UL)		/*!<I2C CR2: PECBYTE (Bit 26) */
#define I2C_CR2_PECBYTE_Msk                                                (0x4000000UL)		/*!< I2C CR2: PECBYTE (Bitfield-Mask: 0x01) */
#define I2C_CR2_PECBYTE                                                    I2C_CR2_PECBYTE_Msk
#define I2C_CR2_AUTOEND_Pos                                                (25UL)		/*!<I2C CR2: AUTOEND (Bit 25) */
#define I2C_CR2_AUTOEND_Msk                                                (0x2000000UL)		/*!< I2C CR2: AUTOEND (Bitfield-Mask: 0x01) */
#define I2C_CR2_AUTOEND                                                    I2C_CR2_AUTOEND_Msk
#define I2C_CR2_RELOAD_Pos                                                 (24UL)		/*!<I2C CR2: RELOAD (Bit 24) */
#define I2C_CR2_RELOAD_Msk                                                 (0x1000000UL)		/*!< I2C CR2: RELOAD (Bitfield-Mask: 0x01) */
#define I2C_CR2_RELOAD                                                     I2C_CR2_RELOAD_Msk
#define I2C_CR2_NBYTES_Pos                                                 (16UL)		/*!<I2C CR2: NBYTES (Bit 16) */
#define I2C_CR2_NBYTES_Msk                                                 (0xff0000UL)		/*!< I2C CR2: NBYTES (Bitfield-Mask: 0xff) */
#define I2C_CR2_NBYTES                                                     I2C_CR2_NBYTES_Msk
#define I2C_CR2_NBYTES_0                                                   (0x1U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_1                                                   (0x2U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_2                                                   (0x4U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_3                                                   (0x8U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_4                                                   (0x10U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_5                                                   (0x20U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_6                                                   (0x40U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NBYTES_7                                                   (0x80U << I2C_CR2_NBYTES_Pos)
#define I2C_CR2_NACK_Pos                                                   (15UL)		/*!<I2C CR2: NACK (Bit 15) */
#define I2C_CR2_NACK_Msk                                                   (0x8000UL)		/*!< I2C CR2: NACK (Bitfield-Mask: 0x01) */
#define I2C_CR2_NACK                                                       I2C_CR2_NACK_Msk
#define I2C_CR2_STOP_Pos                                                   (14UL)		/*!<I2C CR2: STOP (Bit 14) */
#define I2C_CR2_STOP_Msk                                                   (0x4000UL)		/*!< I2C CR2: STOP (Bitfield-Mask: 0x01) */
#define I2C_CR2_STOP                                                       I2C_CR2_STOP_Msk
#define I2C_CR2_START_Pos                                                  (13UL)		/*!<I2C CR2: START (Bit 13) */
#define I2C_CR2_START_Msk                                                  (0x2000UL)		/*!< I2C CR2: START (Bitfield-Mask: 0x01) */
#define I2C_CR2_START                                                      I2C_CR2_START_Msk
#define I2C_CR2_HEAD10R_Pos                                                (12UL)		/*!<I2C CR2: HEAD10R (Bit 12) */
#define I2C_CR2_HEAD10R_Msk                                                (0x1000UL)		/*!< I2C CR2: HEAD10R (Bitfield-Mask: 0x01) */
#define I2C_CR2_HEAD10R                                                    I2C_CR2_HEAD10R_Msk
#define I2C_CR2_ADD10_Pos                                                  (11UL)		/*!<I2C CR2: ADD10 (Bit 11) */
#define I2C_CR2_ADD10_Msk                                                  (0x800UL)		/*!< I2C CR2: ADD10 (Bitfield-Mask: 0x01) */
#define I2C_CR2_ADD10                                                      I2C_CR2_ADD10_Msk
#define I2C_CR2_RD_WRN_Pos                                                 (10UL)		/*!<I2C CR2: RD_WRN (Bit 10) */
#define I2C_CR2_RD_WRN_Msk                                                 (0x400UL)		/*!< I2C CR2: RD_WRN (Bitfield-Mask: 0x01) */
#define I2C_CR2_RD_WRN                                                     I2C_CR2_RD_WRN_Msk
#define I2C_CR2_SADD_Pos                                                   (0UL)		/*!<I2C CR2: SADD (Bit 0) */
#define I2C_CR2_SADD_Msk                                                   (0x3ffUL)		/*!< I2C CR2: SADD (Bitfield-Mask: 0x3ff) */
#define I2C_CR2_SADD                                                       I2C_CR2_SADD_Msk
#define I2C_CR2_SADD_0                                                     (0x1U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_1                                                     (0x2U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_2                                                     (0x4U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_3                                                     (0x8U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_4                                                     (0x10U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_5                                                     (0x20U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_6                                                     (0x40U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_7                                                     (0x80U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_8                                                     (0x100U << I2C_CR2_SADD_Pos)
#define I2C_CR2_SADD_9                                                     (0x200U << I2C_CR2_SADD_Pos)

/* =====================================================    OAR1    =====================================================*/
#define I2C_OAR1_OA1EN_Pos                                                 (15UL)		/*!<I2C OAR1: OA1EN (Bit 15) */
#define I2C_OAR1_OA1EN_Msk                                                 (0x8000UL)		/*!< I2C OAR1: OA1EN (Bitfield-Mask: 0x01) */
#define I2C_OAR1_OA1EN                                                     I2C_OAR1_OA1EN_Msk
#define I2C_OAR1_OA1MODE_Pos                                               (10UL)		/*!<I2C OAR1: OA1MODE (Bit 10) */
#define I2C_OAR1_OA1MODE_Msk                                               (0x400UL)		/*!< I2C OAR1: OA1MODE (Bitfield-Mask: 0x01) */
#define I2C_OAR1_OA1MODE                                                   I2C_OAR1_OA1MODE_Msk
#define I2C_OAR1_OA1_Pos                                                   (0UL)		/*!<I2C OAR1: OA1 (Bit 0) */
#define I2C_OAR1_OA1_Msk                                                   (0x3ffUL)		/*!< I2C OAR1: OA1 (Bitfield-Mask: 0x3ff) */
#define I2C_OAR1_OA1                                                       I2C_OAR1_OA1_Msk
#define I2C_OAR1_OA1_0                                                     (0x1U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_1                                                     (0x2U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_2                                                     (0x4U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_3                                                     (0x8U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_4                                                     (0x10U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_5                                                     (0x20U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_6                                                     (0x40U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_7                                                     (0x80U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_8                                                     (0x100U << I2C_OAR1_OA1_Pos)
#define I2C_OAR1_OA1_9                                                     (0x200U << I2C_OAR1_OA1_Pos)

/* =====================================================    OAR2    =====================================================*/
#define I2C_OAR2_OA2EN_Pos                                                 (15UL)                             /*!<I2C OAR2: OA2EN (Bit 15) */
#define I2C_OAR2_OA2EN_Msk                                                 (0x1UL << I2C_OAR2_OA2EN_Pos)      /*!< I2C OAR2: OA2EN (Bitfield-Mask: 0x01) */
#define I2C_OAR2_OA2EN                                                     I2C_OAR2_OA2EN_Msk
#define I2C_OAR2_OA2MSK_Pos                                                (8UL)                              /*!<I2C OAR2: OA2MSK (Bit 8) */
#define I2C_OAR2_OA2MSK_Msk                                                (0x7UL << I2C_OAR2_OA2MSK_Pos)     /*!< I2C OAR2: OA2MSK (Bitfield-Mask: 0x07) */
#define I2C_OAR2_OA2MSK                                                    I2C_OAR2_OA2MSK_Msk
#define I2C_OAR2_OA2NOMASK                                                 (0x00000000UL)                     /*!< No mask                                        */
#define I2C_OAR2_OA2MASK01_Pos                                             (8U)
#define I2C_OAR2_OA2MASK01_Msk                                             (0x1UL << I2C_OAR2_OA2MASK01_Pos)  /*!< 0x00000100 */
#define I2C_OAR2_OA2MASK01                                                 I2C_OAR2_OA2MASK01_Msk             /*!< OA2[1] is masked, Only OA2[7:2] are compared   */
#define I2C_OAR2_OA2MASK02_Pos                                             (9U)
#define I2C_OAR2_OA2MASK02_Msk                                             (0x1UL << I2C_OAR2_OA2MASK02_Pos)  /*!< 0x00000200 */
#define I2C_OAR2_OA2MASK02                                                 I2C_OAR2_OA2MASK02_Msk             /*!< OA2[2:1] is masked, Only OA2[7:3] are compared */
#define I2C_OAR2_OA2MASK03_Pos                                             (8U)
#define I2C_OAR2_OA2MASK03_Msk                                             (0x3UL << I2C_OAR2_OA2MASK03_Pos)  /*!< 0x00000300 */
#define I2C_OAR2_OA2MASK03                                                 I2C_OAR2_OA2MASK03_Msk             /*!< OA2[3:1] is masked, Only OA2[7:4] are compared */
#define I2C_OAR2_OA2MASK04_Pos                                             (10U)
#define I2C_OAR2_OA2MASK04_Msk                                             (0x1UL << I2C_OAR2_OA2MASK04_Pos)  /*!< 0x00000400 */
#define I2C_OAR2_OA2MASK04                                                 I2C_OAR2_OA2MASK04_Msk             /*!< OA2[4:1] is masked, Only OA2[7:5] are compared */
#define I2C_OAR2_OA2MASK05_Pos                                             (8U)
#define I2C_OAR2_OA2MASK05_Msk                                             (0x5UL << I2C_OAR2_OA2MASK05_Pos)  /*!< 0x00000500 */
#define I2C_OAR2_OA2MASK05                                                 I2C_OAR2_OA2MASK05_Msk             /*!< OA2[5:1] is masked, Only OA2[7:6] are compared */
#define I2C_OAR2_OA2MASK06_Pos                                             (9U)
#define I2C_OAR2_OA2MASK06_Msk                                             (0x3UL << I2C_OAR2_OA2MASK06_Pos)  /*!< 0x00000600 */
#define I2C_OAR2_OA2MASK06                                                 I2C_OAR2_OA2MASK06_Msk             /*!< OA2[6:1] is masked, Only OA2[7] are compared   */
#define I2C_OAR2_OA2MASK07_Pos                                             (8U)
#define I2C_OAR2_OA2MASK07_Msk                                             (0x7UL << I2C_OAR2_OA2MASK07_Pos)  /*!< 0x00000700 */
#define I2C_OAR2_OA2MASK07                                                 I2C_OAR2_OA2MASK07_Msk             /*!< OA2[7:1] is masked, No comparison is done      */
#define I2C_OAR2_OA2_Pos                                                   (1UL)                              /*!<I2C OAR2: OA2 (Bit 1) */
#define I2C_OAR2_OA2_Msk                                                   (0x7FUL << I2C_OAR2_OA2_Pos)	      /*!< I2C OAR2: OA2 (Bitfield-Mask: 0x7f) */
#define I2C_OAR2_OA2                                                       I2C_OAR2_OA2_Msk
#define I2C_OAR2_OA2_0                                                     (0x1U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_1                                                     (0x2U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_2                                                     (0x4U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_3                                                     (0x8U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_4                                                     (0x10U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_5                                                     (0x20U << I2C_OAR2_OA2_Pos)
#define I2C_OAR2_OA2_6                                                     (0x40U << I2C_OAR2_OA2_Pos)

