stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    ICR    =====================================================*/
#define I2C_ICR_ALERTCF_Pos                                                (13UL)		/*!<I2C ICR: ALERTCF (Bit 13) */
#define I2C_ICR_ALERTCF_Msk                                                (0x2000UL)		/*!< I2C ICR: ALERTCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_ALERTCF                                                    I2C_ICR_ALERTCF_Msk
#define I2C_ICR_TIMOUTCF_Pos                                               (12UL)		/*!<I2C ICR: TIMOUTCF (Bit 12) */
#define I2C_ICR_TIMOUTCF_Msk                                               (0x1000UL)		/*!< I2C ICR: TIMOUTCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_TIMOUTCF                                                   I2C_ICR_TIMOUTCF_Msk
#define I2C_ICR_PECCF_Pos                                                  (11UL)		/*!<I2C ICR: PECCF (Bit 11) */
#define I2C_ICR_PECCF_Msk                                                  (0x800UL)		/*!< I2C ICR: PECCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_PECCF                                                      I2C_ICR_PECCF_Msk
#define I2C_ICR_OVRCF_Pos                                                  (10UL)		/*!<I2C ICR: OVRCF (Bit 10) */
#define I2C_ICR_OVRCF_Msk                                                  (0x400UL)		/*!< I2C ICR: OVRCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_OVRCF                                                      I2C_ICR_OVRCF_Msk
#define I2C_ICR_ARLOCF_Pos                                                 (9UL)		/*!<I2C ICR: ARLOCF (Bit 9) */
#define I2C_ICR_ARLOCF_Msk                                                 (0x200UL)		/*!< I2C ICR: ARLOCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_ARLOCF                                                     I2C_ICR_ARLOCF_Msk
#define I2C_ICR_BERRCF_Pos                                                 (8UL)		/*!<I2C ICR: BERRCF (Bit 8) */
#define I2C_ICR_BERRCF_Msk                                                 (0x100UL)		/*!< I2C ICR: BERRCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_BERRCF                                                     I2C_ICR_BERRCF_Msk
#define I2C_ICR_STOPCF_Pos                                                 (5UL)		/*!<I2C ICR: STOPCF (Bit 5) */
#define I2C_ICR_STOPCF_Msk                                                 (0x20UL)		/*!< I2C ICR: STOPCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_STOPCF                                                     I2C_ICR_STOPCF_Msk
#define I2C_ICR_NACKCF_Pos                                                 (4UL)		/*!<I2C ICR: NACKCF (Bit 4) */
#define I2C_ICR_NACKCF_Msk                                                 (0x10UL)		/*!< I2C ICR: NACKCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_NACKCF                                                     I2C_ICR_NACKCF_Msk
#define I2C_ICR_ADDRCF_Pos                                                 (3UL)		/*!<I2C ICR: ADDRCF (Bit 3) */
#define I2C_ICR_ADDRCF_Msk                                                 (0x8UL)		/*!< I2C ICR: ADDRCF (Bitfield-Mask: 0x01) */
#define I2C_ICR_ADDRCF                                                     I2C_ICR_ADDRCF_Msk

/* =====================================================    PECR    =====================================================*/
#define I2C_PECR_PEC_Pos                                                   (0UL)		/*!<I2C PECR: PEC (Bit 0) */
#define I2C_PECR_PEC_Msk                                                   (0xffUL)		/*!< I2C PECR: PEC (Bitfield-Mask: 0xff) */
#define I2C_PECR_PEC                                                       I2C_PECR_PEC_Msk
#define I2C_PECR_PEC_0                                                     (0x1U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_1                                                     (0x2U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_2                                                     (0x4U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_3                                                     (0x8U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_4                                                     (0x10U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_5                                                     (0x20U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_6                                                     (0x40U << I2C_PECR_PEC_Pos)
#define I2C_PECR_PEC_7                                                     (0x80U << I2C_PECR_PEC_Pos)

/* =====================================================    RXDR    =====================================================*/
#define I2C_RXDR_RXDATA_Pos                                                (0UL)		/*!<I2C RXDR: RXDATA (Bit 0) */
#define I2C_RXDR_RXDATA_Msk                                                (0xffUL)		/*!< I2C RXDR: RXDATA (Bitfield-Mask: 0xff) */
#define I2C_RXDR_RXDATA                                                    I2C_RXDR_RXDATA_Msk
#define I2C_RXDR_RXDATA_0                                                  (0x1U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_1                                                  (0x2U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_2                                                  (0x4U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_3                                                  (0x8U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_4                                                  (0x10U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_5                                                  (0x20U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_6                                                  (0x40U << I2C_RXDR_RXDATA_Pos)
#define I2C_RXDR_RXDATA_7                                                  (0x80U << I2C_RXDR_RXDATA_Pos)

/* =====================================================    TXDR    =====================================================*/
#define I2C_TXDR_TXDATA_Pos                                                (0UL)		/*!<I2C TXDR: TXDATA (Bit 0) */
#define I2C_TXDR_TXDATA_Msk                                                (0xffUL)		/*!< I2C TXDR: TXDATA (Bitfield-Mask: 0xff) */
#define I2C_TXDR_TXDATA                                                    I2C_TXDR_TXDATA_Msk
#define I2C_TXDR_TXDATA_0                                                  (0x1U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_1                                                  (0x2U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_2                                                  (0x4U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_3                                                  (0x8U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_4                                                  (0x10U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_5                                                  (0x20U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_6                                                  (0x40U << I2C_TXDR_TXDATA_Pos)
#define I2C_TXDR_TXDATA_7                                                  (0x80U << I2C_TXDR_TXDATA_Pos)


