stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    LCKR    =====================================================*/
#define GPIO_LCKR_LCKK_Pos                                                 (16UL)		/*!<GPIO LCKR: LCKK (Bit 16) */
#define GPIO_LCKR_LCKK_Msk                                                 (0x10000UL)		/*!< GPIO LCKR: LCKK (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCKK                                                     GPIO_LCKR_LCKK_Msk
#define GPIO_LCKR_LCK15_Pos                                                (15UL)		/*!<GPIO LCKR: LCK15 (Bit 15) */
#define GPIO_LCKR_LCK15_Msk                                                (0x8000UL)		/*!< GPIO LCKR: LCK15 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK15                                                    GPIO_LCKR_LCK15_Msk
#define GPIO_LCKR_LCK14_Pos                                                (14UL)		/*!<GPIO LCKR: LCK14 (Bit 14) */
#define GPIO_LCKR_LCK14_Msk                                                (0x4000UL)		/*!< GPIO LCKR: LCK14 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK14                                                    GPIO_LCKR_LCK14_Msk
#define GPIO_LCKR_LCK13_Pos                                                (13UL)		/*!<GPIO LCKR: LCK13 (Bit 13) */
#define GPIO_LCKR_LCK13_Msk                                                (0x2000UL)		/*!< GPIO LCKR: LCK13 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK13                                                    GPIO_LCKR_LCK13_Msk
#define GPIO_LCKR_LCK12_Pos                                                (12UL)		/*!<GPIO LCKR: LCK12 (Bit 12) */
#define GPIO_LCKR_LCK12_Msk                                                (0x1000UL)		/*!< GPIO LCKR: LCK12 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK12                                                    GPIO_LCKR_LCK12_Msk
#define GPIO_LCKR_LCK11_Pos                                                (11UL)		/*!<GPIO LCKR: LCK11 (Bit 11) */
#define GPIO_LCKR_LCK11_Msk                                                (0x800UL)		/*!< GPIO LCKR: LCK11 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK11                                                    GPIO_LCKR_LCK11_Msk
#define GPIO_LCKR_LCK10_Pos                                                (10UL)		/*!<GPIO LCKR: LCK10 (Bit 10) */
#define GPIO_LCKR_LCK10_Msk                                                (0x400UL)		/*!< GPIO LCKR: LCK10 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK10                                                    GPIO_LCKR_LCK10_Msk
#define GPIO_LCKR_LCK9_Pos                                                 (9UL)		/*!<GPIO LCKR: LCK9 (Bit 9) */
#define GPIO_LCKR_LCK9_Msk                                                 (0x200UL)		/*!< GPIO LCKR: LCK9 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK9                                                     GPIO_LCKR_LCK9_Msk
#define GPIO_LCKR_LCK8_Pos                                                 (8UL)		/*!<GPIO LCKR: LCK8 (Bit 8) */
#define GPIO_LCKR_LCK8_Msk                                                 (0x100UL)		/*!< GPIO LCKR: LCK8 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK8                                                     GPIO_LCKR_LCK8_Msk
#define GPIO_LCKR_LCK7_Pos                                                 (7UL)		/*!<GPIO LCKR: LCK7 (Bit 7) */
#define GPIO_LCKR_LCK7_Msk                                                 (0x80UL)		/*!< GPIO LCKR: LCK7 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK7                                                     GPIO_LCKR_LCK7_Msk
#define GPIO_LCKR_LCK6_Pos                                                 (6UL)		/*!<GPIO LCKR: LCK6 (Bit 6) */
#define GPIO_LCKR_LCK6_Msk                                                 (0x40UL)		/*!< GPIO LCKR: LCK6 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK6                                                     GPIO_LCKR_LCK6_Msk
#define GPIO_LCKR_LCK5_Pos                                                 (5UL)		/*!<GPIO LCKR: LCK5 (Bit 5) */
#define GPIO_LCKR_LCK5_Msk                                                 (0x20UL)		/*!< GPIO LCKR: LCK5 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK5                                                     GPIO_LCKR_LCK5_Msk
#define GPIO_LCKR_LCK4_Pos                                                 (4UL)		/*!<GPIO LCKR: LCK4 (Bit 4) */
#define GPIO_LCKR_LCK4_Msk                                                 (0x10UL)		/*!< GPIO LCKR: LCK4 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK4                                                     GPIO_LCKR_LCK4_Msk
#define GPIO_LCKR_LCK3_Pos                                                 (3UL)		/*!<GPIO LCKR: LCK3 (Bit 3) */
#define GPIO_LCKR_LCK3_Msk                                                 (0x8UL)		/*!< GPIO LCKR: LCK3 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK3                                                     GPIO_LCKR_LCK3_Msk
#define GPIO_LCKR_LCK2_Pos                                                 (2UL)		/*!<GPIO LCKR: LCK2 (Bit 2) */
#define GPIO_LCKR_LCK2_Msk                                                 (0x4UL)		/*!< GPIO LCKR: LCK2 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK2                                                     GPIO_LCKR_LCK2_Msk
#define GPIO_LCKR_LCK1_Pos                                                 (1UL)		/*!<GPIO LCKR: LCK1 (Bit 1) */
#define GPIO_LCKR_LCK1_Msk                                                 (0x2UL)		/*!< GPIO LCKR: LCK1 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK1                                                     GPIO_LCKR_LCK1_Msk
#define GPIO_LCKR_LCK0_Pos                                                 (0UL)		/*!<GPIO LCKR: LCK0 (Bit 0) */
#define GPIO_LCKR_LCK0_Msk                                                 (0x1UL)		/*!< GPIO LCKR: LCK0 (Bitfield-Mask: 0x01) */
#define GPIO_LCKR_LCK0                                                     GPIO_LCKR_LCK0_Msk

/* =====================================================    AFRL    =====================================================*/
#define GPIO_AFRL_AFSEL7_Pos                                               (28UL)		/*!<GPIO AFRL: AFSEL7 (Bit 28) */
#define GPIO_AFRL_AFSEL7_Msk                                               (0xf0000000UL)		/*!< GPIO AFRL: AFSEL7 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL7                                                   GPIO_AFRL_AFSEL7_Msk
#define GPIO_AFRL_AFSEL7_0                                                 (0x1U << GPIO_AFRL_AFSEL7_Pos)
#define GPIO_AFRL_AFSEL7_1                                                 (0x2U << GPIO_AFRL_AFSEL7_Pos)
#define GPIO_AFRL_AFSEL7_2                                                 (0x4U << GPIO_AFRL_AFSEL7_Pos)
#define GPIO_AFRL_AFSEL7_3                                                 (0x8U << GPIO_AFRL_AFSEL7_Pos)
#define GPIO_AFRL_AFSEL6_Pos                                               (24UL)		/*!<GPIO AFRL: AFSEL6 (Bit 24) */
#define GPIO_AFRL_AFSEL6_Msk                                               (0xf000000UL)		/*!< GPIO AFRL: AFSEL6 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL6                                                   GPIO_AFRL_AFSEL6_Msk
#define GPIO_AFRL_AFSEL6_0                                                 (0x1U << GPIO_AFRL_AFSEL6_Pos)
#define GPIO_AFRL_AFSEL6_1                                                 (0x2U << GPIO_AFRL_AFSEL6_Pos)
#define GPIO_AFRL_AFSEL6_2                                                 (0x4U << GPIO_AFRL_AFSEL6_Pos)
#define GPIO_AFRL_AFSEL6_3                                                 (0x8U << GPIO_AFRL_AFSEL6_Pos)
#define GPIO_AFRL_AFSEL5_Pos                                               (20UL)		/*!<GPIO AFRL: AFSEL5 (Bit 20) */
#define GPIO_AFRL_AFSEL5_Msk                                               (0xf00000UL)		/*!< GPIO AFRL: AFSEL5 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL5                                                   GPIO_AFRL_AFSEL5_Msk
#define GPIO_AFRL_AFSEL5_0                                                 (0x1U << GPIO_AFRL_AFSEL5_Pos)
#define GPIO_AFRL_AFSEL5_1                                                 (0x2U << GPIO_AFRL_AFSEL5_Pos)
#define GPIO_AFRL_AFSEL5_2                                                 (0x4U << GPIO_AFRL_AFSEL5_Pos)
#define GPIO_AFRL_AFSEL5_3                                                 (0x8U << GPIO_AFRL_AFSEL5_Pos)
#define GPIO_AFRL_AFSEL4_Pos                                               (16UL)		/*!<GPIO AFRL: AFSEL4 (Bit 16) */
#define GPIO_AFRL_AFSEL4_Msk                                               (0xf0000UL)		/*!< GPIO AFRL: AFSEL4 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL4                                                   GPIO_AFRL_AFSEL4_Msk
#define GPIO_AFRL_AFSEL4_0                                                 (0x1U << GPIO_AFRL_AFSEL4_Pos)
#define GPIO_AFRL_AFSEL4_1                                                 (0x2U << GPIO_AFRL_AFSEL4_Pos)
#define GPIO_AFRL_AFSEL4_2                                                 (0x4U << GPIO_AFRL_AFSEL4_Pos)
#define GPIO_AFRL_AFSEL4_3                                                 (0x8U << GPIO_AFRL_AFSEL4_Pos)
#define GPIO_AFRL_AFSEL3_Pos                                               (12UL)		/*!<GPIO AFRL: AFSEL3 (Bit 12) */
#define GPIO_AFRL_AFSEL3_Msk                                               (0xf000UL)		/*!< GPIO AFRL: AFSEL3 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL3                                                   GPIO_AFRL_AFSEL3_Msk
#define GPIO_AFRL_AFSEL3_0                                                 (0x1U << GPIO_AFRL_AFSEL3_Pos)
#define GPIO_AFRL_AFSEL3_1                                                 (0x2U << GPIO_AFRL_AFSEL3_Pos)
#define GPIO_AFRL_AFSEL3_2                                                 (0x4U << GPIO_AFRL_AFSEL3_Pos)
#define GPIO_AFRL_AFSEL3_3                                                 (0x8U << GPIO_AFRL_AFSEL3_Pos)
#define GPIO_AFRL_AFSEL2_Pos                                               (8UL)		/*!<GPIO AFRL: AFSEL2 (Bit 8) */
#define GPIO_AFRL_AFSEL2_Msk                                               (0xf00UL)		/*!< GPIO AFRL: AFSEL2 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL2                                                   GPIO_AFRL_AFSEL2_Msk
#define GPIO_AFRL_AFSEL2_0                                                 (0x1U << GPIO_AFRL_AFSEL2_Pos)
#define GPIO_AFRL_AFSEL2_1                                                 (0x2U << GPIO_AFRL_AFSEL2_Pos)
#define GPIO_AFRL_AFSEL2_2                                                 (0x4U << GPIO_AFRL_AFSEL2_Pos)
#define GPIO_AFRL_AFSEL2_3                                                 (0x8U << GPIO_AFRL_AFSEL2_Pos)
#define GPIO_AFRL_AFSEL1_Pos                                               (4UL)		/*!<GPIO AFRL: AFSEL1 (Bit 4) */
#define GPIO_AFRL_AFSEL1_Msk                                               (0xf0UL)		/*!< GPIO AFRL: AFSEL1 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL1                                                   GPIO_AFRL_AFSEL1_Msk
#define GPIO_AFRL_AFSEL1_0                                                 (0x1U << GPIO_AFRL_AFSEL1_Pos)
#define GPIO_AFRL_AFSEL1_1                                                 (0x2U << GPIO_AFRL_AFSEL1_Pos)
#define GPIO_AFRL_AFSEL1_2                                                 (0x4U << GPIO_AFRL_AFSEL1_Pos)
#define GPIO_AFRL_AFSEL1_3                                                 (0x8U << GPIO_AFRL_AFSEL1_Pos)
#define GPIO_AFRL_AFSEL0_Pos                                               (0UL)		/*!<GPIO AFRL: AFSEL0 (Bit 0) */
#define GPIO_AFRL_AFSEL0_Msk                                               (0xfUL)		/*!< GPIO AFRL: AFSEL0 (Bitfield-Mask: 0x0f) */
#define GPIO_AFRL_AFSEL0                                                   GPIO_AFRL_AFSEL0_Msk
#define GPIO_AFRL_AFSEL0_0                                                 (0x1U << GPIO_AFRL_AFSEL0_Pos)
#define GPIO_AFRL_AFSEL0_1                                                 (0x2U << GPIO_AFRL_AFSEL0_Pos)
#define GPIO_AFRL_AFSEL0_2                                                 (0x4U << GPIO_AFRL_AFSEL0_Pos)
#define GPIO_AFRL_AFSEL0_3                                                 (0x8U << GPIO_AFRL_AFSEL0_Pos)

