stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    POL    =====================================================*/
#define CRC_POL_POL_Pos                                                    (0UL)		/*!<CRC POL: POL (Bit 0) */
#define CRC_POL_POL_Msk                                                    (0xffffffffUL)		/*!< CRC POL: POL (Bitfield-Mask: 0xffffffff) */
#define CRC_POL_POL                                                        CRC_POL_POL_Msk
#define CRC_POL_POL_0                                                      (0x1U << CRC_POL_POL_Pos)
#define CRC_POL_POL_1                                                      (0x2U << CRC_POL_POL_Pos)
#define CRC_POL_POL_2                                                      (0x4U << CRC_POL_POL_Pos)
#define CRC_POL_POL_3                                                      (0x8U << CRC_POL_POL_Pos)
#define CRC_POL_POL_4                                                      (0x10U << CRC_POL_POL_Pos)
#define CRC_POL_POL_5                                                      (0x20U << CRC_POL_POL_Pos)
#define CRC_POL_POL_6                                                      (0x40U << CRC_POL_POL_Pos)
#define CRC_POL_POL_7                                                      (0x80U << CRC_POL_POL_Pos)
#define CRC_POL_POL_8                                                      (0x100U << CRC_POL_POL_Pos)
#define CRC_POL_POL_9                                                      (0x200U << CRC_POL_POL_Pos)
#define CRC_POL_POL_10                                                     (0x400U << CRC_POL_POL_Pos)
#define CRC_POL_POL_11                                                     (0x800U << CRC_POL_POL_Pos)
#define CRC_POL_POL_12                                                     (0x1000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_13                                                     (0x2000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_14                                                     (0x4000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_15                                                     (0x8000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_16                                                     (0x10000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_17                                                     (0x20000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_18                                                     (0x40000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_19                                                     (0x80000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_20                                                     (0x100000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_21                                                     (0x200000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_22                                                     (0x400000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_23                                                     (0x800000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_24                                                     (0x1000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_25                                                     (0x2000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_26                                                     (0x4000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_27                                                     (0x8000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_28                                                     (0x10000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_29                                                     (0x20000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_30                                                     (0x40000000U << CRC_POL_POL_Pos)
#define CRC_POL_POL_31                                                     (0x80000000UL << CRC_POL_POL_Pos)


/* ============================================================================================================================*/
/*=====================                                        RCC                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define RCC_CR_HSERDY_Pos                                                  (17UL)		/*!<RCC CR: HSERDY (Bit 17) */
#define RCC_CR_HSERDY_Msk                                                  (0x20000UL)		/*!< RCC CR: HSERDY (Bitfield-Mask: 0x01) */
#define RCC_CR_HSERDY                                                      RCC_CR_HSERDY_Msk
#define RCC_CR_HSEON_Pos                                                   (16UL)		/*!<RCC CR: HSEON (Bit 16) */
#define RCC_CR_HSEON_Msk                                                   (0x10000UL)		/*!< RCC CR: HSEON (Bitfield-Mask: 0x01) */
#define RCC_CR_HSEON                                                       RCC_CR_HSEON_Msk
#define RCC_CR_FMRAT_Pos                                                   (15UL)		/*!<RCC CR: FMRAT (Bit 15) */
#define RCC_CR_FMRAT_Msk                                                   (0x8000UL)		/*!< RCC CR: FMRAT (Bitfield-Mask: 0x01) */
#define RCC_CR_FMRAT                                                       RCC_CR_FMRAT_Msk
#define RCC_CR_HSIPLLRDY_Pos                                               (14UL)		/*!<RCC CR: HSIPLLRDY (Bit 14) */
#define RCC_CR_HSIPLLRDY_Msk                                               (0x4000UL)		/*!< RCC CR: HSIPLLRDY (Bitfield-Mask: 0x01) */
#define RCC_CR_HSIPLLRDY                                                   RCC_CR_HSIPLLRDY_Msk
#define RCC_CR_HSIPLLON_Pos                                                (13UL)		/*!<RCC CR: HSIPLLON (Bit 13) */
#define RCC_CR_HSIPLLON_Msk                                                (0x2000UL)		/*!< RCC CR: HSIPLLON (Bitfield-Mask: 0x01) */
#define RCC_CR_HSIPLLON                                                    RCC_CR_HSIPLLON_Msk
#define RCC_CR_HSEPLLBUFON_Pos                                             (12UL)		/*!<RCC CR: HSEPLLBUFON (Bit 12) */
#define RCC_CR_HSEPLLBUFON_Msk                                             (0x1000UL)		/*!< RCC CR: HSEPLLBUFON (Bitfield-Mask: 0x01) */
#define RCC_CR_HSEPLLBUFON                                                 RCC_CR_HSEPLLBUFON_Msk
#define RCC_CR_HSIRDY_Pos                                                  (10UL)		/*!<RCC CR: HSIRDY (Bit 10) */
#define RCC_CR_HSIRDY_Msk                                                  (0x400UL)		/*!< RCC CR: HSIRDY (Bitfield-Mask: 0x01) */
#define RCC_CR_HSIRDY                                                      RCC_CR_HSIRDY_Msk
#define RCC_CR_LOCKDET_NSTOP_Pos                                           (7UL)		/*!<RCC CR: LOCKDET_NSTOP (Bit 7) */
#define RCC_CR_LOCKDET_NSTOP_Msk                                           (0x380UL)		/*!< RCC CR: LOCKDET_NSTOP (Bitfield-Mask: 0x07) */
#define RCC_CR_LOCKDET_NSTOP                                               RCC_CR_LOCKDET_NSTOP_Msk
#define RCC_CR_LOCKDET_NSTOP_0                                             (0x1U << RCC_CR_LOCKDET_NSTOP_Pos)
#define RCC_CR_LOCKDET_NSTOP_1                                             (0x2U << RCC_CR_LOCKDET_NSTOP_Pos)
#define RCC_CR_LOCKDET_NSTOP_2                                             (0x4U << RCC_CR_LOCKDET_NSTOP_Pos)
#define RCC_CR_LSEBYP_Pos                                                  (6UL)		/*!<RCC CR: LSEBYP (Bit 6) */
#define RCC_CR_LSEBYP_Msk                                                  (0x40UL)		/*!< RCC CR: LSEBYP (Bitfield-Mask: 0x01) */
#define RCC_CR_LSEBYP                                                      RCC_CR_LSEBYP_Msk
#define RCC_CR_LSERDY_Pos                                                  (5UL)		/*!<RCC CR: LSERDY (Bit 5) */
#define RCC_CR_LSERDY_Msk                                                  (0x20UL)		/*!< RCC CR: LSERDY (Bitfield-Mask: 0x01) */
#define RCC_CR_LSERDY                                                      RCC_CR_LSERDY_Msk
#define RCC_CR_LSEON_Pos                                                   (4UL)		/*!<RCC CR: LSEON (Bit 4) */
#define RCC_CR_LSEON_Msk                                                   (0x10UL)		/*!< RCC CR: LSEON (Bitfield-Mask: 0x01) */
#define RCC_CR_LSEON                                                       RCC_CR_LSEON_Msk
#define RCC_CR_LSIRDY_Pos                                                  (3UL)		/*!<RCC CR: LSIRDY (Bit 3) */
#define RCC_CR_LSIRDY_Msk                                                  (0x8UL)		/*!< RCC CR: LSIRDY (Bitfield-Mask: 0x01) */
#define RCC_CR_LSIRDY                                                      RCC_CR_LSIRDY_Msk
#define RCC_CR_LSION_Pos                                                   (2UL)		/*!<RCC CR: LSION (Bit 2) */
#define RCC_CR_LSION_Msk                                                   (0x4UL)		/*!< RCC CR: LSION (Bitfield-Mask: 0x01) */
#define RCC_CR_LSION                                                       RCC_CR_LSION_Msk

/* =====================================================    ICSCR    =====================================================*/
#define RCC_ICSCR_HSITRIM_Pos                                              (24UL)		/*!<RCC ICSCR: HSITRIM (Bit 24) */
#define RCC_ICSCR_HSITRIM_Msk                                              (0x3f000000UL)		/*!< RCC ICSCR: HSITRIM (Bitfield-Mask: 0x3f) */
#define RCC_ICSCR_HSITRIM                                                  RCC_ICSCR_HSITRIM_Msk
#define RCC_ICSCR_HSITRIM_0                                                (0x1U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_1                                                (0x2U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_2                                                (0x4U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_3                                                (0x8U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_4                                                (0x10U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_5                                                (0x20U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIMOFS_Pos                                           (16UL)		/*!<RCC ICSCR: HSITRIMOFS (Bit 16) */
#define RCC_ICSCR_HSITRIMOFS_Msk                                           (0x70000UL)		/*!< RCC ICSCR: HSITRIMOFS (Bitfield-Mask: 0x07) */
#define RCC_ICSCR_HSITRIMOFS                                               RCC_ICSCR_HSITRIMOFS_Msk
#define RCC_ICSCR_HSITRIMOFS_0                                             (0x1U << RCC_ICSCR_HSITRIMOFS_Pos)
#define RCC_ICSCR_HSITRIMOFS_1                                             (0x2U << RCC_ICSCR_HSITRIMOFS_Pos)
#define RCC_ICSCR_HSITRIMOFS_2                                             (0x4U << RCC_ICSCR_HSITRIMOFS_Pos)
#define RCC_ICSCR_LSIBW_Pos                                                (2UL)		/*!<RCC ICSCR: LSIBW (Bit 2) */
#define RCC_ICSCR_LSIBW_Msk                                                (0x3cUL)		/*!< RCC ICSCR: LSIBW (Bitfield-Mask: 0x0f) */
#define RCC_ICSCR_LSIBW                                                    RCC_ICSCR_LSIBW_Msk
#define RCC_ICSCR_LSIBW_0                                                  (0x1U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSIBW_1                                                  (0x2U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSIBW_2                                                  (0x4U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSIBW_3                                                  (0x8U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSITRIMOK_Pos                                            (1UL)		/*!<RCC ICSCR: LSITRIMOK (Bit 1) */
#define RCC_ICSCR_LSITRIMOK_Msk                                            (0x2UL)		/*!< RCC ICSCR: LSITRIMOK (Bitfield-Mask: 0x01) */
#define RCC_ICSCR_LSITRIMOK                                                RCC_ICSCR_LSITRIMOK_Msk
#define RCC_ICSCR_LSITRIMEN_Pos                                            (0UL)		/*!<RCC ICSCR: LSITRIMEN (Bit 0) */
#define RCC_ICSCR_LSITRIMEN_Msk                                            (0x1UL)		/*!< RCC ICSCR: LSITRIMEN (Bitfield-Mask: 0x01) */
#define RCC_ICSCR_LSITRIMEN                                                RCC_ICSCR_LSITRIMEN_Msk

/* =====================================================    CFGR    =====================================================*/
#define RCC_CFGR_CCOPRE_Pos                                                (29UL)		/*!<RCC CFGR: CCOPRE (Bit 29) */
#define RCC_CFGR_CCOPRE_Msk                                                (0xe0000000UL)		/*!< RCC CFGR: CCOPRE (Bitfield-Mask: 0x07) */
#define RCC_CFGR_CCOPRE                                                    RCC_CFGR_CCOPRE_Msk
#define RCC_CFGR_CCOPRE_0                                                  (0x1U << RCC_CFGR_CCOPRE_Pos)
#define RCC_CFGR_CCOPRE_1                                                  (0x2U << RCC_CFGR_CCOPRE_Pos)
#define RCC_CFGR_CCOPRE_2                                                  (0x4U << RCC_CFGR_CCOPRE_Pos)
#define RCC_CFGR_MCOSEL_Pos                                                (26UL)		/*!<RCC CFGR: MCOSEL (Bit 26) */
#define RCC_CFGR_MCOSEL_Msk                                                (0x1c000000UL)		/*!< RCC CFGR: MCOSEL (Bitfield-Mask: 0x07) */
#define RCC_CFGR_MCOSEL                                                    RCC_CFGR_MCOSEL_Msk
#define RCC_CFGR_MCOSEL_0                                                  (0x1U << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_MCOSEL_1                                                  (0x2U << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_MCOSEL_2                                                  (0x4U << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_LCOSEL_Pos                                                (24UL)		/*!<RCC CFGR: LCOSEL (Bit 24) */
#define RCC_CFGR_LCOSEL_Msk                                                (0x3000000UL)		/*!< RCC CFGR: LCOSEL (Bitfield-Mask: 0x03) */
#define RCC_CFGR_LCOSEL                                                    RCC_CFGR_LCOSEL_Msk
#define RCC_CFGR_LCOSEL_0                                                  (0x1U << RCC_CFGR_LCOSEL_Pos)
#define RCC_CFGR_LCOSEL_1                                                  (0x2U << RCC_CFGR_LCOSEL_Pos)
#define RCC_CFGR_SPI3I2SCLKSEL_Pos                                         (22UL)		/*!<RCC CFGR: SPI3I2SCLKSEL (Bit 22) */
#define RCC_CFGR_SPI3I2SCLKSEL_Msk                                         (0xc00000UL)		/*!< RCC CFGR: SPI3I2SCLKSEL (Bitfield-Mask: 0x03) */
#define RCC_CFGR_SPI3I2SCLKSEL                                             RCC_CFGR_SPI3I2SCLKSEL_Msk
#define RCC_CFGR_SPI3I2SCLKSEL_0                                           (0x1U << RCC_CFGR_SPI3I2SCLKSEL_Pos)
#define RCC_CFGR_SPI3I2SCLKSEL_1                                           (0x2U << RCC_CFGR_SPI3I2SCLKSEL_Pos)
#define RCC_CFGR_LCOEN_Pos                                                 (19UL)		/*!<RCC CFGR: LCOEN (Bit 19) */
#define RCC_CFGR_LCOEN_Msk                                                 (0x80000UL)		/*!< RCC CFGR: LCOEN (Bitfield-Mask: 0x01) */
#define RCC_CFGR_LCOEN                                                     RCC_CFGR_LCOEN_Msk
#define RCC_CFGR_IOBOOSTEN_Pos                                             (17UL)		/*!<RCC CFGR: IOBOOSTEN (Bit 17) */
#define RCC_CFGR_IOBOOSTEN_Msk                                             (0x20000UL)		/*!< RCC CFGR: IOBOOSTEN (Bitfield-Mask: 0x01) */
#define RCC_CFGR_IOBOOSTEN                                                 RCC_CFGR_IOBOOSTEN_Msk
#define RCC_CFGR_CLKSLOWSEL_Pos                                            (15UL)		/*!<RCC CFGR: CLKSLOWSEL (Bit 15) */
#define RCC_CFGR_CLKSLOWSEL_Msk                                            (0x18000UL)		/*!< RCC CFGR: CLKSLOWSEL (Bitfield-Mask: 0x03) */
#define RCC_CFGR_CLKSLOWSEL                                                RCC_CFGR_CLKSLOWSEL_Msk
#define RCC_CFGR_CLKSLOWSEL_0                                              (0x1U << RCC_CFGR_CLKSLOWSEL_Pos)
#define RCC_CFGR_CLKSLOWSEL_1                                              (0x2U << RCC_CFGR_CLKSLOWSEL_Pos)
#define RCC_CFGR_LPUCLKSEL_Pos                                             (13UL)		/*!<RCC CFGR: LPUCLKSEL (Bit 13) */
#define RCC_CFGR_LPUCLKSEL_Msk                                             (0x2000UL)		/*!< RCC CFGR: LPUCLKSEL (Bitfield-Mask: 0x01) */
#define RCC_CFGR_LPUCLKSEL                                                 RCC_CFGR_LPUCLKSEL_Msk
#define RCC_CFGR_SMPSDIV_Pos                                               (12UL)		/*!<RCC CFGR: SMPSDIV (Bit 12) */
#define RCC_CFGR_SMPSDIV_Msk                                               (0x1000UL)		/*!< RCC CFGR: SMPSDIV (Bitfield-Mask: 0x01) */
#define RCC_CFGR_SMPSDIV                                                   RCC_CFGR_SMPSDIV_Msk
#define RCC_CFGR_ADCDIV_Pos                                                (11UL)		/*!<RCC CFGR: ADCDIV (Bit 11) */
#define RCC_CFGR_ADCDIV_Msk                                                (0x800UL)		/*!< RCC CFGR: ADCDIV (Bitfield-Mask: 0x01) */
#define RCC_CFGR_ADCDIV                                                    RCC_CFGR_ADCDIV_Msk
#define RCC_CFGR_CLKSYSDIV_STATUS_Pos                                      (8UL)		/*!<RCC CFGR: CLKSYSDIV_STATUS (Bit 8) */
#define RCC_CFGR_CLKSYSDIV_STATUS_Msk                                      (0x700UL)		/*!< RCC CFGR: CLKSYSDIV_STATUS (Bitfield-Mask: 0x07) */
#define RCC_CFGR_CLKSYSDIV_STATUS                                          RCC_CFGR_CLKSYSDIV_STATUS_Msk
#define RCC_CFGR_CLKSYSDIV_STATUS_0                                        (0x1U << RCC_CFGR_CLKSYSDIV_STATUS_Pos)
#define RCC_CFGR_CLKSYSDIV_STATUS_1                                        (0x2U << RCC_CFGR_CLKSYSDIV_STATUS_Pos)
#define RCC_CFGR_CLKSYSDIV_STATUS_2                                        (0x4U << RCC_CFGR_CLKSYSDIV_STATUS_Pos)
#define RCC_CFGR_CLKSYSDIV_Pos                                             (5UL)		/*!<RCC CFGR: CLKSYSDIV (Bit 5) */
#define RCC_CFGR_CLKSYSDIV_Msk                                             (0xe0UL)		/*!< RCC CFGR: CLKSYSDIV (Bitfield-Mask: 0x07) */
#define RCC_CFGR_CLKSYSDIV                                                 RCC_CFGR_CLKSYSDIV_Msk
#define RCC_CFGR_CLKSYSDIV_0                                               (0x1U << RCC_CFGR_CLKSYSDIV_Pos)
#define RCC_CFGR_CLKSYSDIV_1                                               (0x2U << RCC_CFGR_CLKSYSDIV_Pos)
#define RCC_CFGR_CLKSYSDIV_2                                               (0x4U << RCC_CFGR_CLKSYSDIV_Pos)
#define RCC_CFGR_HSESEL_STATUS_Pos                                         (3UL)		/*!<RCC CFGR: HSESEL_STATUS (Bit 3) */
#define RCC_CFGR_HSESEL_STATUS_Msk                                         (0x8UL)		/*!< RCC CFGR: HSESEL_STATUS (Bitfield-Mask: 0x01) */
#define RCC_CFGR_HSESEL_STATUS                                             RCC_CFGR_HSESEL_STATUS_Msk
#define RCC_CFGR_STOPHSI_Pos                                               (2UL)		/*!<RCC CFGR: STOPHSI (Bit 2) */
#define RCC_CFGR_STOPHSI_Msk                                               (0x4UL)		/*!< RCC CFGR: STOPHSI (Bitfield-Mask: 0x01) */
#define RCC_CFGR_STOPHSI                                                   RCC_CFGR_STOPHSI_Msk
#define RCC_CFGR_HSESEL_Pos                                                (1UL)		/*!<RCC CFGR: HSESEL (Bit 1) */
#define RCC_CFGR_HSESEL_Msk                                                (0x2UL)		/*!< RCC CFGR: HSESEL (Bitfield-Mask: 0x01) */
#define RCC_CFGR_HSESEL                                                    RCC_CFGR_HSESEL_Msk

