stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    IWUF    =====================================================*/
#define PWR_IWUF_WLPAWURF_Pos                                              (10UL)		/*!<PWR IWUF: WLPAWURF (Bit 10) */
#define PWR_IWUF_WLPAWURF_Msk                                              (0x400UL)		/*!< PWR IWUF: WLPAWURF (Bitfield-Mask: 0x01) */
#define PWR_IWUF_WLPAWURF                                                  PWR_IWUF_WLPAWURF_Msk
#define PWR_IWUF_WMRSUBGHCPUF_Pos                                          (9UL)		/*!<PWR IWUF: WMRSUBGHCPUF (Bit 9) */
#define PWR_IWUF_WMRSUBGHCPUF_Msk                                          (0x200UL)		/*!< PWR IWUF: WMRSUBGHCPUF (Bitfield-Mask: 0x01) */
#define PWR_IWUF_WMRSUBGHCPUF                                              PWR_IWUF_WMRSUBGHCPUF_Msk
#define PWR_IWUF_WMRSUBGF_Pos                                              (8UL)		/*!<PWR IWUF: WMRSUBGF (Bit 8) */
#define PWR_IWUF_WMRSUBGF_Msk                                              (0x100UL)		/*!< PWR IWUF: WMRSUBGF (Bitfield-Mask: 0x01) */
#define PWR_IWUF_WMRSUBGF                                                  PWR_IWUF_WMRSUBGF_Msk
#define PWR_IWUF_IWUF4_Pos                                                 (4UL)		/*!<PWR IWUF: IWUF4 (Bit 4) */
#define PWR_IWUF_IWUF4_Msk                                                 (0x10UL)		/*!< PWR IWUF: IWUF4 (Bitfield-Mask: 0x01) */
#define PWR_IWUF_IWUF4                                                     PWR_IWUF_IWUF4_Msk
#define PWR_IWUF_IWUF3_Pos                                                 (3UL)		/*!<PWR IWUF: IWUF3 (Bit 3) */
#define PWR_IWUF_IWUF3_Msk                                                 (0x8UL)		/*!< PWR IWUF: IWUF3 (Bitfield-Mask: 0x01) */
#define PWR_IWUF_IWUF3                                                     PWR_IWUF_IWUF3_Msk
#define PWR_IWUF_IWUF2_Pos                                                 (2UL)		/*!<PWR IWUF: IWUF2 (Bit 2) */
#define PWR_IWUF_IWUF2_Msk                                                 (0x4UL)		/*!< PWR IWUF: IWUF2 (Bitfield-Mask: 0x01) */
#define PWR_IWUF_IWUF2                                                     PWR_IWUF_IWUF2_Msk
#define PWR_IWUF_IWUF1_Pos                                                 (1UL)		/*!<PWR IWUF: IWUF1 (Bit 1) */
#define PWR_IWUF_IWUF1_Msk                                                 (0x2UL)		/*!< PWR IWUF: IWUF1 (Bitfield-Mask: 0x01) */
#define PWR_IWUF_IWUF1                                                     PWR_IWUF_IWUF1_Msk
#define PWR_IWUF_IWUF0_Pos                                                 (0UL)		/*!<PWR IWUF: IWUF0 (Bit 0) */
#define PWR_IWUF_IWUF0_Msk                                                 (0x1UL)		/*!< PWR IWUF: IWUF0 (Bitfield-Mask: 0x01) */
#define PWR_IWUF_IWUF0                                                     PWR_IWUF_IWUF0_Msk

/* =====================================================    SR2    =====================================================*/
#define PWR_SR2_IOBOOTVAL_Pos                                              (12UL)		/*!<PWR SR2: IOBOOTVAL (Bit 12) */
#define PWR_SR2_IOBOOTVAL_Msk                                              (0xf000UL)		/*!< PWR SR2: IOBOOTVAL (Bitfield-Mask: 0x0f) */
#define PWR_SR2_IOBOOTVAL                                                  PWR_SR2_IOBOOTVAL_Msk
#define PWR_SR2_IOBOOTVAL_0                                                (0x1U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_1                                                (0x2U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_2                                                (0x4U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_IOBOOTVAL_3                                                (0x8U << PWR_SR2_IOBOOTVAL_Pos)
#define PWR_SR2_PVDO_Pos                                                   (11UL)		/*!<PWR SR2: PVDO (Bit 11) */
#define PWR_SR2_PVDO_Msk                                                   (0x800UL)		/*!< PWR SR2: PVDO (Bitfield-Mask: 0x01) */
#define PWR_SR2_PVDO                                                       PWR_SR2_PVDO_Msk
#define PWR_SR2_REGMS_Pos                                                  (9UL)		/*!<PWR SR2: REGMS (Bit 9) */
#define PWR_SR2_REGMS_Msk                                                  (0x200UL)		/*!< PWR SR2: REGMS (Bitfield-Mask: 0x01) */
#define PWR_SR2_REGMS                                                      PWR_SR2_REGMS_Msk
#define PWR_SR2_REGLPS_Pos                                                 (8UL)		/*!<PWR SR2: REGLPS (Bit 8) */
#define PWR_SR2_REGLPS_Msk                                                 (0x100UL)		/*!< PWR SR2: REGLPS (Bitfield-Mask: 0x01) */
#define PWR_SR2_REGLPS                                                     PWR_SR2_REGLPS_Msk
#define PWR_SR2_IOBOOTVAL2_Pos                                             (4UL)		/*!<PWR SR2: IOBOOTVAL2 (Bit 4) */
#define PWR_SR2_IOBOOTVAL2_Msk                                             (0xf0UL)		/*!< PWR SR2: IOBOOTVAL2 (Bitfield-Mask: 0x0f) */
#define PWR_SR2_IOBOOTVAL2                                                 PWR_SR2_IOBOOTVAL2_Msk
#define PWR_SR2_IOBOOTVAL2_0                                               (0x1U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_1                                               (0x2U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_2                                               (0x4U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_IOBOOTVAL2_3                                               (0x8U << PWR_SR2_IOBOOTVAL2_Pos)
#define PWR_SR2_SMPSRDY_Pos                                                (2UL)		/*!<PWR SR2: SMPSRDY (Bit 2) */
#define PWR_SR2_SMPSRDY_Msk                                                (0x4UL)		/*!< PWR SR2: SMPSRDY (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSRDY                                                    PWR_SR2_SMPSRDY_Msk
#define PWR_SR2_SMPSENR_Pos                                                (1UL)		/*!<PWR SR2: SMPSENR (Bit 1) */
#define PWR_SR2_SMPSENR_Msk                                                (0x2UL)		/*!< PWR SR2: SMPSENR (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSENR                                                    PWR_SR2_SMPSENR_Msk
#define PWR_SR2_SMPSBYPR_Pos                                               (0UL)		/*!<PWR SR2: SMPSBYPR (Bit 0) */
#define PWR_SR2_SMPSBYPR_Msk                                               (0x1UL)		/*!< PWR SR2: SMPSBYPR (Bitfield-Mask: 0x01) */
#define PWR_SR2_SMPSBYPR                                                   PWR_SR2_SMPSBYPR_Msk

/* =====================================================    CR5    =====================================================*/
#define PWR_CR5_SMPS_BOF_DYN_Pos                                           (15UL)		/*!<PWR CR5: SMPS_BOF_DYN (Bit 15) */
#define PWR_CR5_SMPS_BOF_DYN_Msk                                           (0x8000UL)		/*!< PWR CR5: SMPS_BOF_DYN (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPS_BOF_DYN                                               PWR_CR5_SMPS_BOF_DYN_Msk
#define PWR_CR5_SMPS_PRECH_CUR_SEL_Pos                                     (13UL)		/*!<PWR CR5: SMPS_PRECH_CUR_SEL (Bit 13) */
#define PWR_CR5_SMPS_PRECH_CUR_SEL_Msk                                     (0x6000UL)		/*!< PWR CR5: SMPS_PRECH_CUR_SEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPS_PRECH_CUR_SEL                                         PWR_CR5_SMPS_PRECH_CUR_SEL_Msk
#define PWR_CR5_SMPS_PRECH_CUR_SEL_0                                       (0x1U << PWR_CR5_SMPS_PRECH_CUR_SEL_Pos)
#define PWR_CR5_SMPS_PRECH_CUR_SEL_1                                       (0x2U << PWR_CR5_SMPS_PRECH_CUR_SEL_Pos)
#define PWR_CR5_CLKDETR_DISABLE_Pos                                        (12UL)		/*!<PWR CR5: CLKDETR_DISABLE (Bit 12) */
#define PWR_CR5_CLKDETR_DISABLE_Msk                                        (0x1000UL)		/*!< PWR CR5: CLKDETR_DISABLE (Bitfield-Mask: 0x01) */
#define PWR_CR5_CLKDETR_DISABLE                                            PWR_CR5_CLKDETR_DISABLE_Msk
#define PWR_CR5_SMPS_ENA_DCM_Pos                                           (11UL)		/*!<PWR CR5: SMPS_ENA_DCM (Bit 11) */
#define PWR_CR5_SMPS_ENA_DCM_Msk                                           (0x800UL)		/*!< PWR CR5: SMPS_ENA_DCM (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPS_ENA_DCM                                               PWR_CR5_SMPS_ENA_DCM_Msk
#define PWR_CR5_NOSMPS_Pos                                                 (10UL)		/*!<PWR CR5: NOSMPS (Bit 10) */
#define PWR_CR5_NOSMPS_Msk                                                 (0x400UL)		/*!< PWR CR5: NOSMPS (Bitfield-Mask: 0x01) */
#define PWR_CR5_NOSMPS                                                     PWR_CR5_NOSMPS_Msk
#define PWR_CR5_SMPSFBYP_Pos                                               (9UL)		/*!<PWR CR5: SMPSFBYP (Bit 9) */
#define PWR_CR5_SMPSFBYP_Msk                                               (0x200UL)		/*!< PWR CR5: SMPSFBYP (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSFBYP                                                   PWR_CR5_SMPSFBYP_Msk
#define PWR_CR5_SMPSLPOPEN_Pos                                             (8UL)		/*!<PWR CR5: SMPSLPOPEN (Bit 8) */
#define PWR_CR5_SMPSLPOPEN_Msk                                             (0x100UL)		/*!< PWR CR5: SMPSLPOPEN (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPSLPOPEN                                                 PWR_CR5_SMPSLPOPEN_Msk
#define PWR_CR5_NOSMPS_BOF_Pos                                             (7UL)		/*!<PWR CR5: NOSMPS_BOF (Bit 7) */
#define PWR_CR5_NOSMPS_BOF_Msk                                             (0x80UL)		/*!< PWR CR5: NOSMPS_BOF (Bitfield-Mask: 0x01) */
#define PWR_CR5_NOSMPS_BOF                                                 PWR_CR5_NOSMPS_BOF_Msk
#define PWR_CR5_SMPS_BOF_STATIC_Pos                                        (6UL)		/*!<PWR CR5: SMPS_BOF_STATIC (Bit 6) */
#define PWR_CR5_SMPS_BOF_STATIC_Msk                                        (0x40UL)		/*!< PWR CR5: SMPS_BOF_STATIC (Bitfield-Mask: 0x01) */
#define PWR_CR5_SMPS_BOF_STATIC                                            PWR_CR5_SMPS_BOF_STATIC_Msk
#define PWR_CR5_SMPSBOMSEL_Pos                                             (4UL)		/*!<PWR CR5: SMPSBOMSEL (Bit 4) */
#define PWR_CR5_SMPSBOMSEL_Msk                                             (0x30UL)		/*!< PWR CR5: SMPSBOMSEL (Bitfield-Mask: 0x03) */
#define PWR_CR5_SMPSBOMSEL                                                 PWR_CR5_SMPSBOMSEL_Msk
#define PWR_CR5_SMPSBOMSEL_0                                               (0x1U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSBOMSEL_1                                               (0x2U << PWR_CR5_SMPSBOMSEL_Pos)
#define PWR_CR5_SMPSLVL_Pos                                                (0UL)		/*!<PWR CR5: SMPSLVL (Bit 0) */
#define PWR_CR5_SMPSLVL_Msk                                                (0xfUL)		/*!< PWR CR5: SMPSLVL (Bitfield-Mask: 0x0f) */
#define PWR_CR5_SMPSLVL                                                    PWR_CR5_SMPSLVL_Msk
#define PWR_CR5_SMPSLVL_0                                                  (0x1U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_1                                                  (0x2U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_2                                                  (0x4U << PWR_CR5_SMPSLVL_Pos)
#define PWR_CR5_SMPSLVL_3                                                  (0x8U << PWR_CR5_SMPSLVL_Pos)

