stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* ============================================================================================================================*/
/*=====================                                        RNG                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define RNG_CR_TST_CLK_Pos                                                 (3UL)		/*!<RNG CR: TST_CLK (Bit 3) */
#define RNG_CR_TST_CLK_Msk                                                 (0x8UL)		/*!< RNG CR: TST_CLK (Bitfield-Mask: 0x01) */
#define RNG_CR_TST_CLK                                                     RNG_CR_TST_CLK_Msk
#define RNG_CR_RNG_DIS_Pos                                                 (2UL)		/*!<RNG CR: RNG_DIS (Bit 2) */
#define RNG_CR_RNG_DIS_Msk                                                 (0x4UL)		/*!< RNG CR: RNG_DIS (Bitfield-Mask: 0x01) */
#define RNG_CR_RNG_DIS                                                     RNG_CR_RNG_DIS_Msk

/* =====================================================    SR    =====================================================*/
#define RNG_SR_FAULT_Pos                                                   (2UL)		/*!<RNG SR: FAULT (Bit 2) */
#define RNG_SR_FAULT_Msk                                                   (0x4UL)		/*!< RNG SR: FAULT (Bitfield-Mask: 0x01) */
#define RNG_SR_FAULT                                                       RNG_SR_FAULT_Msk
#define RNG_SR_REVCLK_Pos                                                  (1UL)		/*!<RNG SR: REVCLK (Bit 1) */
#define RNG_SR_REVCLK_Msk                                                  (0x2UL)		/*!< RNG SR: REVCLK (Bitfield-Mask: 0x01) */
#define RNG_SR_REVCLK                                                      RNG_SR_REVCLK_Msk
#define RNG_SR_RNGRDY_Pos                                                  (0UL)		/*!<RNG SR: RNGRDY (Bit 0) */
#define RNG_SR_RNGRDY_Msk                                                  (0x1UL)		/*!< RNG SR: RNGRDY (Bitfield-Mask: 0x01) */
#define RNG_SR_RNGRDY                                                      RNG_SR_RNGRDY_Msk

/* =====================================================    VAL    =====================================================*/
#define RNG_VAL_RANDOM_VALUE_Pos                                           (0UL)		/*!<RNG VAL: RANDOM_VALUE (Bit 0) */
#define RNG_VAL_RANDOM_VALUE_Msk                                           (0xffffUL)		/*!< RNG VAL: RANDOM_VALUE (Bitfield-Mask: 0xffff) */
#define RNG_VAL_RANDOM_VALUE                                               RNG_VAL_RANDOM_VALUE_Msk
#define RNG_VAL_RANDOM_VALUE_0                                             (0x1U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_1                                             (0x2U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_2                                             (0x4U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_3                                             (0x8U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_4                                             (0x10U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_5                                             (0x20U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_6                                             (0x40U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_7                                             (0x80U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_8                                             (0x100U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_9                                             (0x200U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_10                                            (0x400U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_11                                            (0x800U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_12                                            (0x1000U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_13                                            (0x2000U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_14                                            (0x4000U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_15                                            (0x8000U << RNG_VAL_RANDOM_VALUE_Pos)


/* ============================================================================================================================*/
/*=====================                                        DMA                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    ISR    =====================================================*/
#define DMA_ISR_TEIF8_Pos                                                  (31UL)		/*!<DMA ISR: TEIF8 (Bit 31) */
#define DMA_ISR_TEIF8_Msk                                                  (0x80000000UL)		/*!< DMA ISR: TEIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF8                                                      DMA_ISR_TEIF8_Msk
#define DMA_ISR_HTIF8_Pos                                                  (30UL)		/*!<DMA ISR: HTIF8 (Bit 30) */
#define DMA_ISR_HTIF8_Msk                                                  (0x40000000UL)		/*!< DMA ISR: HTIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF8                                                      DMA_ISR_HTIF8_Msk
#define DMA_ISR_TCIF8_Pos                                                  (29UL)		/*!<DMA ISR: TCIF8 (Bit 29) */
#define DMA_ISR_TCIF8_Msk                                                  (0x20000000UL)		/*!< DMA ISR: TCIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF8                                                      DMA_ISR_TCIF8_Msk
#define DMA_ISR_GIF8_Pos                                                   (28UL)		/*!<DMA ISR: GIF8 (Bit 28) */
#define DMA_ISR_GIF8_Msk                                                   (0x10000000UL)		/*!< DMA ISR: GIF8 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF8                                                       DMA_ISR_GIF8_Msk
#define DMA_ISR_TEIF7_Pos                                                  (27UL)		/*!<DMA ISR: TEIF7 (Bit 27) */
#define DMA_ISR_TEIF7_Msk                                                  (0x8000000UL)		/*!< DMA ISR: TEIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF7                                                      DMA_ISR_TEIF7_Msk
#define DMA_ISR_HTIF7_Pos                                                  (26UL)		/*!<DMA ISR: HTIF7 (Bit 26) */
#define DMA_ISR_HTIF7_Msk                                                  (0x4000000UL)		/*!< DMA ISR: HTIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF7                                                      DMA_ISR_HTIF7_Msk
#define DMA_ISR_TCIF7_Pos                                                  (25UL)		/*!<DMA ISR: TCIF7 (Bit 25) */
#define DMA_ISR_TCIF7_Msk                                                  (0x2000000UL)		/*!< DMA ISR: TCIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF7                                                      DMA_ISR_TCIF7_Msk
#define DMA_ISR_GIF7_Pos                                                   (24UL)		/*!<DMA ISR: GIF7 (Bit 24) */
#define DMA_ISR_GIF7_Msk                                                   (0x1000000UL)		/*!< DMA ISR: GIF7 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF7                                                       DMA_ISR_GIF7_Msk
#define DMA_ISR_TEIF6_Pos                                                  (23UL)		/*!<DMA ISR: TEIF6 (Bit 23) */
#define DMA_ISR_TEIF6_Msk                                                  (0x800000UL)		/*!< DMA ISR: TEIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF6                                                      DMA_ISR_TEIF6_Msk
#define DMA_ISR_HTIF6_Pos                                                  (22UL)		/*!<DMA ISR: HTIF6 (Bit 22) */
#define DMA_ISR_HTIF6_Msk                                                  (0x400000UL)		/*!< DMA ISR: HTIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF6                                                      DMA_ISR_HTIF6_Msk
#define DMA_ISR_TCIF6_Pos                                                  (21UL)		/*!<DMA ISR: TCIF6 (Bit 21) */
#define DMA_ISR_TCIF6_Msk                                                  (0x200000UL)		/*!< DMA ISR: TCIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF6                                                      DMA_ISR_TCIF6_Msk
#define DMA_ISR_GIF6_Pos                                                   (20UL)		/*!<DMA ISR: GIF6 (Bit 20) */
#define DMA_ISR_GIF6_Msk                                                   (0x100000UL)		/*!< DMA ISR: GIF6 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF6                                                       DMA_ISR_GIF6_Msk
#define DMA_ISR_TEIF5_Pos                                                  (19UL)		/*!<DMA ISR: TEIF5 (Bit 19) */
#define DMA_ISR_TEIF5_Msk                                                  (0x80000UL)		/*!< DMA ISR: TEIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF5                                                      DMA_ISR_TEIF5_Msk
#define DMA_ISR_HTIF5_Pos                                                  (18UL)		/*!<DMA ISR: HTIF5 (Bit 18) */
#define DMA_ISR_HTIF5_Msk                                                  (0x40000UL)		/*!< DMA ISR: HTIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF5                                                      DMA_ISR_HTIF5_Msk
#define DMA_ISR_TCIF5_Pos                                                  (17UL)		/*!<DMA ISR: TCIF5 (Bit 17) */
#define DMA_ISR_TCIF5_Msk                                                  (0x20000UL)		/*!< DMA ISR: TCIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF5                                                      DMA_ISR_TCIF5_Msk
#define DMA_ISR_GIF5_Pos                                                   (16UL)		/*!<DMA ISR: GIF5 (Bit 16) */
#define DMA_ISR_GIF5_Msk                                                   (0x10000UL)		/*!< DMA ISR: GIF5 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF5                                                       DMA_ISR_GIF5_Msk
#define DMA_ISR_TEIF4_Pos                                                  (15UL)		/*!<DMA ISR: TEIF4 (Bit 15) */
#define DMA_ISR_TEIF4_Msk                                                  (0x8000UL)		/*!< DMA ISR: TEIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF4                                                      DMA_ISR_TEIF4_Msk
#define DMA_ISR_HTIF4_Pos                                                  (14UL)		/*!<DMA ISR: HTIF4 (Bit 14) */
#define DMA_ISR_HTIF4_Msk                                                  (0x4000UL)		/*!< DMA ISR: HTIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF4                                                      DMA_ISR_HTIF4_Msk
#define DMA_ISR_TCIF4_Pos                                                  (13UL)		/*!<DMA ISR: TCIF4 (Bit 13) */
#define DMA_ISR_TCIF4_Msk                                                  (0x2000UL)		/*!< DMA ISR: TCIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF4                                                      DMA_ISR_TCIF4_Msk
#define DMA_ISR_GIF4_Pos                                                   (12UL)		/*!<DMA ISR: GIF4 (Bit 12) */
#define DMA_ISR_GIF4_Msk                                                   (0x1000UL)		/*!< DMA ISR: GIF4 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF4                                                       DMA_ISR_GIF4_Msk
#define DMA_ISR_TEIF3_Pos                                                  (11UL)		/*!<DMA ISR: TEIF3 (Bit 11) */
#define DMA_ISR_TEIF3_Msk                                                  (0x800UL)		/*!< DMA ISR: TEIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF3                                                      DMA_ISR_TEIF3_Msk
#define DMA_ISR_HTIF3_Pos                                                  (10UL)		/*!<DMA ISR: HTIF3 (Bit 10) */
#define DMA_ISR_HTIF3_Msk                                                  (0x400UL)		/*!< DMA ISR: HTIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF3                                                      DMA_ISR_HTIF3_Msk
#define DMA_ISR_TCIF3_Pos                                                  (9UL)		/*!<DMA ISR: TCIF3 (Bit 9) */
#define DMA_ISR_TCIF3_Msk                                                  (0x200UL)		/*!< DMA ISR: TCIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF3                                                      DMA_ISR_TCIF3_Msk
#define DMA_ISR_GIF3_Pos                                                   (8UL)		/*!<DMA ISR: GIF3 (Bit 8) */
#define DMA_ISR_GIF3_Msk                                                   (0x100UL)		/*!< DMA ISR: GIF3 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF3                                                       DMA_ISR_GIF3_Msk
#define DMA_ISR_TEIF2_Pos                                                  (7UL)		/*!<DMA ISR: TEIF2 (Bit 7) */
#define DMA_ISR_TEIF2_Msk                                                  (0x80UL)		/*!< DMA ISR: TEIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF2                                                      DMA_ISR_TEIF2_Msk
#define DMA_ISR_HTIF2_Pos                                                  (6UL)		/*!<DMA ISR: HTIF2 (Bit 6) */
#define DMA_ISR_HTIF2_Msk                                                  (0x40UL)		/*!< DMA ISR: HTIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF2                                                      DMA_ISR_HTIF2_Msk
#define DMA_ISR_TCIF2_Pos                                                  (5UL)		/*!<DMA ISR: TCIF2 (Bit 5) */
#define DMA_ISR_TCIF2_Msk                                                  (0x20UL)		/*!< DMA ISR: TCIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF2                                                      DMA_ISR_TCIF2_Msk
#define DMA_ISR_GIF2_Pos                                                   (4UL)		/*!<DMA ISR: GIF2 (Bit 4) */
#define DMA_ISR_GIF2_Msk                                                   (0x10UL)		/*!< DMA ISR: GIF2 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF2                                                       DMA_ISR_GIF2_Msk
#define DMA_ISR_TEIF1_Pos                                                  (3UL)		/*!<DMA ISR: TEIF1 (Bit 3) */
#define DMA_ISR_TEIF1_Msk                                                  (0x8UL)		/*!< DMA ISR: TEIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TEIF1                                                      DMA_ISR_TEIF1_Msk
#define DMA_ISR_HTIF1_Pos                                                  (2UL)		/*!<DMA ISR: HTIF1 (Bit 2) */
#define DMA_ISR_HTIF1_Msk                                                  (0x4UL)		/*!< DMA ISR: HTIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_HTIF1                                                      DMA_ISR_HTIF1_Msk
#define DMA_ISR_TCIF1_Pos                                                  (1UL)		/*!<DMA ISR: TCIF1 (Bit 1) */
#define DMA_ISR_TCIF1_Msk                                                  (0x2UL)		/*!< DMA ISR: TCIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_TCIF1                                                      DMA_ISR_TCIF1_Msk
#define DMA_ISR_GIF1_Pos                                                   (0UL)		/*!<DMA ISR: GIF1 (Bit 0) */
#define DMA_ISR_GIF1_Msk                                                   (0x1UL)		/*!< DMA ISR: GIF1 (Bitfield-Mask: 0x01) */
#define DMA_ISR_GIF1                                                       DMA_ISR_GIF1_Msk

