stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    CMAR    =====================================================*/
#define DMA_CMAR_MA_Pos                                                    (0UL)		/*!<DMA CMAR: MA (Bit 0) */
#define DMA_CMAR_MA_Msk                                                    (0xffffffffUL)		/*!< DMA CMAR: MA (Bitfield-Mask: 0xffffffff) */
#define DMA_CMAR_MA                                                        DMA_CMAR_MA_Msk
#define DMA_CMAR_MA_0                                                      (0x1U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_1                                                      (0x2U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_2                                                      (0x4U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_3                                                      (0x8U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_4                                                      (0x10U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_5                                                      (0x20U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_6                                                      (0x40U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_7                                                      (0x80U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_8                                                      (0x100U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_9                                                      (0x200U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_10                                                     (0x400U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_11                                                     (0x800U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_12                                                     (0x1000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_13                                                     (0x2000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_14                                                     (0x4000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_15                                                     (0x8000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_16                                                     (0x10000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_17                                                     (0x20000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_18                                                     (0x40000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_19                                                     (0x80000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_20                                                     (0x100000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_21                                                     (0x200000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_22                                                     (0x400000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_23                                                     (0x800000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_24                                                     (0x1000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_25                                                     (0x2000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_26                                                     (0x4000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_27                                                     (0x8000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_28                                                     (0x10000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_29                                                     (0x20000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_30                                                     (0x40000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_31                                                     (0x80000000UL << DMA_CMAR_MA_Pos)


/* ============================================================================================================================*/
/*=====================                                      DMAMUX                                      =====================*/
/* ============================================================================================================================*/

/* =====================================================    CxCR    =====================================================*/
#define DMAMUX_CxCR_DMAREQ_ID_Pos                                          (0UL)		/*!<DMAMUX CxCR: DMAREQ_ID (Bit 0) */
#define DMAMUX_CxCR_DMAREQ_ID_Msk                                          (0x1fUL)		/*!< DMAMUX CxCR: DMAREQ_ID (Bitfield-Mask: 0x1f) */
#define DMAMUX_CxCR_DMAREQ_ID                                              DMAMUX_CxCR_DMAREQ_ID_Msk
#define DMAMUX_CxCR_DMAREQ_ID_0                                            (0x1U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_1                                            (0x2U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_2                                            (0x4U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_3                                            (0x8U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_4                                            (0x10U << DMAMUX_CxCR_DMAREQ_ID_Pos)


/* ============================================================================================================================*/
/*=====================                                        AES                                        =====================*/
/* ============================================================================================================================*/

/* =====================================================    CR    =====================================================*/
#define AES_CR_NPBLB_Pos                                                   (20UL)		/*!<AES CR: NPBLB (Bit 20) */
#define AES_CR_NPBLB_Msk                                                   (0xf00000UL)		/*!< AES CR: NPBLB (Bitfield-Mask: 0x0f) */
#define AES_CR_NPBLB                                                       AES_CR_NPBLB_Msk
#define AES_CR_NPBLB_0                                                     (0x1U << AES_CR_NPBLB_Pos)
#define AES_CR_NPBLB_1                                                     (0x2U << AES_CR_NPBLB_Pos)
#define AES_CR_NPBLB_2                                                     (0x4U << AES_CR_NPBLB_Pos)
#define AES_CR_NPBLB_3                                                     (0x8U << AES_CR_NPBLB_Pos)
#define AES_CR_KEYSIZE_Pos                                                 (18UL)		/*!<AES CR: KEYSIZE (Bit 18) */
#define AES_CR_KEYSIZE_Msk                                                 (0x40000UL)		/*!< AES CR: KEYSIZE (Bitfield-Mask: 0x01) */
#define AES_CR_KEYSIZE                                                     AES_CR_KEYSIZE_Msk
#define AES_CR_GCMPH_Pos                                                   (13UL)		/*!<AES CR: GCMPH (Bit 13) */
#define AES_CR_GCMPH_Msk                                                   (0x6000UL)		/*!< AES CR: GCMPH (Bitfield-Mask: 0x03) */
#define AES_CR_GCMPH                                                       AES_CR_GCMPH_Msk
#define AES_CR_GCMPH_0                                                     (0x1U << AES_CR_GCMPH_Pos)
#define AES_CR_GCMPH_1                                                     (0x2U << AES_CR_GCMPH_Pos)
#define AES_CR_DMAOUTEN_Pos                                                (12UL)		/*!<AES CR: DMAOUTEN (Bit 12) */
#define AES_CR_DMAOUTEN_Msk                                                (0x1000UL)		/*!< AES CR: DMAOUTEN (Bitfield-Mask: 0x01) */
#define AES_CR_DMAOUTEN                                                    AES_CR_DMAOUTEN_Msk
#define AES_CR_DMAINEN_Pos                                                 (11UL)		/*!<AES CR: DMAINEN (Bit 11) */
#define AES_CR_DMAINEN_Msk                                                 (0x800UL)		/*!< AES CR: DMAINEN (Bitfield-Mask: 0x01) */
#define AES_CR_DMAINEN                                                     AES_CR_DMAINEN_Msk
#define AES_CR_ERRIE_Pos                                                   (10UL)		/*!<AES CR: ERRIE (Bit 10) */
#define AES_CR_ERRIE_Msk                                                   (0x400UL)		/*!< AES CR: ERRIE (Bitfield-Mask: 0x01) */
#define AES_CR_ERRIE                                                       AES_CR_ERRIE_Msk
#define AES_CR_CCFIE_Pos                                                   (9UL)		/*!<AES CR: CCFIE (Bit 9) */
#define AES_CR_CCFIE_Msk                                                   (0x200UL)		/*!< AES CR: CCFIE (Bitfield-Mask: 0x01) */
#define AES_CR_CCFIE                                                       AES_CR_CCFIE_Msk
#define AES_CR_ERRC_Pos                                                    (8UL)		/*!<AES CR: ERRC (Bit 8) */
#define AES_CR_ERRC_Msk                                                    (0x100UL)		/*!< AES CR: ERRC (Bitfield-Mask: 0x01) */
#define AES_CR_ERRC                                                        AES_CR_ERRC_Msk
#define AES_CR_CCFC_Pos                                                    (7UL)		/*!<AES CR: CCFC (Bit 7) */
#define AES_CR_CCFC_Msk                                                    (0x80UL)		/*!< AES CR: CCFC (Bitfield-Mask: 0x01) */
#define AES_CR_CCFC                                                        AES_CR_CCFC_Msk
#define AES_CR_CHMOD_Pos                                                   (5UL)		/*!<AES CR: CHMOD (Bit 5) */
#define AES_CR_CHMOD_Msk                                                   (0x10060UL)		/*!< AES CR: CHMOD (Bitfield-Mask: 0x803) */
#define AES_CR_CHMOD                                                       AES_CR_CHMOD_Msk
#define AES_CR_CHMOD_0                                                     (0x1U << AES_CR_CHMOD_Pos)
#define AES_CR_CHMOD_1                                                     (0x2U << AES_CR_CHMOD_Pos)
#define AES_CR_CHMOD_2                                                     (0x800U << AES_CR_CHMOD_Pos)
#define AES_CR_MODE_Pos                                                    (3UL)		/*!<AES CR: MODE (Bit 3) */
#define AES_CR_MODE_Msk                                                    (0x18UL)		/*!< AES CR: MODE (Bitfield-Mask: 0x03) */
#define AES_CR_MODE                                                        AES_CR_MODE_Msk
#define AES_CR_MODE_0                                                      (0x1U << AES_CR_MODE_Pos)
#define AES_CR_MODE_1                                                      (0x2U << AES_CR_MODE_Pos)
#define AES_CR_DATATYPE_Pos                                                (1UL)		/*!<AES CR: DATATYPE (Bit 1) */
#define AES_CR_DATATYPE_Msk                                                (0x6UL)		/*!< AES CR: DATATYPE (Bitfield-Mask: 0x03) */
#define AES_CR_DATATYPE                                                    AES_CR_DATATYPE_Msk
#define AES_CR_DATATYPE_0                                                  (0x1U << AES_CR_DATATYPE_Pos)
#define AES_CR_DATATYPE_1                                                  (0x2U << AES_CR_DATATYPE_Pos)
#define AES_CR_EN_Pos                                                      (0UL)		/*!<AES CR: EN (Bit 0) */
#define AES_CR_EN_Msk                                                      (0x1UL)		/*!< AES CR: EN (Bitfield-Mask: 0x01) */
#define AES_CR_EN                                                          AES_CR_EN_Msk

/* =====================================================    SR    =====================================================*/
#define AES_SR_BUSY_Pos                                                    (3UL)		/*!<AES SR: BUSY (Bit 3) */
#define AES_SR_BUSY_Msk                                                    (0x8UL)		/*!< AES SR: BUSY (Bitfield-Mask: 0x01) */
#define AES_SR_BUSY                                                        AES_SR_BUSY_Msk
#define AES_SR_WRERR_Pos                                                   (2UL)		/*!<AES SR: WRERR (Bit 2) */
#define AES_SR_WRERR_Msk                                                   (0x4UL)		/*!< AES SR: WRERR (Bitfield-Mask: 0x01) */
#define AES_SR_WRERR                                                       AES_SR_WRERR_Msk
#define AES_SR_RDERR_Pos                                                   (1UL)		/*!<AES SR: RDERR (Bit 1) */
#define AES_SR_RDERR_Msk                                                   (0x2UL)		/*!< AES SR: RDERR (Bitfield-Mask: 0x01) */
#define AES_SR_RDERR                                                       AES_SR_RDERR_Msk
#define AES_SR_CCF_Pos                                                     (0UL)		/*!<AES SR: CCF (Bit 0) */
#define AES_SR_CCF_Msk                                                     (0x1UL)		/*!< AES SR: CCF (Bitfield-Mask: 0x01) */
#define AES_SR_CCF                                                         AES_SR_CCF_Msk

/* =====================================================    DINR    =====================================================*/
#define AES_DINR_DINR_Pos                                                  (0UL)		/*!<AES DINR: DINR (Bit 0) */
#define AES_DINR_DINR_Msk                                                  (0xffffffffUL)		/*!< AES DINR: DINR (Bitfield-Mask: 0xffffffff) */
#define AES_DINR_DINR                                                      AES_DINR_DINR_Msk
#define AES_DINR_DINR_0                                                    (0x1U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_1                                                    (0x2U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_2                                                    (0x4U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_3                                                    (0x8U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_4                                                    (0x10U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_5                                                    (0x20U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_6                                                    (0x40U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_7                                                    (0x80U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_8                                                    (0x100U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_9                                                    (0x200U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_10                                                   (0x400U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_11                                                   (0x800U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_12                                                   (0x1000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_13                                                   (0x2000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_14                                                   (0x4000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_15                                                   (0x8000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_16                                                   (0x10000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_17                                                   (0x20000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_18                                                   (0x40000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_19                                                   (0x80000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_20                                                   (0x100000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_21                                                   (0x200000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_22                                                   (0x400000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_23                                                   (0x800000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_24                                                   (0x1000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_25                                                   (0x2000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_26                                                   (0x4000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_27                                                   (0x8000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_28                                                   (0x10000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_29                                                   (0x20000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_30                                                   (0x40000000U << AES_DINR_DINR_Pos)
#define AES_DINR_DINR_31                                                   (0x80000000UL << AES_DINR_DINR_Pos)

/* =====================================================    DOUTR    =====================================================*/
#define AES_DOUTR_DOUTR_Pos                                                (0UL)		/*!<AES DOUTR: DOUTR (Bit 0) */
#define AES_DOUTR_DOUTR_Msk                                                (0xffffffffUL)		/*!< AES DOUTR: DOUTR (Bitfield-Mask: 0xffffffff) */
#define AES_DOUTR_DOUTR                                                    AES_DOUTR_DOUTR_Msk
#define AES_DOUTR_DOUTR_0                                                  (0x1U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_1                                                  (0x2U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_2                                                  (0x4U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_3                                                  (0x8U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_4                                                  (0x10U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_5                                                  (0x20U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_6                                                  (0x40U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_7                                                  (0x80U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_8                                                  (0x100U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_9                                                  (0x200U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_10                                                 (0x400U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_11                                                 (0x800U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_12                                                 (0x1000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_13                                                 (0x2000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_14                                                 (0x4000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_15                                                 (0x8000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_16                                                 (0x10000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_17                                                 (0x20000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_18                                                 (0x40000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_19                                                 (0x80000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_20                                                 (0x100000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_21                                                 (0x200000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_22                                                 (0x400000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_23                                                 (0x800000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_24                                                 (0x1000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_25                                                 (0x2000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_26                                                 (0x4000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_27                                                 (0x8000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_28                                                 (0x10000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_29                                                 (0x20000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_30                                                 (0x40000000U << AES_DOUTR_DOUTR_Pos)
#define AES_DOUTR_DOUTR_31                                                 (0x80000000UL << AES_DOUTR_DOUTR_Pos)

