stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    SUSP5    =====================================================*/
#define AES_SUSP5_SUSP_Pos                                                 (0UL)		/*!<AES SUSP5: SUSP (Bit 0) */
#define AES_SUSP5_SUSP_Msk                                                 (0xffffffffUL)		/*!< AES SUSP5: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP5_SUSP                                                     AES_SUSP5_SUSP_Msk
#define AES_SUSP5_SUSP_0                                                   (0x1U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_1                                                   (0x2U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_2                                                   (0x4U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_3                                                   (0x8U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_4                                                   (0x10U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_5                                                   (0x20U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_6                                                   (0x40U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_7                                                   (0x80U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_8                                                   (0x100U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_9                                                   (0x200U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_10                                                  (0x400U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_11                                                  (0x800U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_12                                                  (0x1000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_13                                                  (0x2000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_14                                                  (0x4000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_15                                                  (0x8000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_16                                                  (0x10000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_17                                                  (0x20000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_18                                                  (0x40000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_19                                                  (0x80000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_20                                                  (0x100000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_21                                                  (0x200000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_22                                                  (0x400000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_23                                                  (0x800000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_24                                                  (0x1000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_25                                                  (0x2000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_26                                                  (0x4000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_27                                                  (0x8000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_28                                                  (0x10000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_29                                                  (0x20000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_30                                                  (0x40000000U << AES_SUSP5_SUSP_Pos)
#define AES_SUSP5_SUSP_31                                                  (0x80000000UL << AES_SUSP5_SUSP_Pos)

/* =====================================================    SUSP6    =====================================================*/
#define AES_SUSP6_SUSP_Pos                                                 (0UL)		/*!<AES SUSP6: SUSP (Bit 0) */
#define AES_SUSP6_SUSP_Msk                                                 (0xffffffffUL)		/*!< AES SUSP6: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP6_SUSP                                                     AES_SUSP6_SUSP_Msk
#define AES_SUSP6_SUSP_0                                                   (0x1U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_1                                                   (0x2U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_2                                                   (0x4U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_3                                                   (0x8U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_4                                                   (0x10U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_5                                                   (0x20U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_6                                                   (0x40U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_7                                                   (0x80U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_8                                                   (0x100U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_9                                                   (0x200U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_10                                                  (0x400U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_11                                                  (0x800U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_12                                                  (0x1000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_13                                                  (0x2000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_14                                                  (0x4000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_15                                                  (0x8000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_16                                                  (0x10000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_17                                                  (0x20000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_18                                                  (0x40000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_19                                                  (0x80000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_20                                                  (0x100000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_21                                                  (0x200000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_22                                                  (0x400000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_23                                                  (0x800000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_24                                                  (0x1000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_25                                                  (0x2000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_26                                                  (0x4000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_27                                                  (0x8000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_28                                                  (0x10000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_29                                                  (0x20000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_30                                                  (0x40000000U << AES_SUSP6_SUSP_Pos)
#define AES_SUSP6_SUSP_31                                                  (0x80000000UL << AES_SUSP6_SUSP_Pos)

/* =====================================================    SUSP7    =====================================================*/
#define AES_SUSP7_SUSP_Pos                                                 (0UL)		/*!<AES SUSP7: SUSP (Bit 0) */
#define AES_SUSP7_SUSP_Msk                                                 (0xffffffffUL)		/*!< AES SUSP7: SUSP (Bitfield-Mask: 0xffffffff) */
#define AES_SUSP7_SUSP                                                     AES_SUSP7_SUSP_Msk
#define AES_SUSP7_SUSP_0                                                   (0x1U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_1                                                   (0x2U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_2                                                   (0x4U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_3                                                   (0x8U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_4                                                   (0x10U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_5                                                   (0x20U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_6                                                   (0x40U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_7                                                   (0x80U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_8                                                   (0x100U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_9                                                   (0x200U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_10                                                  (0x400U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_11                                                  (0x800U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_12                                                  (0x1000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_13                                                  (0x2000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_14                                                  (0x4000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_15                                                  (0x8000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_16                                                  (0x10000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_17                                                  (0x20000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_18                                                  (0x40000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_19                                                  (0x80000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_20                                                  (0x100000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_21                                                  (0x200000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_22                                                  (0x400000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_23                                                  (0x800000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_24                                                  (0x1000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_25                                                  (0x2000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_26                                                  (0x4000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_27                                                  (0x8000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_28                                                  (0x10000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_29                                                  (0x20000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_30                                                  (0x40000000U << AES_SUSP7_SUSP_Pos)
#define AES_SUSP7_SUSP_31                                                  (0x80000000UL << AES_SUSP7_SUSP_Pos)


