stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    PAYLOAD_0    =====================================================*/
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos                                     (0UL)		/*!<LPAWUR PAYLOAD_0: PAYLOAD_0 (Bit 0) */
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_Msk                                     (0xffffffffUL)		/*!< LPAWUR PAYLOAD_0: PAYLOAD_0 (Bitfield-Mask: 0xffffffff) */
#define LPAWUR_PAYLOAD_0_PAYLOAD_0                                         LPAWUR_PAYLOAD_0_PAYLOAD_0_Msk
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_0                                       (0x1U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_1                                       (0x2U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_2                                       (0x4U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_3                                       (0x8U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_4                                       (0x10U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_5                                       (0x20U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_6                                       (0x40U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_7                                       (0x80U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_8                                       (0x100U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_9                                       (0x200U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_10                                      (0x400U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_11                                      (0x800U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_12                                      (0x1000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_13                                      (0x2000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_14                                      (0x4000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_15                                      (0x8000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_16                                      (0x10000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_17                                      (0x20000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_18                                      (0x40000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_19                                      (0x80000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_20                                      (0x100000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_21                                      (0x200000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_22                                      (0x400000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_23                                      (0x800000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_24                                      (0x1000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_25                                      (0x2000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_26                                      (0x4000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_27                                      (0x8000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_28                                      (0x10000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_29                                      (0x20000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_30                                      (0x40000000U << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)
#define LPAWUR_PAYLOAD_0_PAYLOAD_0_31                                      (0x80000000UL << LPAWUR_PAYLOAD_0_PAYLOAD_0_Pos)

/* =====================================================    PAYLOAD_1    =====================================================*/
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos                                     (0UL)		/*!<LPAWUR PAYLOAD_1: PAYLOAD_1 (Bit 0) */
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_Msk                                     (0xffffffffUL)		/*!< LPAWUR PAYLOAD_1: PAYLOAD_1 (Bitfield-Mask: 0xffffffff) */
#define LPAWUR_PAYLOAD_1_PAYLOAD_1                                         LPAWUR_PAYLOAD_1_PAYLOAD_1_Msk
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_0                                       (0x1U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_1                                       (0x2U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_2                                       (0x4U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_3                                       (0x8U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_4                                       (0x10U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_5                                       (0x20U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_6                                       (0x40U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_7                                       (0x80U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_8                                       (0x100U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_9                                       (0x200U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_10                                      (0x400U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_11                                      (0x800U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_12                                      (0x1000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_13                                      (0x2000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_14                                      (0x4000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_15                                      (0x8000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_16                                      (0x10000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_17                                      (0x20000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_18                                      (0x40000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_19                                      (0x80000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_20                                      (0x100000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_21                                      (0x200000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_22                                      (0x400000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_23                                      (0x800000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_24                                      (0x1000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_25                                      (0x2000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_26                                      (0x4000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_27                                      (0x8000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_28                                      (0x10000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_29                                      (0x20000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_30                                      (0x40000000U << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)
#define LPAWUR_PAYLOAD_1_PAYLOAD_1_31                                      (0x80000000UL << LPAWUR_PAYLOAD_1_PAYLOAD_1_Pos)

/* =====================================================    RFIP_VERSION    =====================================================*/
#define LPAWUR_RFIP_VERSION_PRODUCT_Pos                                    (12UL)		/*!<LPAWUR RFIP_VERSION: PRODUCT (Bit 12) */
#define LPAWUR_RFIP_VERSION_PRODUCT_Msk                                    (0xf000UL)		/*!< LPAWUR RFIP_VERSION: PRODUCT (Bitfield-Mask: 0x0f) */
#define LPAWUR_RFIP_VERSION_PRODUCT                                        LPAWUR_RFIP_VERSION_PRODUCT_Msk
#define LPAWUR_RFIP_VERSION_PRODUCT_0                                      (0x1U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_PRODUCT_1                                      (0x2U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_PRODUCT_2                                      (0x4U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_PRODUCT_3                                      (0x8U << LPAWUR_RFIP_VERSION_PRODUCT_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_Pos                                    (8UL)		/*!<LPAWUR RFIP_VERSION: VERSION (Bit 8) */
#define LPAWUR_RFIP_VERSION_VERSION_Msk                                    (0xf00UL)		/*!< LPAWUR RFIP_VERSION: VERSION (Bitfield-Mask: 0x0f) */
#define LPAWUR_RFIP_VERSION_VERSION                                        LPAWUR_RFIP_VERSION_VERSION_Msk
#define LPAWUR_RFIP_VERSION_VERSION_0                                      (0x1U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_1                                      (0x2U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_2                                      (0x4U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_VERSION_3                                      (0x8U << LPAWUR_RFIP_VERSION_VERSION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_Pos                                   (4UL)		/*!<LPAWUR RFIP_VERSION: REVISION (Bit 4) */
#define LPAWUR_RFIP_VERSION_REVISION_Msk                                   (0xf0UL)		/*!< LPAWUR RFIP_VERSION: REVISION (Bitfield-Mask: 0x0f) */
#define LPAWUR_RFIP_VERSION_REVISION                                       LPAWUR_RFIP_VERSION_REVISION_Msk
#define LPAWUR_RFIP_VERSION_REVISION_0                                     (0x1U << LPAWUR_RFIP_VERSION_REVISION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_1                                     (0x2U << LPAWUR_RFIP_VERSION_REVISION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_2                                     (0x4U << LPAWUR_RFIP_VERSION_REVISION_Pos)
#define LPAWUR_RFIP_VERSION_REVISION_3                                     (0x8U << LPAWUR_RFIP_VERSION_REVISION_Pos)

/* =====================================================    IRQ_ENABLE    =====================================================*/
#define LPAWUR_IRQ_ENABLE_FRAME_VALID_E_Pos                                (3UL)		/*!<LPAWUR IRQ_ENABLE: FRAME_VALID_E (Bit 3) */
#define LPAWUR_IRQ_ENABLE_FRAME_VALID_E_Msk                                (0x8UL)		/*!< LPAWUR IRQ_ENABLE: FRAME_VALID_E (Bitfield-Mask: 0x01) */
#define LPAWUR_IRQ_ENABLE_FRAME_VALID_E                                    LPAWUR_IRQ_ENABLE_FRAME_VALID_E_Msk
#define LPAWUR_IRQ_ENABLE_FRAME_COMPLETE_E_Pos                             (2UL)		/*!<LPAWUR IRQ_ENABLE: FRAME_COMPLETE_E (Bit 2) */
#define LPAWUR_IRQ_ENABLE_FRAME_COMPLETE_E_Msk                             (0x4UL)		/*!< LPAWUR IRQ_ENABLE: FRAME_COMPLETE_E (Bitfield-Mask: 0x01) */
#define LPAWUR_IRQ_ENABLE_FRAME_COMPLETE_E                                 LPAWUR_IRQ_ENABLE_FRAME_COMPLETE_E_Msk
#define LPAWUR_IRQ_ENABLE_FRAME_SYNC_COMPLETE_E_Pos                        (1UL)		/*!<LPAWUR IRQ_ENABLE: FRAME_SYNC_COMPLETE_E (Bit 1) */
#define LPAWUR_IRQ_ENABLE_FRAME_SYNC_COMPLETE_E_Msk                        (0x2UL)		/*!< LPAWUR IRQ_ENABLE: FRAME_SYNC_COMPLETE_E (Bitfield-Mask: 0x01) */
#define LPAWUR_IRQ_ENABLE_FRAME_SYNC_COMPLETE_E                            LPAWUR_IRQ_ENABLE_FRAME_SYNC_COMPLETE_E_Msk
#define LPAWUR_IRQ_ENABLE_BIT_SYNC_DETECTED_E_Pos                          (0UL)		/*!<LPAWUR IRQ_ENABLE: BIT_SYNC_DETECTED_E (Bit 0) */
#define LPAWUR_IRQ_ENABLE_BIT_SYNC_DETECTED_E_Msk                          (0x1UL)		/*!< LPAWUR IRQ_ENABLE: BIT_SYNC_DETECTED_E (Bitfield-Mask: 0x01) */
#define LPAWUR_IRQ_ENABLE_BIT_SYNC_DETECTED_E                              LPAWUR_IRQ_ENABLE_BIT_SYNC_DETECTED_E_Msk

/* =====================================================    STATUS    =====================================================*/
#define LPAWUR_STATUS_ERROR_F_Pos                                          (30UL)		/*!<LPAWUR STATUS: ERROR_F (Bit 30) */
#define LPAWUR_STATUS_ERROR_F_Msk                                          (0xc0000000UL)		/*!< LPAWUR STATUS: ERROR_F (Bitfield-Mask: 0x03) */
#define LPAWUR_STATUS_ERROR_F                                              LPAWUR_STATUS_ERROR_F_Msk
#define LPAWUR_STATUS_ERROR_F_0                                            (0x1U << LPAWUR_STATUS_ERROR_F_Pos)
#define LPAWUR_STATUS_ERROR_F_1                                            (0x2U << LPAWUR_STATUS_ERROR_F_Pos)
#define LPAWUR_STATUS_FRAME_VALID_F_Pos                                    (3UL)		/*!<LPAWUR STATUS: FRAME_VALID_F (Bit 3) */
#define LPAWUR_STATUS_FRAME_VALID_F_Msk                                    (0x8UL)		/*!< LPAWUR STATUS: FRAME_VALID_F (Bitfield-Mask: 0x01) */
#define LPAWUR_STATUS_FRAME_VALID_F                                        LPAWUR_STATUS_FRAME_VALID_F_Msk
#define LPAWUR_STATUS_FRAME_COMPLETE_F_Pos                                 (2UL)		/*!<LPAWUR STATUS: FRAME_COMPLETE_F (Bit 2) */
#define LPAWUR_STATUS_FRAME_COMPLETE_F_Msk                                 (0x4UL)		/*!< LPAWUR STATUS: FRAME_COMPLETE_F (Bitfield-Mask: 0x01) */
#define LPAWUR_STATUS_FRAME_COMPLETE_F                                     LPAWUR_STATUS_FRAME_COMPLETE_F_Msk
#define LPAWUR_STATUS_FRAME_SYNC_COMPLETE_F_Pos                            (1UL)		/*!<LPAWUR STATUS: FRAME_SYNC_COMPLETE_F (Bit 1) */
#define LPAWUR_STATUS_FRAME_SYNC_COMPLETE_F_Msk                            (0x2UL)		/*!< LPAWUR STATUS: FRAME_SYNC_COMPLETE_F (Bitfield-Mask: 0x01) */
#define LPAWUR_STATUS_FRAME_SYNC_COMPLETE_F                                LPAWUR_STATUS_FRAME_SYNC_COMPLETE_F_Msk
#define LPAWUR_STATUS_BIT_SYNC_DETECTED_F_Pos                              (0UL)		/*!<LPAWUR STATUS: BIT_SYNC_DETECTED_F (Bit 0) */
#define LPAWUR_STATUS_BIT_SYNC_DETECTED_F_Msk                              (0x1UL)		/*!< LPAWUR STATUS: BIT_SYNC_DETECTED_F (Bitfield-Mask: 0x01) */
#define LPAWUR_STATUS_BIT_SYNC_DETECTED_F                                  LPAWUR_STATUS_BIT_SYNC_DETECTED_F_Msk


