stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    VCO_CAL_CONFIG    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ_Pos              (31UL)		/*!<MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALIB_REQ (Bit 31) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ_Msk              (0x80000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALIB_REQ (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ                  MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ_Msk
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_SEL_Pos        (23UL)		/*!<MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALFREQ_EXT_SEL (Bit 23) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_SEL_Msk        (0x800000UL)		/*!< MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALFREQ_EXT_SEL (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_SEL            MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_SEL_Msk
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos            (16UL)		/*!<MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALFREQ_EXT (Bit 16) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Msk            (0x7f0000UL)		/*!< MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALFREQ_EXT (Bitfield-Mask: 0x7f) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT                MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Msk
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_0              (0x1U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_1              (0x2U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_2              (0x4U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_3              (0x8U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_4              (0x10U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_5              (0x20U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_6              (0x40U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALFREQ_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_SEL_Pos         (15UL)		/*!<MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALAMP_EXT_SEL (Bit 15) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_SEL_Msk         (0x8000UL)		/*!< MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALAMP_EXT_SEL (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_SEL             MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_SEL_Msk
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos             (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALAMP_EXT (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Msk             (0x3fffUL)		/*!< MR_SUBG_GLOB_DYNAMIC VCO_CAL_CONFIG: VCO_CALAMP_EXT (Bitfield-Mask: 0x3fff) */
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT                 MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Msk
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_0               (0x1U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_1               (0x2U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_2               (0x4U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_3               (0x8U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_4               (0x10U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_5               (0x20U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_6               (0x40U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_7               (0x80U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_8               (0x100U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_9               (0x200U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_10              (0x400U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_11              (0x800U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_12              (0x1000U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_13              (0x2000U << MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALAMP_EXT_Pos)

/* =====================================================    RX_TIMER    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_OR_nAND_SELECT_Pos                (31UL)		/*!<MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_OR_nAND_SELECT (Bit 31) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_OR_nAND_SELECT_Msk                (0x80000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_OR_nAND_SELECT (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_OR_nAND_SELECT                    MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_OR_nAND_SELECT_Msk
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_SQI_TIMEOUT_MASK_Pos              (30UL)		/*!<MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_SQI_TIMEOUT_MASK (Bit 30) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_SQI_TIMEOUT_MASK_Msk              (0x40000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_SQI_TIMEOUT_MASK (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_SQI_TIMEOUT_MASK                  MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_SQI_TIMEOUT_MASK_Msk
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_PQI_TIMEOUT_MASK_Pos              (29UL)		/*!<MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_PQI_TIMEOUT_MASK (Bit 29) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_PQI_TIMEOUT_MASK_Msk              (0x20000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_PQI_TIMEOUT_MASK (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_PQI_TIMEOUT_MASK                  MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_PQI_TIMEOUT_MASK_Msk
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_CS_TIMEOUT_MASK_Pos               (28UL)		/*!<MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_CS_TIMEOUT_MASK (Bit 28) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_CS_TIMEOUT_MASK_Msk               (0x10000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_CS_TIMEOUT_MASK (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_CS_TIMEOUT_MASK                   MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_CS_TIMEOUT_MASK_Msk
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos                       (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_TIMEOUT (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Msk                       (0x7fffffUL)		/*!< MR_SUBG_GLOB_DYNAMIC RX_TIMER: RX_TIMEOUT (Bitfield-Mask: 0x7fffff) */
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT                           MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Msk
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_0                         (0x1U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_1                         (0x2U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_2                         (0x4U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_3                         (0x8U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_4                         (0x10U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_5                         (0x20U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_6                         (0x40U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_7                         (0x80U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_8                         (0x100U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_9                         (0x200U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_10                        (0x400U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_11                        (0x800U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_12                        (0x1000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_13                        (0x2000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_14                        (0x4000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_15                        (0x8000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_16                        (0x10000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_17                        (0x20000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_18                        (0x40000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_19                        (0x80000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_20                        (0x100000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_21                        (0x200000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_22                        (0x400000U << MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_TIMEOUT_Pos)

/* =====================================================    DATABUFFER_THR    =====================================================*/
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos        (16UL)		/*!<MR_SUBG_GLOB_DYNAMIC DATABUFFER_THR: TX_ALMOST_EMPTY_THR (Bit 16) */
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Msk        (0xffff0000UL)		/*!< MR_SUBG_GLOB_DYNAMIC DATABUFFER_THR: TX_ALMOST_EMPTY_THR (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR            MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Msk
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_0          (0x1U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_1          (0x2U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_2          (0x4U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_3          (0x8U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_4          (0x10U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_5          (0x20U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_6          (0x40U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_7          (0x80U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_8          (0x100U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_9          (0x200U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_10         (0x400U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_11         (0x800U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_12         (0x1000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_13         (0x2000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_14         (0x4000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_15         (0x8000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos         (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC DATABUFFER_THR: RX_ALMOST_FULL_THR (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Msk         (0xffffUL)		/*!< MR_SUBG_GLOB_DYNAMIC DATABUFFER_THR: RX_ALMOST_FULL_THR (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR             MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Msk
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_0           (0x1U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_1           (0x2U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_2           (0x4U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_3           (0x8U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_4           (0x10U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_5           (0x20U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_6           (0x40U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_7           (0x80U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_8           (0x100U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_9           (0x200U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_10          (0x400U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_11          (0x800U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_12          (0x1000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_13          (0x2000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_14          (0x4000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)
#define MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_15          (0x8000U << MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR_Pos)

