stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* ============================================================================================================================*/
/*=====================                                MR_SUBG_GLOB_STATIC                                =====================*/
/* ============================================================================================================================*/

/* =====================================================    PCKT_CONFIG    =====================================================*/
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_Pos                  (30UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: POSTAMBLE_SEQ (Bit 30) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_Msk                  (0xc0000000UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: POSTAMBLE_SEQ (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ                      MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_0                    (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_1                    (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos               (24UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: POSTAMBLE_LENGTH (Bit 24) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Msk               (0x3f000000UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: POSTAMBLE_LENGTH (Bitfield-Mask: 0x3f) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH                   MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_0                 (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_1                 (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_2                 (0x4U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_3                 (0x8U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_4                 (0x10U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_5                 (0x20U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_Pos                   (22UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: PREAMBLE_SEQ (Bit 22) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_Msk                   (0xc00000UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: PREAMBLE_SEQ (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ                       MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_0                     (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_1                     (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos                (12UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: PREAMBLE_LENGTH (Bit 12) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Msk                (0x3ff000UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: PREAMBLE_LENGTH (Bitfield-Mask: 0x3ff) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH                    MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_0                  (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_1                  (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_2                  (0x4U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_3                  (0x8U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_4                  (0x10U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_5                  (0x20U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_6                  (0x40U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_7                  (0x80U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_8                  (0x100U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_9                  (0x200U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN_Pos                    (11UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: FIX_VAR_LEN (Bit 11) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN_Msk                    (0x800UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: FIX_VAR_LEN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN                        MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH_Pos                      (10UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: LEN_WIDTH (Bit 10) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH_Msk                      (0x400UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: LEN_WIDTH (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH                          MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT_Pos                   (9UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: SYNC_PRESENT (Bit 9) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT_Msk                   (0x200UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: SYNC_PRESENT (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT                       MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Pos                       (4UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: SYNC_LEN (Bit 4) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Msk                       (0x1f0UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: SYNC_LEN (Bitfield-Mask: 0x1f) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN                           MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_0                         (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_1                         (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_2                         (0x4U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_3                         (0x8U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_4                         (0x10U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL_Pos             (3UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: SECONDARY_SYNC_SEL (Bit 3) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL_Msk             (0x8UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: SECONDARY_SYNC_SEL (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL                 MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_Pos                       (0UL)		/*!<MR_SUBG_GLOB_STATIC PCKT_CONFIG: CRC_MODE (Bit 0) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_Msk                       (0x7UL)		/*!< MR_SUBG_GLOB_STATIC PCKT_CONFIG: CRC_MODE (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE                           MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_Msk
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_0                         (0x1U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_1                         (0x2U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_2                         (0x4U << MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE_Pos)

/* =====================================================    SYNC    =====================================================*/
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos                                  (0UL)		/*!<MR_SUBG_GLOB_STATIC SYNC: SYNC (Bit 0) */
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_Msk                                  (0xffffffffUL)		/*!< MR_SUBG_GLOB_STATIC SYNC: SYNC (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC                                      MR_SUBG_GLOB_STATIC_SYNC_SYNC_Msk
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_0                                    (0x1U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_1                                    (0x2U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_2                                    (0x4U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_3                                    (0x8U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_4                                    (0x10U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_5                                    (0x20U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_6                                    (0x40U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_7                                    (0x80U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_8                                    (0x100U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_9                                    (0x200U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_10                                   (0x400U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_11                                   (0x800U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_12                                   (0x1000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_13                                   (0x2000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_14                                   (0x4000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_15                                   (0x8000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_16                                   (0x10000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_17                                   (0x20000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_18                                   (0x40000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_19                                   (0x80000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_20                                   (0x100000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_21                                   (0x200000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_22                                   (0x400000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_23                                   (0x800000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_24                                   (0x1000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_25                                   (0x2000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_26                                   (0x4000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_27                                   (0x8000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_28                                   (0x10000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_29                                   (0x20000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_30                                   (0x40000000U << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SYNC_SYNC_31                                   (0x80000000UL << MR_SUBG_GLOB_STATIC_SYNC_SYNC_Pos)

/* =====================================================    SEC_SYNC    =====================================================*/
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos                          (0UL)		/*!<MR_SUBG_GLOB_STATIC SEC_SYNC: SEC_SYNC (Bit 0) */
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Msk                          (0xffffffffUL)		/*!< MR_SUBG_GLOB_STATIC SEC_SYNC: SEC_SYNC (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC                              MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Msk
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_0                            (0x1U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_1                            (0x2U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_2                            (0x4U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_3                            (0x8U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_4                            (0x10U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_5                            (0x20U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_6                            (0x40U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_7                            (0x80U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_8                            (0x100U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_9                            (0x200U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_10                           (0x400U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_11                           (0x800U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_12                           (0x1000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_13                           (0x2000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_14                           (0x4000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_15                           (0x8000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_16                           (0x10000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_17                           (0x20000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_18                           (0x40000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_19                           (0x80000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_20                           (0x100000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_21                           (0x200000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_22                           (0x400000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_23                           (0x800000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_24                           (0x1000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_25                           (0x2000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_26                           (0x4000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_27                           (0x8000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_28                           (0x10000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_29                           (0x20000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_30                           (0x40000000U << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)
#define MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_31                           (0x80000000UL << MR_SUBG_GLOB_STATIC_SEC_SYNC_SEC_SYNC_Pos)

