stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    IF_CTRL    =====================================================*/
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE_Pos                            (31UL)		/*!<MR_SUBG_GLOB_STATIC IF_CTRL: IF_MODE (Bit 31) */
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE_Msk                            (0x80000000UL)		/*!< MR_SUBG_GLOB_STATIC IF_CTRL: IF_MODE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE                                MR_SUBG_GLOB_STATIC_IF_CTRL_IF_MODE_Msk
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos                      (16UL)		/*!<MR_SUBG_GLOB_STATIC IF_CTRL: IF_OFFSET_ANA (Bit 16) */
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Msk                      (0x1fff0000UL)		/*!< MR_SUBG_GLOB_STATIC IF_CTRL: IF_OFFSET_ANA (Bitfield-Mask: 0x1fff) */
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA                          MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Msk
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_0                        (0x1U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_1                        (0x2U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_2                        (0x4U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_3                        (0x8U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_4                        (0x10U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_5                        (0x20U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_6                        (0x40U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_7                        (0x80U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_8                        (0x100U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_9                        (0x200U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_10                       (0x400U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_11                       (0x800U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_12                       (0x1000U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_ANA_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos                      (0UL)		/*!<MR_SUBG_GLOB_STATIC IF_CTRL: IF_OFFSET_DIG (Bit 0) */
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Msk                      (0x1fffUL)		/*!< MR_SUBG_GLOB_STATIC IF_CTRL: IF_OFFSET_DIG (Bitfield-Mask: 0x1fff) */
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG                          MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Msk
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_0                        (0x1U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_1                        (0x2U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_2                        (0x4U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_3                        (0x8U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_4                        (0x10U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_5                        (0x20U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_6                        (0x40U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_7                        (0x80U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_8                        (0x100U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_9                        (0x200U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_10                       (0x400U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_11                       (0x800U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)
#define MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_12                       (0x1000U << MR_SUBG_GLOB_STATIC_IF_CTRL_IF_OFFSET_DIG_Pos)

/* =====================================================    AS_QI_CTRL    =====================================================*/
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_CS_BLANKING_Pos                  (31UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: AS_CS_BLANKING (Bit 31) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_CS_BLANKING_Msk                  (0x80000000UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: AS_CS_BLANKING (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_CS_BLANKING                      MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_CS_BLANKING_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_Pos                    (28UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: AS_MEAS_TIME (Bit 28) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_Msk                    (0x70000000UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: AS_MEAS_TIME (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME                        MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_0                      (0x1U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_1                      (0x2U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_2                      (0x4U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_MEAS_TIME_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_Pos                     (26UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: AS_EQU_CTRL (Bit 26) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_Msk                     (0xc000000UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: AS_EQU_CTRL (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL                         MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_0                       (0x1U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_1                       (0x2U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_Pos                         (16UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: SQI_THR (Bit 16) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_Msk                         (0x70000UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: SQI_THR (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR                             MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_0                           (0x1U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_1                           (0x2U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_2                           (0x4U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_EN_Pos                          (15UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: SQI_EN (Bit 15) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_EN_Msk                          (0x8000UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: SQI_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_EN                              MR_SUBG_GLOB_STATIC_AS_QI_CTRL_SQI_EN_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_Pos                         (13UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: CS_MODE (Bit 13) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_Msk                         (0x6000UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: CS_MODE (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE                             MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_0                           (0x1U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_1                           (0x2U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_CS_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Pos                         (9UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: PQI_THR (Bit 9) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Msk                         (0x1e00UL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: PQI_THR (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR                             MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_0                           (0x1U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_1                           (0x2U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_2                           (0x4U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_3                           (0x8U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_PQI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos                        (0UL)		/*!<MR_SUBG_GLOB_STATIC AS_QI_CTRL: RSSI_THR (Bit 0) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Msk                        (0x1ffUL)		/*!< MR_SUBG_GLOB_STATIC AS_QI_CTRL: RSSI_THR (Bitfield-Mask: 0x1ff) */
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR                            MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Msk
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_0                          (0x1U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_1                          (0x2U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_2                          (0x4U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_3                          (0x8U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_4                          (0x10U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_5                          (0x20U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_6                          (0x40U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_7                          (0x80U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)
#define MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_8                          (0x100U << MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR_Pos)

/* =====================================================    IQC_CONFIG    =====================================================*/
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_ENABLE_Pos                      (31UL)		/*!<MR_SUBG_GLOB_STATIC IQC_CONFIG: IQC_ENABLE (Bit 31) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_ENABLE_Msk                      (0x80000000UL)		/*!< MR_SUBG_GLOB_STATIC IQC_CONFIG: IQC_ENABLE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_ENABLE                          MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_ENABLE_Msk
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_REUSE_CORRECTION_Pos                (30UL)		/*!<MR_SUBG_GLOB_STATIC IQC_CONFIG: REUSE_CORRECTION (Bit 30) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_REUSE_CORRECTION_Msk                (0x40000000UL)		/*!< MR_SUBG_GLOB_STATIC IQC_CONFIG: REUSE_CORRECTION (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_REUSE_CORRECTION                    MR_SUBG_GLOB_STATIC_IQC_CONFIG_REUSE_CORRECTION_Msk
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_LOAD_IQC_INIT_Pos                   (29UL)		/*!<MR_SUBG_GLOB_STATIC IQC_CONFIG: LOAD_IQC_INIT (Bit 29) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_LOAD_IQC_INIT_Msk                   (0x20000000UL)		/*!< MR_SUBG_GLOB_STATIC IQC_CONFIG: LOAD_IQC_INIT (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_LOAD_IQC_INIT                       MR_SUBG_GLOB_STATIC_IQC_CONFIG_LOAD_IQC_INIT_Msk
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos                  (0UL)		/*!<MR_SUBG_GLOB_STATIC IQC_CONFIG: IQC_CORRECT_IN (Bit 0) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Msk                  (0xffffffUL)		/*!< MR_SUBG_GLOB_STATIC IQC_CONFIG: IQC_CORRECT_IN (Bitfield-Mask: 0xffffff) */
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN                      MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Msk
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_0                    (0x1U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_1                    (0x2U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_2                    (0x4U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_3                    (0x8U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_4                    (0x10U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_5                    (0x20U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_6                    (0x40U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_7                    (0x80U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_8                    (0x100U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_9                    (0x200U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_10                   (0x400U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_11                   (0x800U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_12                   (0x1000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_13                   (0x2000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_14                   (0x4000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_15                   (0x8000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_16                   (0x10000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_17                   (0x20000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_18                   (0x40000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_19                   (0x80000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_20                   (0x100000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_21                   (0x200000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_22                   (0x400000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)
#define MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_23                   (0x800000U << MR_SUBG_GLOB_STATIC_IQC_CONFIG_IQC_CORRECT_IN_Pos)

/* =====================================================    DSSS_CTRL    =====================================================*/
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos                          (10UL)		/*!<MR_SUBG_GLOB_STATIC DSSS_CTRL: ACQ_THR (Bit 10) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Msk                          (0xfc00UL)		/*!< MR_SUBG_GLOB_STATIC DSSS_CTRL: ACQ_THR (Bitfield-Mask: 0x3f) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR                              MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Msk
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_0                            (0x1U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_1                            (0x2U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_2                            (0x4U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_3                            (0x8U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_4                            (0x10U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_5                            (0x20U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_THR_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_Pos                         (8UL)		/*!<MR_SUBG_GLOB_STATIC DSSS_CTRL: ACQ_HITS (Bit 8) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_Msk                         (0x300UL)		/*!< MR_SUBG_GLOB_STATIC DSSS_CTRL: ACQ_HITS (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS                             MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_Msk
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_0                           (0x1U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_1                           (0x2U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_HITS_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_DSSS_EN_Pos                          (7UL)		/*!<MR_SUBG_GLOB_STATIC DSSS_CTRL: DSSS_EN (Bit 7) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_DSSS_EN_Msk                          (0x80UL)		/*!< MR_SUBG_GLOB_STATIC DSSS_CTRL: DSSS_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_DSSS_EN                              MR_SUBG_GLOB_STATIC_DSSS_CTRL_DSSS_EN_Msk
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_Pos                    (4UL)		/*!<MR_SUBG_GLOB_STATIC DSSS_CTRL: SPREADING_EXP (Bit 4) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_Msk                    (0x70UL)		/*!< MR_SUBG_GLOB_STATIC DSSS_CTRL: SPREADING_EXP (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP                        MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_Msk
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_0                      (0x1U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_1                      (0x2U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_2                      (0x4U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_SPREADING_EXP_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Pos                       (0UL)		/*!<MR_SUBG_GLOB_STATIC DSSS_CTRL: ACQ_WINDOW (Bit 0) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Msk                       (0xfUL)		/*!< MR_SUBG_GLOB_STATIC DSSS_CTRL: ACQ_WINDOW (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW                           MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Msk
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_0                         (0x1U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_1                         (0x2U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_2                         (0x4U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Pos)
#define MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_3                         (0x8U << MR_SUBG_GLOB_STATIC_DSSS_CTRL_ACQ_WINDOW_Pos)


