stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    CLKREC_CTRL0    =====================================================*/
#define MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN_Pos                          (7UL)		/*!<MR_SUBG_RADIO CLKREC_CTRL0: PSTFLT_LEN (Bit 7) */
#define MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN_Msk                          (0x80UL)		/*!< MR_SUBG_RADIO CLKREC_CTRL0: PSTFLT_LEN (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN                              MR_SUBG_RADIO_CLKREC_CTRL0_PSTFLT_LEN_Msk
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_Pos                  (4UL)		/*!<MR_SUBG_RADIO CLKREC_CTRL0: CLKREC_P_GAIN_FAST (Bit 4) */
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_Msk                  (0x70UL)		/*!< MR_SUBG_RADIO CLKREC_CTRL0: CLKREC_P_GAIN_FAST (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST                      MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_Msk
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_0                    (0x1U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_1                    (0x2U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_2                    (0x4U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_P_GAIN_FAST_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Pos                  (0UL)		/*!<MR_SUBG_RADIO CLKREC_CTRL0: CLKREC_I_GAIN_FAST (Bit 0) */
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Msk                  (0xfUL)		/*!< MR_SUBG_RADIO CLKREC_CTRL0: CLKREC_I_GAIN_FAST (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST                      MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Msk
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_0                    (0x1U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_1                    (0x2U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_2                    (0x4U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_3                    (0x8U << MR_SUBG_RADIO_CLKREC_CTRL0_CLKREC_I_GAIN_FAST_Pos)

/* =====================================================    CLKREC_CTRL1    =====================================================*/
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_ALGO_SEL_Pos                     (7UL)		/*!<MR_SUBG_RADIO CLKREC_CTRL1: CLKREC_ALGO_SEL (Bit 7) */
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_ALGO_SEL_Msk                     (0x80UL)		/*!< MR_SUBG_RADIO CLKREC_CTRL1: CLKREC_ALGO_SEL (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_ALGO_SEL                         MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_ALGO_SEL_Msk
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_Pos                  (4UL)		/*!<MR_SUBG_RADIO CLKREC_CTRL1: CLKREC_P_GAIN_SLOW (Bit 4) */
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_Msk                  (0x70UL)		/*!< MR_SUBG_RADIO CLKREC_CTRL1: CLKREC_P_GAIN_SLOW (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW                      MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_Msk
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_0                    (0x1U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_1                    (0x2U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_2                    (0x4U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_P_GAIN_SLOW_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Pos                  (0UL)		/*!<MR_SUBG_RADIO CLKREC_CTRL1: CLKREC_I_GAIN_SLOW (Bit 0) */
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Msk                  (0xfUL)		/*!< MR_SUBG_RADIO CLKREC_CTRL1: CLKREC_I_GAIN_SLOW (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW                      MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Msk
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_0                    (0x1U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_1                    (0x2U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_2                    (0x4U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Pos)
#define MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_3                    (0x8U << MR_SUBG_RADIO_CLKREC_CTRL1_CLKREC_I_GAIN_SLOW_Pos)

/* =====================================================    DCREM_CTRL0    =====================================================*/
#define MR_SUBG_RADIO_DCREM_CTRL0_TRACK_GAIN_Pos                           (7UL)		/*!<MR_SUBG_RADIO DCREM_CTRL0: TRACK_GAIN (Bit 7) */
#define MR_SUBG_RADIO_DCREM_CTRL0_TRACK_GAIN_Msk                           (0x80UL)		/*!< MR_SUBG_RADIO DCREM_CTRL0: TRACK_GAIN (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_DCREM_CTRL0_TRACK_GAIN                               MR_SUBG_RADIO_DCREM_CTRL0_TRACK_GAIN_Msk
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Pos                           (0UL)		/*!<MR_SUBG_RADIO DCREM_CTRL0: START_GAIN (Bit 0) */
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Msk                           (0x1fUL)		/*!< MR_SUBG_RADIO DCREM_CTRL0: START_GAIN (Bitfield-Mask: 0x1f) */
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN                               MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Msk
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_0                             (0x1U << MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_1                             (0x2U << MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_2                             (0x4U << MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_3                             (0x8U << MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Pos)
#define MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_4                             (0x10U << MR_SUBG_RADIO_DCREM_CTRL0_START_GAIN_Pos)

