stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    AGC0_CTRL    =====================================================*/
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_EN_Pos                                 (7UL)		/*!<MR_SUBG_RADIO AGC0_CTRL: AGC_EN (Bit 7) */
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_EN_Msk                                 (0x80UL)		/*!< MR_SUBG_RADIO AGC0_CTRL: AGC_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_EN                                     MR_SUBG_RADIO_AGC0_CTRL_AGC_EN_Msk
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_START_ONHOLD_Pos                       (6UL)		/*!<MR_SUBG_RADIO AGC0_CTRL: AGC_START_ONHOLD (Bit 6) */
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_START_ONHOLD_Msk                       (0x40UL)		/*!< MR_SUBG_RADIO AGC0_CTRL: AGC_START_ONHOLD (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_START_ONHOLD                           MR_SUBG_RADIO_AGC0_CTRL_AGC_START_ONHOLD_Msk
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos                          (0UL)		/*!<MR_SUBG_RADIO AGC0_CTRL: AGC_HOLD_TIME (Bit 0) */
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Msk                          (0x3fUL)		/*!< MR_SUBG_RADIO AGC0_CTRL: AGC_HOLD_TIME (Bitfield-Mask: 0x3f) */
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME                              MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Msk
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_0                            (0x1U << MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos)
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_1                            (0x2U << MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos)
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_2                            (0x4U << MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos)
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_3                            (0x8U << MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos)
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_4                            (0x10U << MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos)
#define MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_5                            (0x20U << MR_SUBG_RADIO_AGC0_CTRL_AGC_HOLD_TIME_Pos)

/* =====================================================    AGC1_CTRL    =====================================================*/
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Pos                            (4UL)		/*!<MR_SUBG_RADIO AGC1_CTRL: AGC_MAX_THR (Bit 4) */
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Msk                            (0xf0UL)		/*!< MR_SUBG_RADIO AGC1_CTRL: AGC_MAX_THR (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR                                MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Msk
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_0                              (0x1U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_1                              (0x2U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_2                              (0x4U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_3                              (0x8U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MAX_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Pos                            (0UL)		/*!<MR_SUBG_RADIO AGC1_CTRL: AGC_MIN_THR (Bit 0) */
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Msk                            (0xfUL)		/*!< MR_SUBG_RADIO AGC1_CTRL: AGC_MIN_THR (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR                                MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Msk
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_0                              (0x1U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_1                              (0x2U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_2                              (0x4U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Pos)
#define MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_3                              (0x8U << MR_SUBG_RADIO_AGC1_CTRL_AGC_MIN_THR_Pos)

/* =====================================================    AGC2_CTRL    =====================================================*/
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_HIGH_ATTEN_MODE_Pos                    (7UL)		/*!<MR_SUBG_RADIO AGC2_CTRL: AGC_HIGH_ATTEN_MODE (Bit 7) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_HIGH_ATTEN_MODE_Msk                    (0x80UL)		/*!< MR_SUBG_RADIO AGC2_CTRL: AGC_HIGH_ATTEN_MODE (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_HIGH_ATTEN_MODE                        MR_SUBG_RADIO_AGC2_CTRL_AGC_HIGH_ATTEN_MODE_Msk
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_STEADY_Pos                   (6UL)		/*!<MR_SUBG_RADIO AGC2_CTRL: AGC_FREEZE_ON_STEADY (Bit 6) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_STEADY_Msk                   (0x40UL)		/*!< MR_SUBG_RADIO AGC2_CTRL: AGC_FREEZE_ON_STEADY (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_STEADY                       MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_STEADY_Msk
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_SYNC_Pos                     (5UL)		/*!<MR_SUBG_RADIO AGC2_CTRL: AGC_FREEZE_ON_SYNC (Bit 5) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_SYNC_Msk                     (0x20UL)		/*!< MR_SUBG_RADIO AGC2_CTRL: AGC_FREEZE_ON_SYNC (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_SYNC                         MR_SUBG_RADIO_AGC2_CTRL_AGC_FREEZE_ON_SYNC_Msk
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_START_MAX_ATTEN_Pos                    (4UL)		/*!<MR_SUBG_RADIO AGC2_CTRL: AGC_START_MAX_ATTEN (Bit 4) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_START_MAX_ATTEN_Msk                    (0x10UL)		/*!< MR_SUBG_RADIO AGC2_CTRL: AGC_START_MAX_ATTEN (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_START_MAX_ATTEN                        MR_SUBG_RADIO_AGC2_CTRL_AGC_START_MAX_ATTEN_Msk
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Pos                          (0UL)		/*!<MR_SUBG_RADIO AGC2_CTRL: AGC_MEAS_TIME (Bit 0) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Msk                          (0xfUL)		/*!< MR_SUBG_RADIO AGC2_CTRL: AGC_MEAS_TIME (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME                              MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Msk
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_0                            (0x1U << MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Pos)
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_1                            (0x2U << MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Pos)
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_2                            (0x4U << MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Pos)
#define MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_3                            (0x8U << MR_SUBG_RADIO_AGC2_CTRL_AGC_MEAS_TIME_Pos)

/* =====================================================    AGC3_CTRL    =====================================================*/
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Pos                          (4UL)		/*!<MR_SUBG_RADIO AGC3_CTRL: AGC_MAX_ATTEN (Bit 4) */
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Msk                          (0xf0UL)		/*!< MR_SUBG_RADIO AGC3_CTRL: AGC_MAX_ATTEN (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN                              MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Msk
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_0                            (0x1U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_1                            (0x2U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_2                            (0x4U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_3                            (0x8U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MAX_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Pos                          (0UL)		/*!<MR_SUBG_RADIO AGC3_CTRL: AGC_MIN_ATTEN (Bit 0) */
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Msk                          (0xfUL)		/*!< MR_SUBG_RADIO AGC3_CTRL: AGC_MIN_ATTEN (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN                              MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Msk
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_0                            (0x1U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_1                            (0x2U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_2                            (0x4U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Pos)
#define MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_3                            (0x8U << MR_SUBG_RADIO_AGC3_CTRL_AGC_MIN_ATTEN_Pos)

/* =====================================================    AGC4_CTRL    =====================================================*/
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Pos                         (0UL)		/*!<MR_SUBG_RADIO AGC4_CTRL: AGC_FREEZE_THR (Bit 0) */
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Msk                         (0xfUL)		/*!< MR_SUBG_RADIO AGC4_CTRL: AGC_FREEZE_THR (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR                             MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Msk
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_0                           (0x1U << MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Pos)
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_1                           (0x2U << MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Pos)
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_2                           (0x4U << MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Pos)
#define MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_3                           (0x8U << MR_SUBG_RADIO_AGC4_CTRL_AGC_FREEZE_THR_Pos)

