stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WL3x/Include/stm32wl3xx.h
/* =====================================================    AGC4_ATTEN_TRIM    =====================================================*/
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos               (0UL)		/*!<MR_SUBG_RADIO AGC4_ATTEN_TRIM: AGC4_ATTEN_TRIM_IN (Bit 0) */
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Msk               (0xffUL)		/*!< MR_SUBG_RADIO AGC4_ATTEN_TRIM: AGC4_ATTEN_TRIM_IN (Bitfield-Mask: 0xff) */
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN                   MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Msk
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_0                 (0x1U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_1                 (0x2U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_2                 (0x4U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_3                 (0x8U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_4                 (0x10U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_5                 (0x20U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_6                 (0x40U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)
#define MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_7                 (0x80U << MR_SUBG_RADIO_AGC4_ATTEN_TRIM_AGC4_ATTEN_TRIM_IN_Pos)

/* =====================================================    AGC_PGA_HWTRIM_OUT    =====================================================*/
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Pos               (0UL)		/*!<MR_SUBG_RADIO AGC_PGA_HWTRIM_OUT: AGC_HW_PGA_TRIM (Bit 0) */
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Msk               (0xfUL)		/*!< MR_SUBG_RADIO AGC_PGA_HWTRIM_OUT: AGC_HW_PGA_TRIM (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM                   MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Msk
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_0                 (0x1U << MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Pos)
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_1                 (0x2U << MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Pos)
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_2                 (0x4U << MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Pos)
#define MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_3                 (0x8U << MR_SUBG_RADIO_AGC_PGA_HWTRIM_OUT_AGC_HW_PGA_TRIM_Pos)

/* =====================================================    PA_REG    =====================================================*/
#define MR_SUBG_RADIO_PA_REG_PA_DEGEN_ON_Pos                               (3UL)		/*!<MR_SUBG_RADIO PA_REG: PA_DEGEN_ON (Bit 3) */
#define MR_SUBG_RADIO_PA_REG_PA_DEGEN_ON_Msk                               (0x8UL)		/*!< MR_SUBG_RADIO PA_REG: PA_DEGEN_ON (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_PA_REG_PA_DEGEN_ON                                   MR_SUBG_RADIO_PA_REG_PA_DEGEN_ON_Msk
#define MR_SUBG_RADIO_PA_REG_CFG_FILT_Pos                                  (0UL)		/*!<MR_SUBG_RADIO PA_REG: CFG_FILT (Bit 0) */
#define MR_SUBG_RADIO_PA_REG_CFG_FILT_Msk                                  (0x3UL)		/*!< MR_SUBG_RADIO PA_REG: CFG_FILT (Bitfield-Mask: 0x03) */
#define MR_SUBG_RADIO_PA_REG_CFG_FILT                                      MR_SUBG_RADIO_PA_REG_CFG_FILT_Msk
#define MR_SUBG_RADIO_PA_REG_CFG_FILT_0                                    (0x1U << MR_SUBG_RADIO_PA_REG_CFG_FILT_Pos)
#define MR_SUBG_RADIO_PA_REG_CFG_FILT_1                                    (0x2U << MR_SUBG_RADIO_PA_REG_CFG_FILT_Pos)

/* =====================================================    PA_HWTRIM_OUT    =====================================================*/
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Pos                   (4UL)		/*!<MR_SUBG_RADIO PA_HWTRIM_OUT: PA_HW_DEGEN_TRIM (Bit 4) */
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Msk                   (0xf0UL)		/*!< MR_SUBG_RADIO PA_HWTRIM_OUT: PA_HW_DEGEN_TRIM (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM                       MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Msk
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_0                     (0x1U << MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Pos)
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_1                     (0x2U << MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Pos)
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_2                     (0x4U << MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Pos)
#define MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_3                     (0x8U << MR_SUBG_RADIO_PA_HWTRIM_OUT_PA_HW_DEGEN_TRIM_Pos)

/* =====================================================    RSSI_FLT    =====================================================*/
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Pos                                (4UL)		/*!<MR_SUBG_RADIO RSSI_FLT: RSSI_FLT (Bit 4) */
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Msk                                (0xf0UL)		/*!< MR_SUBG_RADIO RSSI_FLT: RSSI_FLT (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT                                    MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Msk
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_0                                  (0x1U << MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_1                                  (0x2U << MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_2                                  (0x4U << MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_3                                  (0x8U << MR_SUBG_RADIO_RSSI_FLT_RSSI_FLT_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Pos                          (0UL)		/*!<MR_SUBG_RADIO RSSI_FLT: OOK_PEAK_DECAY (Bit 0) */
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Msk                          (0xfUL)		/*!< MR_SUBG_RADIO RSSI_FLT: OOK_PEAK_DECAY (Bitfield-Mask: 0x0f) */
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY                              MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Msk
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_0                            (0x1U << MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_1                            (0x2U << MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_2                            (0x4U << MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Pos)
#define MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_3                            (0x8U << MR_SUBG_RADIO_RSSI_FLT_OOK_PEAK_DECAY_Pos)

/* =====================================================    SYNTH2_ANA_ENG    =====================================================*/
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_LD_WIN_ACC_Pos                (3UL)		/*!<MR_SUBG_RADIO SYNTH2_ANA_ENG: RFD_PLL_LD_WIN_ACC (Bit 3) */
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_LD_WIN_ACC_Msk                (0x8UL)		/*!< MR_SUBG_RADIO SYNTH2_ANA_ENG: RFD_PLL_LD_WIN_ACC (Bitfield-Mask: 0x01) */
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_LD_WIN_ACC                    MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_LD_WIN_ACC_Msk
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_Pos               (0UL)		/*!<MR_SUBG_RADIO SYNTH2_ANA_ENG: RFD_PLL_VCO_ALC_AMP (Bit 0) */
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_Msk               (0x7UL)		/*!< MR_SUBG_RADIO SYNTH2_ANA_ENG: RFD_PLL_VCO_ALC_AMP (Bitfield-Mask: 0x07) */
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP                   MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_Msk
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_0                 (0x1U << MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_Pos)
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_1                 (0x2U << MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_Pos)
#define MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_2                 (0x4U << MR_SUBG_RADIO_SYNTH2_ANA_ENG_RFD_PLL_VCO_ALC_AMP_Pos)

